; ModuleID = '29i3b70x5xirxi42'
source_filename = "29i3b70x5xirxi42"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128"
target triple = "arm64-apple-macosx11.0.0"

%"core::ops::range::Bound<&usize>" = type { i64, [1 x i64] }
%"core::ops::range::Range<usize>" = type { i64, i64 }
%"core::ptr::metadata::PtrComponents<[u8]>" = type { ptr, i64 }
%"core::ptr::metadata::PtrRepr<[u8]>" = type { [2 x i64] }
%"core::option::Option<(usize, &[u8])>" = type { [1 x i64], ptr, [1 x i64] }
%"core::option::Option<&[u8]>" = type { ptr, [1 x i64] }
%"core::ops::control_flow::ControlFlow<core::option::Option<core::convert::Infallible>, &[u8]>" = type { ptr, [1 x i64] }
%"core::option::Option<core::convert::Infallible>::None" = type {}
%"core::option::Option<(usize, &u8)>" = type { [1 x i64], ptr }
%"core::slice::iter::Iter<'_, u8>" = type { ptr, ptr, %"core::marker::PhantomData<&u8>" }
%"core::marker::PhantomData<&u8>" = type {}
%"core::result::Result<engine::DecodeMetadata, decode::DecodeSliceError>" = type { i64, [2 x i64] }
%"decode::DecodeSliceError" = type { i8, [15 x i8] }
%"decode::DecodeError" = type { i8, [15 x i8] }
%"core::option::Option<usize>" = type { i64, [1 x i64] }
%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, %"core::option::Option<&[core::fmt::rt::Placeholder]>" }
%"core::option::Option<&[core::fmt::rt::Placeholder]>" = type { ptr, [1 x i64] }
%"core::option::Option<&str>" = type { ptr, [1 x i64] }
%"core::fmt::rt::UnsafeArg" = type { {} }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<core::str::error::Utf8Error as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::str::error::Utf8Error as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !26, identifier: "4acfc6e0cbfd37e7feaf7a89851d60c9")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "Utf8Error", scope: !13, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !16, templateParams: !26, identifier: "576f96cde9095875e7d2677498e65186")
!13 = !DINamespace(name: "error", scope: !14)
!14 = !DINamespace(name: "str", scope: !15)
!15 = !DINamespace(name: "core", scope: null)
!16 = !{!17, !18}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "valid_up_to", scope: !12, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagProtected)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "error_len", scope: !12, file: !2, baseType: !19, size: 16, align: 8, offset: 64, flags: DIFlagProtected)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u8>", scope: !20, file: !2, size: 16, align: 8, flags: DIFlagPublic, elements: !21, templateParams: !26, identifier: "f68e5625b06cfbc63f6ef7f34f132b6d")
!20 = !DINamespace(name: "option", scope: !15)
!21 = !{!22}
!22 = !DICompositeType(tag: DW_TAG_variant_part, scope: !19, file: !2, size: 16, align: 8, elements: !23, templateParams: !26, identifier: "ebea272aed683d35eb99c53402fa6fc6", discriminator: !34)
!23 = !{!24, !30}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !22, file: !2, baseType: !25, size: 16, align: 8, extraData: i128 0)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !19, file: !2, size: 16, align: 8, flags: DIFlagPublic, elements: !26, templateParams: !27, identifier: "275a2ec76318631aa97710f64a754448")
!26 = !{}
!27 = !{!28}
!28 = !DITemplateTypeParameter(name: "T", type: !29)
!29 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !22, file: !2, baseType: !31, size: 16, align: 8, extraData: i128 1)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !19, file: !2, size: 16, align: 8, flags: DIFlagPublic, elements: !32, templateParams: !27, identifier: "33ee13694c11378fd5ccf65cf3083104")
!32 = !{!33}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !31, file: !2, baseType: !29, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, scope: !19, file: !2, baseType: !29, size: 8, align: 8, flags: DIFlagArtificial)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "<core::array::TryFromSliceError as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !37, isLocal: true, isDefinition: true)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::array::TryFromSliceError as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !38, vtableHolder: !43, templateParams: !26, identifier: "9e93bcef68c1feaf475d47c7a5706ee9")
!38 = !{!39, !40, !41, !42}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !37, file: !2, baseType: !6, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !37, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !37, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !37, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "TryFromSliceError", scope: !44, file: !2, align: 8, flags: DIFlagPublic, elements: !45, templateParams: !26, identifier: "880c994c762c7d2e7f0463a9ae403a40")
!44 = !DINamespace(name: "array", scope: !15)
!45 = !{!46}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !43, file: !2, baseType: !7, align: 8, flags: DIFlagPrivate)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "<usize as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !49, isLocal: true, isDefinition: true)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "<usize as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !50, vtableHolder: !9, templateParams: !26, identifier: "9e427bca19119b32a78dec258f75463b")
!50 = !{!51, !52, !53, !54}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !49, file: !2, baseType: !6, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !49, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !49, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !49, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "<&core::option::Option<u8> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !57, isLocal: true, isDefinition: true)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&core::option::Option<u8> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !58, vtableHolder: !63, templateParams: !26, identifier: "a5df31e80980cdccfec9fa4a8f0d9ae")
!58 = !{!59, !60, !61, !62}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !57, file: !2, baseType: !6, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !57, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !57, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !57, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::option::Option<u8>", baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(name: "<&u8 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !66, isLocal: true, isDefinition: true)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u8 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !67, vtableHolder: !72, templateParams: !26, identifier: "68f27b67c5a99fb38ceb5464aef36f06")
!67 = !{!68, !69, !70, !71}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !66, file: !2, baseType: !6, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !66, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !66, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !66, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !29, size: 64, align: 64, dwarfAddressSpace: 0)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "<&() as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !75, isLocal: true, isDefinition: true)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&() as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !76, vtableHolder: !81, templateParams: !26, identifier: "5f5f8a8bf9e0d198a0202032c4ac8672")
!76 = !{!77, !78, !79, !80}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !75, file: !2, baseType: !6, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !75, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !75, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !75, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "<base64::decode::DecodeError as core::error::Error>::{vtable}", scope: null, file: !2, type: !84, isLocal: true, isDefinition: true)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "<base64::decode::DecodeError as core::error::Error>::{vtable_type}", file: !2, size: 704, align: 64, flags: DIFlagArtificial, elements: !85, vtableHolder: !97, templateParams: !26, identifier: "c5ba1592fe7c29f9f126307c0c43e476")
!85 = !{!86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !84, file: !2, baseType: !6, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !84, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !84, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !84, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !84, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__super_trait_ptr5", scope: !84, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__method6", scope: !84, file: !2, baseType: !6, size: 64, align: 64, offset: 384)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__method7", scope: !84, file: !2, baseType: !6, size: 64, align: 64, offset: 448)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__method8", scope: !84, file: !2, baseType: !6, size: 64, align: 64, offset: 512)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__method9", scope: !84, file: !2, baseType: !6, size: 64, align: 64, offset: 576)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__method10", scope: !84, file: !2, baseType: !6, size: 64, align: 64, offset: 640)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeError", scope: !98, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !100, templateParams: !26, identifier: "46fa2769fd69a0c177cdf5475eafffb")
!98 = !DINamespace(name: "decode", scope: !99)
!99 = !DINamespace(name: "base64", scope: null)
!100 = !{!101}
!101 = !DICompositeType(tag: DW_TAG_variant_part, scope: !97, file: !2, size: 128, align: 64, elements: !102, templateParams: !26, identifier: "b1b916cb66d15e8951d09b35f2d57d53", discriminator: !119)
!102 = !{!103, !108, !112, !117}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidByte", scope: !101, file: !2, baseType: !104, size: 128, align: 64, extraData: i128 0)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidByte", scope: !97, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !105, templateParams: !26, identifier: "36963af85456acfeb45944bd5974044f")
!105 = !{!106, !107}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !104, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !104, file: !2, baseType: !29, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidLength", scope: !101, file: !2, baseType: !109, size: 128, align: 64, extraData: i128 1)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidLength", scope: !97, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !110, templateParams: !26, identifier: "1aa9853373e34660dcf391cd6044c06a")
!110 = !{!111}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !109, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidLastSymbol", scope: !101, file: !2, baseType: !113, size: 128, align: 64, extraData: i128 2)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidLastSymbol", scope: !97, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !114, templateParams: !26, identifier: "cb14f58d7459979320104f0e5c2ec47e")
!114 = !{!115, !116}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !113, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !113, file: !2, baseType: !29, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidPadding", scope: !101, file: !2, baseType: !118, size: 128, align: 64, extraData: i128 3)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidPadding", scope: !97, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !26, identifier: "1c6123a5c8d2fcf2be9dac2012683487")
!119 = !DIDerivedType(tag: DW_TAG_member, scope: !97, file: !2, baseType: !29, size: 8, align: 8, flags: DIFlagArtificial)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "<&usize as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !122, isLocal: true, isDefinition: true)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&usize as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !123, vtableHolder: !128, templateParams: !26, identifier: "7e6750a5355375eca2d7011c7d6ef463")
!123 = !{!124, !125, !126, !127}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !122, file: !2, baseType: !6, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !122, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !122, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !122, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!129 = !{i32 8, !"PIC Level", i32 2}
!130 = !{i32 2, !"Dwarf Version", i32 4}
!131 = !{i32 2, !"Debug Info Version", i32 3}
!132 = !{!"rustc version 1.78.0-nightly (46b180ec2 2024-03-08)"}
!133 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !134, producer: "clang LLVM (rustc version 1.78.0-nightly (46b180ec2 2024-03-08))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !135, globals: !232, splitDebugInlining: false, nameTableKind: None)
!134 = !DIFile(filename: "src/lib.rs/@/29i3b70x5xirxi42", directory: "/private/var/folders/m6/nyw0tbd5239gngtm06pzykr00000gn/T/.tmpPXbnuW/base64")
!135 = !{!136, !144, !151, !220, !226}
!136 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !137, file: !2, baseType: !29, size: 8, align: 8, flags: DIFlagEnumClass, elements: !139)
!137 = !DINamespace(name: "rt", scope: !138)
!138 = !DINamespace(name: "fmt", scope: !15)
!139 = !{!140, !141, !142, !143}
!140 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!141 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!142 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!143 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!144 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !145, file: !2, baseType: !146, size: 8, align: 8, flags: DIFlagEnumClass, elements: !147)
!145 = !DINamespace(name: "cmp", scope: !15)
!146 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!147 = !{!148, !149, !150}
!148 = !DIEnumerator(name: "Less", value: -1)
!149 = !DIEnumerator(name: "Equal", value: 0)
!150 = !DIEnumerator(name: "Greater", value: 1)
!151 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AlignmentEnum", scope: !152, file: !2, baseType: !154, size: 64, align: 64, flags: DIFlagEnumClass, elements: !155)
!152 = !DINamespace(name: "alignment", scope: !153)
!153 = !DINamespace(name: "ptr", scope: !15)
!154 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!155 = !{!156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219}
!156 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!157 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!158 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!159 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!160 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!161 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!162 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!163 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!164 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!165 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!166 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!167 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!168 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!169 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!170 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!171 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!172 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!173 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!174 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!175 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!176 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!177 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!178 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!179 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!180 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!181 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!182 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!183 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!184 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!185 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!186 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!187 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!188 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!189 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!190 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!191 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!192 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!193 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!194 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!195 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!196 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!197 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!198 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!199 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!200 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!201 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!202 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!203 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!204 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!205 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!206 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!207 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!208 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!209 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!210 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!211 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!212 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!213 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!214 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!215 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!216 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!217 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!218 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!219 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!220 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !221, file: !2, baseType: !29, size: 8, align: 8, flags: DIFlagEnumClass, elements: !222)
!221 = !DINamespace(name: "panicking", scope: !15)
!222 = !{!223, !224, !225}
!223 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!224 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!225 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!226 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DecodePaddingMode", scope: !227, file: !2, baseType: !29, size: 8, align: 8, flags: DIFlagEnumClass, elements: !228)
!227 = !DINamespace(name: "engine", scope: !99)
!228 = !{!229, !230, !231}
!229 = !DIEnumerator(name: "Indifferent", value: 0, isUnsigned: true)
!230 = !DIEnumerator(name: "RequireCanonical", value: 1, isUnsigned: true)
!231 = !DIEnumerator(name: "RequireNone", value: 2, isUnsigned: true)
!232 = !{!0, !35, !47, !55, !64, !73, !82, !120}
!233 = distinct !DISubprogram(name: "start_bound<usize>", linkageName: "_ZN100_$LT$core..ops..range..RangeInclusive$LT$T$GT$$u20$as$u20$core..ops..range..RangeBounds$LT$T$GT$$GT$11start_bound17h5d941291100153deE", scope: !235, file: !234, line: 878, type: !238, scopeLine: 878, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !268, retainedNodes: !266)
!234 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/ops/range.rs", directory: "", checksumkind: CSK_MD5, checksum: "44047655df81d7676fd58263ec85f88e")
!235 = !DINamespace(name: "{impl#19}", scope: !236)
!236 = !DINamespace(name: "range", scope: !237)
!237 = !DINamespace(name: "ops", scope: !15)
!238 = !DISubroutineType(types: !239)
!239 = !{!240, !257}
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "Bound<&usize>", scope: !236, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !241, templateParams: !26, identifier: "71c904a4ac630dc2b0bcf5e6a6f89856")
!241 = !{!242}
!242 = !DICompositeType(tag: DW_TAG_variant_part, scope: !240, file: !2, size: 128, align: 64, elements: !243, templateParams: !26, identifier: "ced4e9460d7a1b7b8ae5aeea62868dd", discriminator: !256)
!243 = !{!244, !250, !254}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "Included", scope: !242, file: !2, baseType: !245, size: 128, align: 64, extraData: i128 0)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "Included", scope: !240, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !246, templateParams: !248, identifier: "cfbed98edf91af42ce85f7c633307a4c")
!246 = !{!247}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !245, file: !2, baseType: !128, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!248 = !{!249}
!249 = !DITemplateTypeParameter(name: "T", type: !128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "Excluded", scope: !242, file: !2, baseType: !251, size: 128, align: 64, extraData: i128 1)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "Excluded", scope: !240, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !252, templateParams: !248, identifier: "c596100a69d3c654a0597080a4967e3c")
!252 = !{!253}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !251, file: !2, baseType: !128, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "Unbounded", scope: !242, file: !2, baseType: !255, size: 128, align: 64, extraData: i128 2)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unbounded", scope: !240, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !26, templateParams: !248, identifier: "95109bd29f217281fba18874ee36c6aa")
!256 = !DIDerivedType(tag: DW_TAG_member, scope: !240, file: !2, baseType: !154, size: 64, align: 64, flags: DIFlagArtificial)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::ops::range::RangeInclusive<usize>", baseType: !258, size: 64, align: 64, dwarfAddressSpace: 0)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeInclusive<usize>", scope: !236, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !259, templateParams: !264, identifier: "c7c1ca88443d41ba3c3c774767ab0772")
!259 = !{!260, !261, !262}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !258, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagProtected)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !258, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagProtected)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "exhausted", scope: !258, file: !2, baseType: !263, size: 8, align: 8, offset: 128, flags: DIFlagProtected)
!263 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!264 = !{!265}
!265 = !DITemplateTypeParameter(name: "Idx", type: !9)
!266 = !{!267}
!267 = !DILocalVariable(name: "self", arg: 1, scope: !233, file: !234, line: 878, type: !257)
!268 = !{!269}
!269 = !DITemplateTypeParameter(name: "T", type: !9)
!270 = !DILocation(line: 878, column: 20, scope: !233)
!271 = !DILocation(line: 879, column: 9, scope: !233)
!272 = !DILocation(line: 880, column: 6, scope: !233)
!273 = !{i64 0, i64 3}
!274 = distinct !DISubprogram(name: "end_bound<usize>", linkageName: "_ZN100_$LT$core..ops..range..RangeInclusive$LT$T$GT$$u20$as$u20$core..ops..range..RangeBounds$LT$T$GT$$GT$9end_bound17h9485b721ae87480bE", scope: !235, file: !234, line: 881, type: !238, scopeLine: 881, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !268, retainedNodes: !275)
!275 = !{!276}
!276 = !DILocalVariable(name: "self", arg: 1, scope: !274, file: !234, line: 881, type: !257)
!277 = !DILocation(line: 881, column: 18, scope: !274)
!278 = !DILocation(line: 882, column: 12, scope: !274)
!279 = !{i8 0, i8 2}
!280 = !DILocation(line: 887, column: 22, scope: !274)
!281 = !DILocation(line: 887, column: 13, scope: !274)
!282 = !DILocation(line: 882, column: 9, scope: !274)
!283 = !DILocation(line: 885, column: 22, scope: !274)
!284 = !DILocation(line: 885, column: 13, scope: !274)
!285 = !DILocation(line: 889, column: 6, scope: !274)
!286 = distinct !DISubprogram(name: "get_unchecked<u8>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$13get_unchecked17h3be89a617ac12cbfE", scope: !288, file: !287, line: 369, type: !291, scopeLine: 369, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !27, retainedNodes: !302)
!287 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/slice/index.rs", directory: "", checksumkind: CSK_MD5, checksum: "64a8de5498ea10af39073650ed20d9c4")
!288 = !DINamespace(name: "{impl#4}", scope: !289)
!289 = !DINamespace(name: "index", scope: !290)
!290 = !DINamespace(name: "slice", scope: !15)
!291 = !DISubroutineType(types: !292)
!292 = !{!293, !298, !293}
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const [u8]", file: !2, size: 128, align: 64, elements: !294, templateParams: !26, identifier: "a329dffc2f36de2e98a77091932cf429")
!294 = !{!295, !297}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !293, file: !2, baseType: !296, size: 64, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64, dwarfAddressSpace: 0)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !293, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "Range<usize>", scope: !236, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !299, templateParams: !264, identifier: "f65b1cf4d4964ccf292dc65f489dea85")
!299 = !{!300, !301}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !298, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPublic)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !298, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!302 = !{!303, !304, !305}
!303 = !DILocalVariable(name: "self", arg: 1, scope: !286, file: !287, line: 369, type: !298)
!304 = !DILocalVariable(name: "slice", arg: 2, scope: !286, file: !287, line: 369, type: !293)
!305 = !DILocalVariable(name: "new_len", scope: !306, file: !287, line: 380, type: !9, align: 8)
!306 = distinct !DILexicalBlock(scope: !286, file: !287, line: 380, column: 13)
!307 = !DILocation(line: 369, column: 29, scope: !286)
!308 = !DILocation(line: 369, column: 35, scope: !286)
!309 = !DILocalVariable(name: "self", arg: 1, scope: !310, file: !311, line: 1666, type: !293)
!310 = distinct !DILexicalBlock(scope: !312, file: !311, line: 1666, column: 5)
!311 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/ptr/const_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "497dd18e023476b8914a8083d081a04c")
!312 = distinct !DISubprogram(name: "len<u8>", linkageName: "_ZN4core3ptr9const_ptr43_$LT$impl$u20$$BP$const$u20$$u5b$T$u5d$$GT$3len17h679b9af7a9abeb93E", scope: !313, file: !311, line: 1666, type: !315, scopeLine: 1666, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !27, retainedNodes: !317)
!313 = !DINamespace(name: "{impl#1}", scope: !314)
!314 = !DINamespace(name: "const_ptr", scope: !153)
!315 = !DISubroutineType(types: !316)
!316 = !{!9, !293}
!317 = !{!309}
!318 = !DILocation(line: 1666, column: 22, scope: !310, inlinedAt: !319)
!319 = !DILocation(line: 371, column: 57, scope: !286)
!320 = !DILocalVariable(name: "ptr", arg: 1, scope: !321, file: !322, line: 94, type: !293)
!321 = distinct !DILexicalBlock(scope: !323, file: !322, line: 94, column: 1)
!322 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/ptr/metadata.rs", directory: "", checksumkind: CSK_MD5, checksum: "3e5f46ed28de51d38cc460b6ffb611d6")
!323 = distinct !DISubprogram(name: "metadata<[u8]>", linkageName: "_ZN4core3ptr8metadata8metadata17h2a1bf7688d7db2bdE", scope: !324, file: !322, line: 94, type: !315, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !27, retainedNodes: !325)
!324 = !DINamespace(name: "metadata", scope: !153)
!325 = !{!320}
!326 = !DILocation(line: 94, column: 34, scope: !321, inlinedAt: !327)
!327 = !DILocation(line: 1667, column: 9, scope: !310, inlinedAt: !319)
!328 = !DILocalVariable(name: "self", arg: 1, scope: !329, file: !311, line: 1704, type: !293)
!329 = distinct !DILexicalBlock(scope: !330, file: !311, line: 1704, column: 5)
!330 = distinct !DISubprogram(name: "as_ptr<u8>", linkageName: "_ZN4core3ptr9const_ptr43_$LT$impl$u20$$BP$const$u20$$u5b$T$u5d$$GT$6as_ptr17h40511827095b1d33E", scope: !313, file: !311, line: 1704, type: !331, scopeLine: 1704, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !27, retainedNodes: !334)
!331 = !DISubroutineType(types: !332)
!332 = !{!333, !293}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !29, size: 64, align: 64, dwarfAddressSpace: 0)
!334 = !{!328}
!335 = !DILocation(line: 1704, column: 25, scope: !329, inlinedAt: !336)
!336 = !DILocation(line: 381, column: 45, scope: !306)
!337 = !DILocation(line: 370, column: 9, scope: !286)
!338 = !DILocation(line: 371, column: 13, scope: !286)
!339 = !DILocation(line: 1, column: 1, scope: !340)
!340 = !DILexicalBlockFile(scope: !286, file: !341, discriminator: 0)
!341 = !DIFile(filename: "src/lib.rs", directory: "/private/var/folders/m6/nyw0tbd5239gngtm06pzykr00000gn/T/.tmpPXbnuW/base64", checksumkind: CSK_MD5, checksum: "ece80298f9a9588ec0f838426b12107b")
!342 = !DILocation(line: 98, column: 14, scope: !321, inlinedAt: !327)
!343 = !DILocation(line: 371, column: 39, scope: !286)
!344 = !DILocation(line: 380, column: 51, scope: !286)
!345 = !DILocalVariable(name: "count", arg: 2, scope: !346, file: !311, line: 945, type: !9)
!346 = distinct !DILexicalBlock(scope: !347, file: !311, line: 945, column: 5)
!347 = distinct !DISubprogram(name: "add<u8>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$3add17hf28d80bf3ab7616eE", scope: !348, file: !311, line: 945, type: !349, scopeLine: 945, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !27, retainedNodes: !351)
!348 = !DINamespace(name: "{impl#0}", scope: !314)
!349 = !DISubroutineType(types: !350)
!350 = !{!333, !333, !9}
!351 = !{!352, !345}
!352 = !DILocalVariable(name: "self", arg: 1, scope: !346, file: !311, line: 945, type: !333)
!353 = !DILocation(line: 945, column: 35, scope: !346, inlinedAt: !354)
!354 = !DILocation(line: 381, column: 54, scope: !306)
!355 = !DILocation(line: 380, column: 27, scope: !286)
!356 = !DILocation(line: 380, column: 17, scope: !306)
!357 = !DILocalVariable(name: "len", arg: 2, scope: !358, file: !359, line: 815, type: !9)
!358 = distinct !DILexicalBlock(scope: !360, file: !359, line: 815, column: 1)
!359 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "319662a8f09a06c38fa9ed06f53befd5")
!360 = distinct !DISubprogram(name: "slice_from_raw_parts<u8>", linkageName: "_ZN4core3ptr20slice_from_raw_parts17h8b9ecaa4805dd8f4E", scope: !153, file: !359, line: 815, type: !361, scopeLine: 815, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !27, retainedNodes: !363)
!361 = !DISubroutineType(types: !362)
!362 = !{!293, !333, !9}
!363 = !{!364, !357}
!364 = !DILocalVariable(name: "data", arg: 1, scope: !358, file: !359, line: 815, type: !333)
!365 = !DILocation(line: 815, column: 54, scope: !358, inlinedAt: !366)
!366 = !DILocation(line: 381, column: 13, scope: !306)
!367 = !DILocalVariable(name: "metadata", arg: 2, scope: !368, file: !322, line: 113, type: !9)
!368 = distinct !DILexicalBlock(scope: !369, file: !322, line: 111, column: 1)
!369 = distinct !DISubprogram(name: "from_raw_parts<[u8]>", linkageName: "_ZN4core3ptr8metadata14from_raw_parts17h1b9adadd7c26c666E", scope: !324, file: !322, line: 111, type: !370, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !27, retainedNodes: !372)
!370 = !DISubroutineType(types: !371)
!371 = !{!293, !6, !9}
!372 = !{!373, !367}
!373 = !DILocalVariable(name: "data_pointer", arg: 1, scope: !368, file: !322, line: 112, type: !6)
!374 = !DILocation(line: 113, column: 5, scope: !368, inlinedAt: !375)
!375 = !DILocation(line: 816, column: 5, scope: !358, inlinedAt: !366)
!376 = !DILocation(line: 1705, column: 9, scope: !329, inlinedAt: !336)
!377 = !DILocation(line: 945, column: 29, scope: !346, inlinedAt: !354)
!378 = !DILocation(line: 950, column: 18, scope: !346, inlinedAt: !354)
!379 = !DILocation(line: 815, column: 38, scope: !358, inlinedAt: !366)
!380 = !DILocalVariable(name: "self", arg: 1, scope: !381, file: !311, line: 63, type: !333)
!381 = distinct !DILexicalBlock(scope: !382, file: !311, line: 63, column: 5)
!382 = distinct !DISubprogram(name: "cast<u8, ()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17hf24859ac8945c850E", scope: !348, file: !311, line: 63, type: !383, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !386, retainedNodes: !385)
!383 = !DISubroutineType(types: !384)
!384 = !{!6, !333}
!385 = !{!380}
!386 = !{!28, !387}
!387 = !DITemplateTypeParameter(name: "U", type: !7)
!388 = !DILocation(line: 63, column: 26, scope: !381, inlinedAt: !389)
!389 = !DILocation(line: 816, column: 25, scope: !358, inlinedAt: !366)
!390 = !DILocation(line: 64, column: 9, scope: !381, inlinedAt: !389)
!391 = !DILocation(line: 112, column: 5, scope: !368, inlinedAt: !375)
!392 = !DILocation(line: 118, column: 36, scope: !368, inlinedAt: !375)
!393 = !DILocation(line: 118, column: 14, scope: !368, inlinedAt: !375)
!394 = !DILocation(line: 383, column: 6, scope: !286)
!395 = distinct !DISubprogram(name: "get_unchecked_mut<u8>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$17get_unchecked_mut17h6e892ebc0faac215E", scope: !288, file: !287, line: 386, type: !396, scopeLine: 386, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !27, retainedNodes: !402)
!396 = !DISubroutineType(types: !397)
!397 = !{!398, !298, !398}
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "*mut [u8]", file: !2, size: 128, align: 64, elements: !399, templateParams: !26, identifier: "bd558e033735f213c244d7572860f8f0")
!399 = !{!400, !401}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !398, file: !2, baseType: !296, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !398, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!402 = !{!403, !404, !405}
!403 = !DILocalVariable(name: "self", arg: 1, scope: !395, file: !287, line: 386, type: !298)
!404 = !DILocalVariable(name: "slice", arg: 2, scope: !395, file: !287, line: 386, type: !398)
!405 = !DILocalVariable(name: "new_len", scope: !406, file: !287, line: 393, type: !9, align: 8)
!406 = distinct !DILexicalBlock(scope: !395, file: !287, line: 393, column: 13)
!407 = !DILocation(line: 386, column: 33, scope: !395)
!408 = !DILocation(line: 386, column: 39, scope: !395)
!409 = !DILocalVariable(name: "self", arg: 1, scope: !410, file: !411, line: 1937, type: !398)
!410 = distinct !DILexicalBlock(scope: !412, file: !411, line: 1937, column: 5)
!411 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/ptr/mut_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "1660eb21212d739b6367ea84c0f4f627")
!412 = distinct !DISubprogram(name: "len<u8>", linkageName: "_ZN4core3ptr7mut_ptr41_$LT$impl$u20$$BP$mut$u20$$u5b$T$u5d$$GT$3len17hec2c333a078d5b2eE", scope: !413, file: !411, line: 1937, type: !415, scopeLine: 1937, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !27, retainedNodes: !417)
!413 = !DINamespace(name: "{impl#1}", scope: !414)
!414 = !DINamespace(name: "mut_ptr", scope: !153)
!415 = !DISubroutineType(types: !416)
!416 = !{!9, !398}
!417 = !{!409}
!418 = !DILocation(line: 1937, column: 22, scope: !410, inlinedAt: !419)
!419 = !DILocation(line: 388, column: 57, scope: !395)
!420 = !DILocalVariable(name: "self", arg: 1, scope: !421, file: !411, line: 2073, type: !398)
!421 = distinct !DILexicalBlock(scope: !422, file: !411, line: 2073, column: 5)
!422 = distinct !DISubprogram(name: "as_mut_ptr<u8>", linkageName: "_ZN4core3ptr7mut_ptr41_$LT$impl$u20$$BP$mut$u20$$u5b$T$u5d$$GT$10as_mut_ptr17h8e2b70cee9c8be62E", scope: !413, file: !411, line: 2073, type: !423, scopeLine: 2073, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !27, retainedNodes: !426)
!423 = !DISubroutineType(types: !424)
!424 = !{!425, !398}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !29, size: 64, align: 64, dwarfAddressSpace: 0)
!426 = !{!420}
!427 = !DILocation(line: 2073, column: 29, scope: !421, inlinedAt: !428)
!428 = !DILocation(line: 394, column: 49, scope: !406)
!429 = !DILocation(line: 387, column: 9, scope: !395)
!430 = !DILocation(line: 388, column: 13, scope: !395)
!431 = !DILocation(line: 1, column: 1, scope: !432)
!432 = !DILexicalBlockFile(scope: !395, file: !341, discriminator: 0)
!433 = !DILocation(line: 1938, column: 18, scope: !410, inlinedAt: !419)
!434 = !DILocalVariable(name: "ptr", arg: 1, scope: !435, file: !322, line: 94, type: !293)
!435 = distinct !DILexicalBlock(scope: !436, file: !322, line: 94, column: 1)
!436 = distinct !DISubprogram(name: "metadata<[u8]>", linkageName: "_ZN4core3ptr8metadata8metadata17h2a1bf7688d7db2bdE", scope: !324, file: !322, line: 94, type: !315, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !27, retainedNodes: !437)
!437 = !{!434}
!438 = !DILocation(line: 94, column: 34, scope: !435, inlinedAt: !439)
!439 = !DILocation(line: 1938, column: 9, scope: !410, inlinedAt: !419)
!440 = !DILocation(line: 98, column: 14, scope: !435, inlinedAt: !439)
!441 = !DILocation(line: 388, column: 39, scope: !395)
!442 = !DILocation(line: 393, column: 51, scope: !395)
!443 = !DILocalVariable(name: "count", arg: 2, scope: !444, file: !411, line: 1044, type: !9)
!444 = distinct !DILexicalBlock(scope: !445, file: !411, line: 1044, column: 5)
!445 = distinct !DISubprogram(name: "add<u8>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$3add17hf6b7f069eae6cd3bE", scope: !446, file: !411, line: 1044, type: !447, scopeLine: 1044, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !27, retainedNodes: !449)
!446 = !DINamespace(name: "{impl#0}", scope: !414)
!447 = !DISubroutineType(types: !448)
!448 = !{!425, !425, !9}
!449 = !{!450, !443}
!450 = !DILocalVariable(name: "self", arg: 1, scope: !444, file: !411, line: 1044, type: !425)
!451 = !DILocation(line: 1044, column: 35, scope: !444, inlinedAt: !452)
!452 = !DILocation(line: 394, column: 62, scope: !406)
!453 = !DILocation(line: 393, column: 27, scope: !395)
!454 = !DILocation(line: 393, column: 17, scope: !406)
!455 = !DILocalVariable(name: "len", arg: 2, scope: !456, file: !359, line: 861, type: !9)
!456 = distinct !DILexicalBlock(scope: !457, file: !359, line: 861, column: 1)
!457 = distinct !DISubprogram(name: "slice_from_raw_parts_mut<u8>", linkageName: "_ZN4core3ptr24slice_from_raw_parts_mut17h725ae30101c34b8aE", scope: !153, file: !359, line: 861, type: !458, scopeLine: 861, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !27, retainedNodes: !460)
!458 = !DISubroutineType(types: !459)
!459 = !{!398, !425, !9}
!460 = !{!461, !455}
!461 = !DILocalVariable(name: "data", arg: 1, scope: !456, file: !359, line: 861, type: !425)
!462 = !DILocation(line: 861, column: 56, scope: !456, inlinedAt: !463)
!463 = !DILocation(line: 394, column: 13, scope: !406)
!464 = !DILocalVariable(name: "metadata", arg: 2, scope: !465, file: !322, line: 130, type: !9)
!465 = distinct !DILexicalBlock(scope: !466, file: !322, line: 128, column: 1)
!466 = distinct !DISubprogram(name: "from_raw_parts_mut<[u8]>", linkageName: "_ZN4core3ptr8metadata18from_raw_parts_mut17h49bd4a8d9b1a12d9E", scope: !324, file: !322, line: 128, type: !467, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !27, retainedNodes: !470)
!467 = !DISubroutineType(types: !468)
!468 = !{!398, !469, !9}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!470 = !{!471, !464}
!471 = !DILocalVariable(name: "data_pointer", arg: 1, scope: !465, file: !322, line: 129, type: !469)
!472 = !DILocation(line: 130, column: 5, scope: !465, inlinedAt: !473)
!473 = !DILocation(line: 862, column: 5, scope: !456, inlinedAt: !463)
!474 = !DILocation(line: 2074, column: 9, scope: !421, inlinedAt: !428)
!475 = !DILocation(line: 1044, column: 29, scope: !444, inlinedAt: !452)
!476 = !DILocation(line: 1049, column: 18, scope: !444, inlinedAt: !452)
!477 = !DILocation(line: 861, column: 42, scope: !456, inlinedAt: !463)
!478 = !DILocalVariable(name: "self", arg: 1, scope: !479, file: !411, line: 63, type: !425)
!479 = distinct !DILexicalBlock(scope: !480, file: !411, line: 63, column: 5)
!480 = distinct !DISubprogram(name: "cast<u8, ()>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$4cast17hc49d6b4f314e6723E", scope: !446, file: !411, line: 63, type: !481, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !386, retainedNodes: !483)
!481 = !DISubroutineType(types: !482)
!482 = !{!469, !425}
!483 = !{!478}
!484 = !DILocation(line: 63, column: 26, scope: !479, inlinedAt: !485)
!485 = !DILocation(line: 862, column: 29, scope: !456, inlinedAt: !463)
!486 = !DILocation(line: 64, column: 9, scope: !479, inlinedAt: !485)
!487 = !DILocation(line: 129, column: 5, scope: !465, inlinedAt: !473)
!488 = !DILocation(line: 135, column: 36, scope: !465, inlinedAt: !473)
!489 = !DILocation(line: 135, column: 14, scope: !465, inlinedAt: !473)
!490 = !DILocation(line: 396, column: 6, scope: !395)
!491 = distinct !DISubprogram(name: "index_mut<u8>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17h32b1b3e610792016E", scope: !288, file: !287, line: 410, type: !492, scopeLine: 410, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !27, retainedNodes: !511)
!492 = !DISubroutineType(types: !493)
!493 = !{!494, !298, !494, !498}
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [u8]", file: !2, size: 128, align: 64, elements: !495, templateParams: !26, identifier: "5acbf15c847666982b641ea58cf98317")
!495 = !{!496, !497}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !494, file: !2, baseType: !296, size: 64, align: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !494, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !499, size: 64, align: 64, dwarfAddressSpace: 0)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !500, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !502, templateParams: !26, identifier: "6ab6d19db24f176957abb2edb6f58a8b")
!500 = !DINamespace(name: "location", scope: !501)
!501 = !DINamespace(name: "panic", scope: !15)
!502 = !{!503, !508, !510}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !499, file: !2, baseType: !504, size: 128, align: 64, flags: DIFlagPrivate)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !505, templateParams: !26, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!505 = !{!506, !507}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !504, file: !2, baseType: !296, size: 64, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !504, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !499, file: !2, baseType: !509, size: 32, align: 32, offset: 128, flags: DIFlagPrivate)
!509 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !499, file: !2, baseType: !509, size: 32, align: 32, offset: 160, flags: DIFlagPrivate)
!511 = !{!512, !513}
!512 = !DILocalVariable(name: "self", arg: 1, scope: !491, file: !287, line: 410, type: !298)
!513 = !DILocalVariable(name: "slice", arg: 2, scope: !491, file: !287, line: 410, type: !494)
!514 = !DILocation(line: 410, column: 18, scope: !491)
!515 = !DILocation(line: 410, column: 24, scope: !491)
!516 = !DILocation(line: 411, column: 12, scope: !491)
!517 = !DILocation(line: 413, column: 19, scope: !491)
!518 = !DILocation(line: 412, column: 13, scope: !491)
!519 = !DILocation(line: 417, column: 24, scope: !491)
!520 = !DILocation(line: 418, column: 6, scope: !491)
!521 = !DILocation(line: 414, column: 13, scope: !491)
!522 = distinct !DISubprogram(name: "index_mut<u8>", linkageName: "_ZN108_$LT$core..ops..range..RangeTo$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17hce1f43d12b28d17aE", scope: !523, file: !287, line: 454, type: !524, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !27, retainedNodes: !529)
!523 = !DINamespace(name: "{impl#5}", scope: !289)
!524 = !DISubroutineType(types: !525)
!525 = !{!494, !526, !494, !498}
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeTo<usize>", scope: !236, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !527, templateParams: !264, identifier: "38063346bc1ee7983ab4028d183d5e48")
!527 = !{!528}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !526, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPublic)
!529 = !{!530, !531}
!530 = !DILocalVariable(name: "self", arg: 1, scope: !522, file: !287, line: 454, type: !526)
!531 = !DILocalVariable(name: "slice", arg: 2, scope: !522, file: !287, line: 454, type: !494)
!532 = !DILocation(line: 454, column: 18, scope: !522)
!533 = !DILocation(line: 454, column: 24, scope: !522)
!534 = !DILocation(line: 455, column: 9, scope: !522)
!535 = !DILocation(line: 456, column: 6, scope: !522)
!536 = distinct !DISubprogram(name: "next<core::slice::iter::ChunksExact<u8>>", linkageName: "_ZN110_$LT$core..iter..adapters..enumerate..Enumerate$LT$I$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17h148d49842ef8921dE", scope: !538, file: !537, line: 46, type: !542, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !576, retainedNodes: !578)
!537 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/iter/adapters/enumerate.rs", directory: "", checksumkind: CSK_MD5, checksum: "254bdb66cb6ebf32adae5f675fdd9614")
!538 = !DINamespace(name: "{impl#1}", scope: !539)
!539 = !DINamespace(name: "enumerate", scope: !540)
!540 = !DINamespace(name: "adapters", scope: !541)
!541 = !DINamespace(name: "iter", scope: !15)
!542 = !DISubroutineType(types: !543)
!543 = !{!544, !565}
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<(usize, &[u8])>", scope: !20, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !545, templateParams: !26, identifier: "dfae24eab9d556ccc6bde77d446d0a64")
!545 = !{!546}
!546 = !DICompositeType(tag: DW_TAG_variant_part, scope: !544, file: !2, size: 192, align: 64, elements: !547, templateParams: !26, identifier: "16719dba8af1e462f3844fb379398a94", discriminator: !564)
!547 = !{!548, !560}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !546, file: !2, baseType: !549, size: 192, align: 64, extraData: i128 0)
!549 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !544, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !26, templateParams: !550, identifier: "1def923aae1a482f8c8539628aebaa90")
!550 = !{!551}
!551 = !DITemplateTypeParameter(name: "T", type: !552)
!552 = !DICompositeType(tag: DW_TAG_structure_type, name: "(usize, &[u8])", file: !2, size: 192, align: 64, elements: !553, templateParams: !26, identifier: "ec3a1a003f57824a74ab48238af14b9a")
!553 = !{!554, !555}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !552, file: !2, baseType: !9, size: 64, align: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !552, file: !2, baseType: !556, size: 128, align: 64, offset: 64)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u8]", file: !2, size: 128, align: 64, elements: !557, templateParams: !26, identifier: "4f7d759e2003ffb713a77bd933fd0146")
!557 = !{!558, !559}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !556, file: !2, baseType: !296, size: 64, align: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !556, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !546, file: !2, baseType: !561, size: 192, align: 64)
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !544, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !562, templateParams: !550, identifier: "efe8818692a71311dc12d0136c63ff")
!562 = !{!563}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !561, file: !2, baseType: !552, size: 192, align: 64, flags: DIFlagPublic)
!564 = !DIDerivedType(tag: DW_TAG_member, scope: !544, file: !2, baseType: !154, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::enumerate::Enumerate<core::slice::iter::ChunksExact<u8>>", baseType: !566, size: 64, align: 64, dwarfAddressSpace: 0)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "Enumerate<core::slice::iter::ChunksExact<u8>>", scope: !539, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !567, templateParams: !576, identifier: "74f13461322342ad2bdf35a81693985")
!567 = !{!568, !575}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !566, file: !2, baseType: !569, size: 320, align: 64, flags: DIFlagPrivate)
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "ChunksExact<u8>", scope: !570, file: !2, size: 320, align: 64, flags: DIFlagPublic, elements: !571, templateParams: !27, identifier: "9b51ed112de9934a76ed6f6b18eaa532")
!570 = !DINamespace(name: "iter", scope: !290)
!571 = !{!572, !573, !574}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !569, file: !2, baseType: !556, size: 128, align: 64, flags: DIFlagPrivate)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !569, file: !2, baseType: !556, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !569, file: !2, baseType: !9, size: 64, align: 64, offset: 256, flags: DIFlagPrivate)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !566, file: !2, baseType: !9, size: 64, align: 64, offset: 320, flags: DIFlagPrivate)
!576 = !{!577}
!577 = !DITemplateTypeParameter(name: "I", type: !569)
!578 = !{!579, !580, !582, !600, !602}
!579 = !DILocalVariable(name: "self", arg: 1, scope: !536, file: !537, line: 46, type: !565)
!580 = !DILocalVariable(name: "a", scope: !581, file: !537, line: 47, type: !556, align: 8)
!581 = distinct !DILexicalBlock(scope: !536, file: !537, line: 47, column: 9)
!582 = !DILocalVariable(name: "residual", scope: !583, file: !537, line: 47, type: !584, align: 1)
!583 = distinct !DILexicalBlock(scope: !536, file: !537, line: 47, column: 33)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::convert::Infallible>", scope: !20, file: !2, align: 8, flags: DIFlagPublic, elements: !585, templateParams: !26, identifier: "85ed36b4594dc27a3c9c28e51a2b403")
!585 = !{!586}
!586 = !DICompositeType(tag: DW_TAG_variant_part, scope: !584, file: !2, align: 8, elements: !587, templateParams: !26, identifier: "e77bfd5d6237cf22dbb8fac8af90b86f")
!587 = !{!588, !596}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !586, file: !2, baseType: !589, align: 8)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !584, file: !2, align: 8, flags: DIFlagPublic, elements: !26, templateParams: !590, identifier: "43ded5b9f7a80cfe9656c14752e82df6")
!590 = !{!591}
!591 = !DITemplateTypeParameter(name: "T", type: !592)
!592 = !DICompositeType(tag: DW_TAG_structure_type, name: "Infallible", scope: !593, file: !2, align: 8, flags: DIFlagPublic, elements: !594, templateParams: !26, identifier: "fa13d0b7c38db284bf843fd30710797a")
!593 = !DINamespace(name: "convert", scope: !15)
!594 = !{!595}
!595 = !DICompositeType(tag: DW_TAG_variant_part, scope: !592, file: !2, align: 8, elements: !26, identifier: "5ade76f3e3c84d3f8835c5b79b9ad8")
!596 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !586, file: !2, baseType: !597, align: 8)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !584, file: !2, align: 8, flags: DIFlagPublic, elements: !598, templateParams: !590, identifier: "c60c02c892c6fe5c5ea94a854fef9f6e")
!598 = !{!599}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !597, file: !2, baseType: !592, align: 8, flags: DIFlagPublic)
!600 = !DILocalVariable(name: "val", scope: !601, file: !537, line: 47, type: !556, align: 8)
!601 = distinct !DILexicalBlock(scope: !536, file: !537, line: 47, column: 17)
!602 = !DILocalVariable(name: "i", scope: !603, file: !537, line: 48, type: !9, align: 8)
!603 = distinct !DILexicalBlock(scope: !581, file: !537, line: 48, column: 9)
!604 = !DILocation(line: 47, column: 33, scope: !583)
!605 = !DILocalVariable(name: "residual", scope: !606, file: !607, line: 2496, type: !584, align: 1)
!606 = distinct !DILexicalBlock(scope: !608, file: !607, line: 2496, column: 5)
!607 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/option.rs", directory: "", checksumkind: CSK_MD5, checksum: "290dd9078744531e3e1c26de62cd5c06")
!608 = distinct !DISubprogram(name: "from_residual<(usize, &[u8])>", linkageName: "_ZN84_$LT$core..option..Option$LT$T$GT$$u20$as$u20$core..ops..try_trait..FromResidual$GT$13from_residual17hd059578845e1f432E", scope: !609, file: !607, line: 2496, type: !610, scopeLine: 2496, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !550, retainedNodes: !612)
!609 = !DINamespace(name: "{impl#41}", scope: !20)
!610 = !DISubroutineType(types: !611)
!611 = !{!544, !584}
!612 = !{!605}
!613 = !DILocation(line: 2496, column: 22, scope: !606, inlinedAt: !614)
!614 = !DILocation(line: 47, column: 17, scope: !583)
!615 = !DILocation(line: 46, column: 13, scope: !536)
!616 = !DILocalVariable(name: "self", arg: 1, scope: !617, file: !607, line: 2485, type: !639)
!617 = distinct !DILexicalBlock(scope: !618, file: !607, line: 2485, column: 5)
!618 = distinct !DISubprogram(name: "branch<&[u8]>", linkageName: "_ZN75_$LT$core..option..Option$LT$T$GT$$u20$as$u20$core..ops..try_trait..Try$GT$6branch17h7dd85a75279d7547E", scope: !619, file: !607, line: 2485, type: !620, scopeLine: 2485, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !645, retainedNodes: !652)
!619 = !DINamespace(name: "{impl#40}", scope: !20)
!620 = !DISubroutineType(types: !621)
!621 = !{!622, !639}
!622 = !DICompositeType(tag: DW_TAG_structure_type, name: "ControlFlow<core::option::Option<core::convert::Infallible>, &[u8]>", scope: !623, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !624, templateParams: !26, identifier: "72a2c6b4b0cdaf11f7a3a88ab7f33b0d")
!623 = !DINamespace(name: "control_flow", scope: !237)
!624 = !{!625}
!625 = !DICompositeType(tag: DW_TAG_variant_part, scope: !622, file: !2, size: 128, align: 64, elements: !626, templateParams: !26, identifier: "96388c38a6a73c3a9b6119ea289ee889", discriminator: !638)
!626 = !{!627, !634}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "Continue", scope: !625, file: !2, baseType: !628, size: 128, align: 64)
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "Continue", scope: !622, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !629, templateParams: !631, identifier: "75b841e289ecd47e5029420b3a5cad9b")
!629 = !{!630}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !628, file: !2, baseType: !556, size: 128, align: 64, flags: DIFlagPublic)
!631 = !{!632, !633}
!632 = !DITemplateTypeParameter(name: "B", type: !584)
!633 = !DITemplateTypeParameter(name: "C", type: !556)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "Break", scope: !625, file: !2, baseType: !635, size: 128, align: 64, extraData: i128 0)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "Break", scope: !622, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !636, templateParams: !631, identifier: "5e52d5a6d52a77d478fbcc133778bc29")
!636 = !{!637}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !635, file: !2, baseType: !584, align: 8, flags: DIFlagPublic)
!638 = !DIDerivedType(tag: DW_TAG_member, scope: !622, file: !2, baseType: !154, size: 64, align: 64, flags: DIFlagArtificial)
!639 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[u8]>", scope: !20, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !640, templateParams: !26, identifier: "9d3a9f91fc036c58b88ad4d19fde23e")
!640 = !{!641}
!641 = !DICompositeType(tag: DW_TAG_variant_part, scope: !639, file: !2, size: 128, align: 64, elements: !642, templateParams: !26, identifier: "5852abaa943f06795a24cc8ae7af1cad", discriminator: !651)
!642 = !{!643, !647}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !641, file: !2, baseType: !644, size: 128, align: 64, extraData: i128 0)
!644 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !639, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !26, templateParams: !645, identifier: "180de805395bccc339d95e7705df1f4d")
!645 = !{!646}
!646 = !DITemplateTypeParameter(name: "T", type: !556)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !641, file: !2, baseType: !648, size: 128, align: 64)
!648 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !639, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !649, templateParams: !645, identifier: "35bbc0179a3ae211304b7e033a0ee8db")
!649 = !{!650}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !648, file: !2, baseType: !556, size: 128, align: 64, flags: DIFlagPublic)
!651 = !DIDerivedType(tag: DW_TAG_member, scope: !639, file: !2, baseType: !154, size: 64, align: 64, flags: DIFlagArtificial)
!652 = !{!616, !653}
!653 = !DILocalVariable(name: "v", scope: !654, file: !607, line: 2487, type: !556, align: 8)
!654 = distinct !DILexicalBlock(scope: !617, file: !607, line: 2487, column: 13)
!655 = !DILocation(line: 2485, column: 15, scope: !617, inlinedAt: !656)
!656 = !DILocation(line: 47, column: 17, scope: !536)
!657 = !DILocation(line: 2486, column: 15, scope: !617, inlinedAt: !656)
!658 = !DILocation(line: 2486, column: 9, scope: !617, inlinedAt: !656)
!659 = !DILocation(line: 2498, column: 21, scope: !606, inlinedAt: !614)
!660 = !DILocation(line: 51, column: 6, scope: !536)
!661 = !DILocation(line: 2487, column: 18, scope: !617, inlinedAt: !656)
!662 = !{i64 1}
!663 = !DILocation(line: 2487, column: 18, scope: !654, inlinedAt: !656)
!664 = !DILocation(line: 2487, column: 24, scope: !654, inlinedAt: !656)
!665 = !DILocation(line: 47, column: 17, scope: !601)
!666 = !DILocation(line: 47, column: 13, scope: !581)
!667 = !DILocation(line: 48, column: 17, scope: !581)
!668 = !DILocation(line: 48, column: 13, scope: !603)
!669 = !DILocation(line: 49, column: 9, scope: !603)
!670 = !DILocation(line: 50, column: 14, scope: !603)
!671 = !DILocation(line: 50, column: 9, scope: !603)
!672 = !DILocation(line: 46, column: 5, scope: !536)
!673 = distinct !DISubprogram(name: "next<core::slice::iter::Iter<u8>>", linkageName: "_ZN110_$LT$core..iter..adapters..enumerate..Enumerate$LT$I$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17hd13ccc988d625fc8E", scope: !538, file: !537, line: 46, type: !674, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !711, retainedNodes: !713)
!674 = !DISubroutineType(types: !675)
!675 = !{!676, !693}
!676 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<(usize, &u8)>", scope: !20, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !677, templateParams: !26, identifier: "5301817869ba789712fdd31ae2f9ce4c")
!677 = !{!678}
!678 = !DICompositeType(tag: DW_TAG_variant_part, scope: !676, file: !2, size: 128, align: 64, elements: !679, templateParams: !26, identifier: "117852eec25ce944e84524884711f46d", discriminator: !692)
!679 = !{!680, !688}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !678, file: !2, baseType: !681, size: 128, align: 64, extraData: i128 0)
!681 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !676, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !26, templateParams: !682, identifier: "c852c630f8460deccedeac8a376de87d")
!682 = !{!683}
!683 = !DITemplateTypeParameter(name: "T", type: !684)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "(usize, &u8)", file: !2, size: 128, align: 64, elements: !685, templateParams: !26, identifier: "a113d31851b56d2cadb3096fd26bea18")
!685 = !{!686, !687}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !684, file: !2, baseType: !9, size: 64, align: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !684, file: !2, baseType: !72, size: 64, align: 64, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !678, file: !2, baseType: !689, size: 128, align: 64)
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !676, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !690, templateParams: !682, identifier: "bad615bc6b23f471dc2eb70b3f08ef96")
!690 = !{!691}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !689, file: !2, baseType: !684, size: 128, align: 64, flags: DIFlagPublic)
!692 = !DIDerivedType(tag: DW_TAG_member, scope: !676, file: !2, baseType: !154, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::enumerate::Enumerate<core::slice::iter::Iter<u8>>", baseType: !694, size: 64, align: 64, dwarfAddressSpace: 0)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "Enumerate<core::slice::iter::Iter<u8>>", scope: !539, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !695, templateParams: !711, identifier: "16a40e6316b9ca232dee316d6b6ba042")
!695 = !{!696, !710}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !694, file: !2, baseType: !697, size: 128, align: 64, flags: DIFlagPrivate)
!697 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<u8>", scope: !570, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !698, templateParams: !27, identifier: "c116562857a32c3baab5405f1ba7fe5f")
!698 = !{!699, !704, !705}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !697, file: !2, baseType: !700, size: 64, align: 64, flags: DIFlagPrivate)
!700 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !701, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !702, templateParams: !27, identifier: "e5aae4d783c62ca19d6192838800021b")
!701 = !DINamespace(name: "non_null", scope: !153)
!702 = !{!703}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !700, file: !2, baseType: !333, size: 64, align: 64, flags: DIFlagPrivate)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "end_or_len", scope: !697, file: !2, baseType: !333, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !697, file: !2, baseType: !706, align: 8, offset: 128, flags: DIFlagPrivate)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&u8>", scope: !707, file: !2, align: 8, flags: DIFlagPublic, elements: !26, templateParams: !708, identifier: "4237ba9f5429bb38b8ef8eeadb5127a")
!707 = !DINamespace(name: "marker", scope: !15)
!708 = !{!709}
!709 = !DITemplateTypeParameter(name: "T", type: !72)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !694, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!711 = !{!712}
!712 = !DITemplateTypeParameter(name: "I", type: !697)
!713 = !{!714, !715, !717, !719, !721}
!714 = !DILocalVariable(name: "self", arg: 1, scope: !673, file: !537, line: 46, type: !693)
!715 = !DILocalVariable(name: "a", scope: !716, file: !537, line: 47, type: !72, align: 8)
!716 = distinct !DILexicalBlock(scope: !673, file: !537, line: 47, column: 9)
!717 = !DILocalVariable(name: "residual", scope: !718, file: !537, line: 47, type: !584, align: 1)
!718 = distinct !DILexicalBlock(scope: !673, file: !537, line: 47, column: 33)
!719 = !DILocalVariable(name: "val", scope: !720, file: !537, line: 47, type: !72, align: 8)
!720 = distinct !DILexicalBlock(scope: !673, file: !537, line: 47, column: 17)
!721 = !DILocalVariable(name: "i", scope: !722, file: !537, line: 48, type: !9, align: 8)
!722 = distinct !DILexicalBlock(scope: !716, file: !537, line: 48, column: 9)
!723 = !DILocation(line: 47, column: 33, scope: !718)
!724 = !DILocalVariable(name: "residual", scope: !725, file: !607, line: 2496, type: !584, align: 1)
!725 = distinct !DILexicalBlock(scope: !726, file: !607, line: 2496, column: 5)
!726 = distinct !DISubprogram(name: "from_residual<(usize, &u8)>", linkageName: "_ZN84_$LT$core..option..Option$LT$T$GT$$u20$as$u20$core..ops..try_trait..FromResidual$GT$13from_residual17hfb2eb7e8f6bb2295E", scope: !609, file: !607, line: 2496, type: !727, scopeLine: 2496, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !682, retainedNodes: !729)
!727 = !DISubroutineType(types: !728)
!728 = !{!676, !584}
!729 = !{!724}
!730 = !DILocation(line: 2496, column: 22, scope: !725, inlinedAt: !731)
!731 = !DILocation(line: 47, column: 17, scope: !718)
!732 = !DILocation(line: 46, column: 13, scope: !673)
!733 = !DILocalVariable(name: "self", arg: 1, scope: !734, file: !607, line: 2485, type: !753)
!734 = distinct !DILexicalBlock(scope: !735, file: !607, line: 2485, column: 5)
!735 = distinct !DISubprogram(name: "branch<&u8>", linkageName: "_ZN75_$LT$core..option..Option$LT$T$GT$$u20$as$u20$core..ops..try_trait..Try$GT$6branch17h1d2f0ab1c757ed64E", scope: !619, file: !607, line: 2485, type: !736, scopeLine: 2485, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !708, retainedNodes: !764)
!736 = !DISubroutineType(types: !737)
!737 = !{!738, !753}
!738 = !DICompositeType(tag: DW_TAG_structure_type, name: "ControlFlow<core::option::Option<core::convert::Infallible>, &u8>", scope: !623, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !739, templateParams: !26, identifier: "7c346368e25f8bcac52d7a8851247554")
!739 = !{!740}
!740 = !DICompositeType(tag: DW_TAG_variant_part, scope: !738, file: !2, size: 64, align: 64, elements: !741, templateParams: !26, identifier: "a7a6cc4c939d47371a30074b3007dcee", discriminator: !752)
!741 = !{!742, !748}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "Continue", scope: !740, file: !2, baseType: !743, size: 64, align: 64)
!743 = !DICompositeType(tag: DW_TAG_structure_type, name: "Continue", scope: !738, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !744, templateParams: !746, identifier: "547a48794c7f6b2425f4852b88d6fe7d")
!744 = !{!745}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !743, file: !2, baseType: !72, size: 64, align: 64, flags: DIFlagPublic)
!746 = !{!632, !747}
!747 = !DITemplateTypeParameter(name: "C", type: !72)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "Break", scope: !740, file: !2, baseType: !749, size: 64, align: 64, extraData: i128 0)
!749 = !DICompositeType(tag: DW_TAG_structure_type, name: "Break", scope: !738, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !750, templateParams: !746, identifier: "f2b7dc7e2098981b8ad4033225aa571f")
!750 = !{!751}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !749, file: !2, baseType: !584, align: 8, flags: DIFlagPublic)
!752 = !DIDerivedType(tag: DW_TAG_member, scope: !738, file: !2, baseType: !154, size: 64, align: 64, flags: DIFlagArtificial)
!753 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&u8>", scope: !20, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !754, templateParams: !26, identifier: "d2df813f1c60100f545d34eda7f6cca8")
!754 = !{!755}
!755 = !DICompositeType(tag: DW_TAG_variant_part, scope: !753, file: !2, size: 64, align: 64, elements: !756, templateParams: !26, identifier: "c8e338d0fc22d7dc82eadf5dd2818b67", discriminator: !763)
!756 = !{!757, !759}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !755, file: !2, baseType: !758, size: 64, align: 64, extraData: i128 0)
!758 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !753, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !26, templateParams: !708, identifier: "96407d76ef1aa56712c45d5ca9d7d93f")
!759 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !755, file: !2, baseType: !760, size: 64, align: 64)
!760 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !753, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !761, templateParams: !708, identifier: "4493bba2e1c5820b535ce366ed297651")
!761 = !{!762}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !760, file: !2, baseType: !72, size: 64, align: 64, flags: DIFlagPublic)
!763 = !DIDerivedType(tag: DW_TAG_member, scope: !753, file: !2, baseType: !154, size: 64, align: 64, flags: DIFlagArtificial)
!764 = !{!733, !765}
!765 = !DILocalVariable(name: "v", scope: !766, file: !607, line: 2487, type: !72, align: 8)
!766 = distinct !DILexicalBlock(scope: !734, file: !607, line: 2487, column: 13)
!767 = !DILocation(line: 2485, column: 15, scope: !734, inlinedAt: !768)
!768 = !DILocation(line: 47, column: 17, scope: !673)
!769 = !DILocation(line: 2486, column: 15, scope: !734, inlinedAt: !768)
!770 = !DILocation(line: 2486, column: 9, scope: !734, inlinedAt: !768)
!771 = !DILocation(line: 2498, column: 21, scope: !725, inlinedAt: !731)
!772 = !DILocation(line: 51, column: 6, scope: !673)
!773 = !DILocation(line: 2487, column: 18, scope: !734, inlinedAt: !768)
!774 = !DILocation(line: 2487, column: 18, scope: !766, inlinedAt: !768)
!775 = !DILocation(line: 2487, column: 24, scope: !766, inlinedAt: !768)
!776 = !DILocation(line: 47, column: 17, scope: !720)
!777 = !DILocation(line: 47, column: 13, scope: !716)
!778 = !DILocation(line: 48, column: 17, scope: !716)
!779 = !DILocation(line: 48, column: 13, scope: !722)
!780 = !DILocation(line: 49, column: 9, scope: !722)
!781 = !DILocation(line: 50, column: 14, scope: !722)
!782 = !DILocation(line: 50, column: 9, scope: !722)
!783 = !DILocation(line: 46, column: 5, scope: !673)
!784 = distinct !DISubprogram(name: "index<u8>", linkageName: "_ZN110_$LT$core..ops..range..RangeFrom$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$5index17h61dee3280c2dcde2E", scope: !785, file: !287, line: 487, type: !786, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !27, retainedNodes: !791)
!785 = !DINamespace(name: "{impl#6}", scope: !289)
!786 = !DISubroutineType(types: !787)
!787 = !{!556, !788, !556, !498}
!788 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeFrom<usize>", scope: !236, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !789, templateParams: !264, identifier: "5cfbe8662883bff5c59eb4fe7450c76b")
!789 = !{!790}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !788, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPublic)
!791 = !{!792, !793}
!792 = !DILocalVariable(name: "self", arg: 1, scope: !784, file: !287, line: 487, type: !788)
!793 = !DILocalVariable(name: "slice", arg: 2, scope: !784, file: !287, line: 487, type: !556)
!794 = !DILocation(line: 487, column: 14, scope: !784)
!795 = !DILocation(line: 487, column: 20, scope: !784)
!796 = !DILocalVariable(name: "slice", arg: 2, scope: !797, file: !287, line: 475, type: !556)
!797 = distinct !DILexicalBlock(scope: !798, file: !287, line: 475, column: 5)
!798 = distinct !DISubprogram(name: "get_unchecked<u8>", linkageName: "_ZN110_$LT$core..ops..range..RangeFrom$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$13get_unchecked17h18ce00be112fd1b9E", scope: !785, file: !287, line: 475, type: !799, scopeLine: 475, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !27, retainedNodes: !801)
!799 = !DISubroutineType(types: !800)
!800 = !{!293, !788, !293}
!801 = !{!802, !796}
!802 = !DILocalVariable(name: "self", scope: !797, file: !287, line: 475, type: !788, align: 8)
!803 = !DILocation(line: 475, column: 35, scope: !797, inlinedAt: !804)
!804 = !DILocation(line: 492, column: 25, scope: !784)
!805 = !DILocalVariable(name: "self", arg: 1, scope: !806, file: !311, line: 1666, type: !556)
!806 = distinct !DILexicalBlock(scope: !807, file: !311, line: 1666, column: 5)
!807 = distinct !DISubprogram(name: "len<u8>", linkageName: "_ZN4core3ptr9const_ptr43_$LT$impl$u20$$BP$const$u20$$u5b$T$u5d$$GT$3len17h679b9af7a9abeb93E", scope: !313, file: !311, line: 1666, type: !315, scopeLine: 1666, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !27, retainedNodes: !808)
!808 = !{!805}
!809 = !DILocation(line: 1666, column: 22, scope: !806, inlinedAt: !810)
!810 = !DILocation(line: 477, column: 37, scope: !797, inlinedAt: !804)
!811 = !DILocalVariable(name: "ptr", arg: 1, scope: !812, file: !322, line: 94, type: !556)
!812 = distinct !DILexicalBlock(scope: !813, file: !322, line: 94, column: 1)
!813 = distinct !DISubprogram(name: "metadata<[u8]>", linkageName: "_ZN4core3ptr8metadata8metadata17h2a1bf7688d7db2bdE", scope: !324, file: !322, line: 94, type: !315, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !27, retainedNodes: !814)
!814 = !{!811}
!815 = !DILocation(line: 94, column: 34, scope: !812, inlinedAt: !816)
!816 = !DILocation(line: 1667, column: 9, scope: !806, inlinedAt: !810)
!817 = !DILocation(line: 488, column: 12, scope: !784)
!818 = !DILocation(line: 475, column: 29, scope: !797, inlinedAt: !804)
!819 = !DILocation(line: 98, column: 14, scope: !812, inlinedAt: !816)
!820 = !DILocation(line: 477, column: 18, scope: !797, inlinedAt: !804)
!821 = !DILocation(line: 493, column: 6, scope: !784)
!822 = !DILocation(line: 489, column: 13, scope: !784)
!823 = distinct !DISubprogram(name: "spec_extend<u8, alloc::alloc::Global>", linkageName: "_ZN132_$LT$alloc..vec..Vec$LT$T$C$A$GT$$u20$as$u20$alloc..vec..spec_extend..SpecExtend$LT$$RF$T$C$core..slice..iter..Iter$LT$T$GT$$GT$$GT$11spec_extend17h1a51f7ffb6cfb3b4E", scope: !825, file: !824, line: 53, type: !829, scopeLine: 53, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !852, retainedNodes: !855)
!824 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/alloc/src/vec/spec_extend.rs", directory: "", checksumkind: CSK_MD5, checksum: "2f128aa8845f656bd1589710f5c6857d")
!825 = !DINamespace(name: "{impl#4}", scope: !826)
!826 = !DINamespace(name: "spec_extend", scope: !827)
!827 = !DINamespace(name: "vec", scope: !828)
!828 = !DINamespace(name: "alloc", scope: null)
!829 = !DISubroutineType(types: !830)
!830 = !{null, !831, !697}
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut alloc::vec::Vec<u8, alloc::alloc::Global>", baseType: !832, size: 64, align: 64, dwarfAddressSpace: 0)
!832 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !827, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !833, templateParams: !852, identifier: "75493663ebbb7ddde98b0972cfe88517")
!833 = !{!834, !854}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !832, file: !2, baseType: !835, size: 128, align: 64, flags: DIFlagPrivate)
!835 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !836, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !837, templateParams: !852, identifier: "46cd84c18a5643544a9147019d5a6d93")
!836 = !DINamespace(name: "raw_vec", scope: !828)
!837 = !{!838, !845, !849}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !835, file: !2, baseType: !839, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!839 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !840, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !841, templateParams: !27, identifier: "9b0a3349739844f85f1609423a392ced")
!840 = !DINamespace(name: "unique", scope: !153)
!841 = !{!842, !843}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !839, file: !2, baseType: !700, size: 64, align: 64, flags: DIFlagPrivate)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !839, file: !2, baseType: !844, align: 8, offset: 64, flags: DIFlagPrivate)
!844 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !707, file: !2, align: 8, flags: DIFlagPublic, elements: !26, templateParams: !27, identifier: "d374584ddc3e1e4bf64f7a4ecd03e9bd")
!845 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !835, file: !2, baseType: !846, size: 64, align: 64, flags: DIFlagPrivate)
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cap", scope: !836, file: !2, size: 64, align: 64, flags: DIFlagPrivate, elements: !847, templateParams: !26, identifier: "f6e0172a239b20d5c4e40f5321e726d6")
!847 = !{!848}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !846, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !835, file: !2, baseType: !850, align: 8, offset: 128, flags: DIFlagPrivate)
!850 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !851, file: !2, align: 8, flags: DIFlagPublic, elements: !26, identifier: "565e9af856f873ca6c6565cfe9042298")
!851 = !DINamespace(name: "alloc", scope: !828)
!852 = !{!28, !853}
!853 = !DITemplateTypeParameter(name: "A", type: !850)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !832, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!855 = !{!856, !857, !858}
!856 = !DILocalVariable(name: "self", arg: 1, scope: !823, file: !824, line: 53, type: !831)
!857 = !DILocalVariable(name: "iterator", arg: 2, scope: !823, file: !824, line: 53, type: !697)
!858 = !DILocalVariable(name: "slice", scope: !859, file: !824, line: 54, type: !556, align: 8)
!859 = distinct !DILexicalBlock(scope: !823, file: !824, line: 54, column: 9)
!860 = !DILocation(line: 53, column: 20, scope: !823)
!861 = !DILocation(line: 53, column: 31, scope: !823)
!862 = !DILocation(line: 54, column: 21, scope: !823)
!863 = !DILocalVariable(name: "self", arg: 1, scope: !864, file: !865, line: 128, type: !869)
!864 = distinct !DILexicalBlock(scope: !866, file: !865, line: 128, column: 5)
!865 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/slice/iter.rs", directory: "", checksumkind: CSK_MD5, checksum: "284abbc45dd478622cb5da8bc571a86b")
!866 = distinct !DISubprogram(name: "as_slice<u8>", linkageName: "_ZN4core5slice4iter13Iter$LT$T$GT$8as_slice17h67500b25d9376f2cE", scope: !697, file: !865, line: 128, type: !867, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !27, declaration: !870, retainedNodes: !871)
!867 = !DISubroutineType(types: !868)
!868 = !{!556, !869}
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::slice::iter::Iter<u8>", baseType: !697, size: 64, align: 64, dwarfAddressSpace: 0)
!870 = !DISubprogram(name: "as_slice<u8>", linkageName: "_ZN4core5slice4iter13Iter$LT$T$GT$8as_slice17h67500b25d9376f2cE", scope: !697, file: !865, line: 128, type: !867, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !27)
!871 = !{!863}
!872 = !DILocation(line: 128, column: 21, scope: !864, inlinedAt: !873)
!873 = !DILocation(line: 54, column: 30, scope: !823)
!874 = !DILocalVariable(name: "self", arg: 1, scope: !875, file: !876, line: 90, type: !869)
!875 = distinct !DISubprogram(name: "make_slice<u8>", linkageName: "_ZN4core5slice4iter13Iter$LT$T$GT$10make_slice17h9a5bf9fecca435f5E", scope: !697, file: !876, line: 90, type: !867, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !27, declaration: !877, retainedNodes: !878)
!876 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/slice/iter/macros.rs", directory: "", checksumkind: CSK_MD5, checksum: "6f8ffd7d957e2a854f35c0c786a4dddb")
!877 = !DISubprogram(name: "make_slice<u8>", linkageName: "_ZN4core5slice4iter13Iter$LT$T$GT$10make_slice17h9a5bf9fecca435f5E", scope: !697, file: !876, line: 90, type: !867, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !27)
!878 = !{!874, !879, !881}
!879 = !DILocalVariable(name: "len", scope: !880, file: !876, line: 94, type: !9, align: 8)
!880 = distinct !DILexicalBlock(scope: !875, file: !876, line: 29, column: 13)
!881 = !DILocalVariable(name: "end", scope: !882, file: !876, line: 94, type: !700, align: 8)
!882 = distinct !DILexicalBlock(scope: !875, file: !876, line: 33, column: 13)
!883 = !DILocation(line: 90, column: 27, scope: !875, inlinedAt: !884)
!884 = distinct !DILocation(line: 129, column: 9, scope: !864, inlinedAt: !873)
!885 = !DILocalVariable(name: "len", arg: 2, scope: !886, file: !887, line: 95, type: !9)
!886 = distinct !DILexicalBlock(scope: !888, file: !887, line: 95, column: 1)
!887 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/slice/raw.rs", directory: "", checksumkind: CSK_MD5, checksum: "aab168912ad7aca64110c98f212940ac")
!888 = distinct !DISubprogram(name: "from_raw_parts<u8>", linkageName: "_ZN4core5slice3raw14from_raw_parts17h0170088d494e1defE", scope: !889, file: !887, line: 95, type: !890, scopeLine: 95, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !27, retainedNodes: !892)
!889 = !DINamespace(name: "raw", scope: !290)
!890 = !DISubroutineType(types: !891)
!891 = !{!556, !333, !9}
!892 = !{!893, !885}
!893 = !DILocalVariable(name: "data", arg: 1, scope: !886, file: !887, line: 95, type: !333)
!894 = !DILocation(line: 95, column: 59, scope: !886, inlinedAt: !895)
!895 = distinct !DILocation(line: 94, column: 26, scope: !875, inlinedAt: !884)
!896 = !DILocalVariable(name: "len", arg: 2, scope: !897, file: !359, line: 815, type: !9)
!897 = distinct !DILexicalBlock(scope: !898, file: !359, line: 815, column: 1)
!898 = distinct !DISubprogram(name: "slice_from_raw_parts<u8>", linkageName: "_ZN4core3ptr20slice_from_raw_parts17h8b9ecaa4805dd8f4E", scope: !153, file: !359, line: 815, type: !361, scopeLine: 815, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !27, retainedNodes: !899)
!899 = !{!900, !896}
!900 = !DILocalVariable(name: "data", arg: 1, scope: !897, file: !359, line: 815, type: !333)
!901 = !DILocation(line: 815, column: 54, scope: !897, inlinedAt: !902)
!902 = distinct !DILocation(line: 109, column: 11, scope: !886, inlinedAt: !895)
!903 = !DILocalVariable(name: "metadata", arg: 2, scope: !904, file: !322, line: 113, type: !9)
!904 = distinct !DILexicalBlock(scope: !905, file: !322, line: 111, column: 1)
!905 = distinct !DISubprogram(name: "from_raw_parts<[u8]>", linkageName: "_ZN4core3ptr8metadata14from_raw_parts17h1b9adadd7c26c666E", scope: !324, file: !322, line: 111, type: !370, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !27, retainedNodes: !906)
!906 = !{!907, !903}
!907 = !DILocalVariable(name: "data_pointer", arg: 1, scope: !904, file: !322, line: 112, type: !6)
!908 = !DILocation(line: 113, column: 5, scope: !904, inlinedAt: !909)
!909 = distinct !DILocation(line: 816, column: 5, scope: !897, inlinedAt: !902)
!910 = !DILocation(line: 94, column: 41, scope: !875, inlinedAt: !884)
!911 = !DILocalVariable(name: "self", arg: 1, scope: !912, file: !913, line: 349, type: !700)
!912 = distinct !DILexicalBlock(scope: !914, file: !913, line: 349, column: 5)
!913 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/ptr/non_null.rs", directory: "", checksumkind: CSK_MD5, checksum: "a145fe82a5df4d863530a0287eb10483")
!914 = distinct !DISubprogram(name: "as_ptr<u8>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$6as_ptr17h36959b3d99ce0c25E", scope: !700, file: !913, line: 349, type: !915, scopeLine: 349, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !27, declaration: !917, retainedNodes: !918)
!915 = !DISubroutineType(types: !916)
!916 = !{!425, !700}
!917 = !DISubprogram(name: "as_ptr<u8>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$6as_ptr17h36959b3d99ce0c25E", scope: !700, file: !913, line: 349, type: !915, scopeLine: 349, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !27)
!918 = !{!911}
!919 = !DILocation(line: 349, column: 25, scope: !912, inlinedAt: !920)
!920 = distinct !DILocation(line: 94, column: 50, scope: !875, inlinedAt: !884)
!921 = !DILocalVariable(name: "subtracted", arg: 2, scope: !922, file: !913, line: 952, type: !700)
!922 = distinct !DILexicalBlock(scope: !923, file: !913, line: 952, column: 5)
!923 = distinct !DISubprogram(name: "sub_ptr<u8>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$7sub_ptr17h7b56496de72f6b89E", scope: !700, file: !913, line: 952, type: !924, scopeLine: 952, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !27, declaration: !926, retainedNodes: !927)
!924 = !DISubroutineType(types: !925)
!925 = !{!9, !700, !700}
!926 = !DISubprogram(name: "sub_ptr<u8>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$7sub_ptr17h7b56496de72f6b89E", scope: !700, file: !913, line: 952, type: !924, scopeLine: 952, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !27)
!927 = !{!928, !921}
!928 = !DILocalVariable(name: "self", arg: 1, scope: !922, file: !913, line: 952, type: !700)
!929 = !DILocation(line: 952, column: 39, scope: !922, inlinedAt: !930)
!930 = distinct !DILocation(line: 57, column: 30, scope: !882, inlinedAt: !884)
!931 = !DILocation(line: 350, column: 9, scope: !912, inlinedAt: !920)
!932 = !DILocation(line: 95, column: 43, scope: !886, inlinedAt: !895)
!933 = !DILocation(line: 815, column: 38, scope: !897, inlinedAt: !902)
!934 = !DILocalVariable(name: "self", arg: 1, scope: !935, file: !311, line: 63, type: !333)
!935 = distinct !DILexicalBlock(scope: !936, file: !311, line: 63, column: 5)
!936 = distinct !DISubprogram(name: "cast<u8, ()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17hf24859ac8945c850E", scope: !348, file: !311, line: 63, type: !383, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !386, retainedNodes: !937)
!937 = !{!938, !934}
!938 = !DILocalVariable(name: "self", arg: 1, scope: !939, file: !311, line: 63, type: !333)
!939 = distinct !DILexicalBlock(scope: !936, file: !311, line: 63, column: 5)
!940 = !DILocation(line: 63, column: 26, scope: !935, inlinedAt: !941)
!941 = distinct !DILocation(line: 816, column: 25, scope: !897, inlinedAt: !902)
!942 = !DILocation(line: 94, column: 60, scope: !875, inlinedAt: !884)
!943 = !DILocalVariable(name: "self", arg: 1, scope: !944, file: !311, line: 63, type: !949)
!944 = distinct !DILexicalBlock(scope: !945, file: !311, line: 63, column: 5)
!945 = distinct !DISubprogram(name: "cast<*const u8, core::ptr::non_null::NonNull<u8>>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17h8e433425f4f5df58E", scope: !348, file: !311, line: 63, type: !946, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !951, retainedNodes: !950)
!946 = !DISubroutineType(types: !947)
!947 = !{!948, !949}
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const core::ptr::non_null::NonNull<u8>", baseType: !700, size: 64, align: 64, dwarfAddressSpace: 0)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const *const u8", baseType: !333, size: 64, align: 64, dwarfAddressSpace: 0)
!950 = !{!943}
!951 = !{!952, !953}
!952 = !DITemplateTypeParameter(name: "T", type: !333)
!953 = !DITemplateTypeParameter(name: "U", type: !700)
!954 = !DILocation(line: 63, column: 26, scope: !944, inlinedAt: !955)
!955 = distinct !DILocation(line: 33, column: 66, scope: !875, inlinedAt: !884)
!956 = !DILocation(line: 94, column: 60, scope: !882, inlinedAt: !884)
!957 = !DILocation(line: 952, column: 33, scope: !922, inlinedAt: !930)
!958 = !DILocation(line: 957, column: 18, scope: !922, inlinedAt: !930)
!959 = !DILocation(line: 98, column: 9, scope: !886, inlinedAt: !895)
!960 = !DILocation(line: 64, column: 9, scope: !935, inlinedAt: !941)
!961 = !DILocation(line: 112, column: 5, scope: !904, inlinedAt: !909)
!962 = !DILocation(line: 118, column: 36, scope: !904, inlinedAt: !909)
!963 = !DILocation(line: 118, column: 14, scope: !904, inlinedAt: !909)
!964 = !DILocation(line: 95, column: 14, scope: !875, inlinedAt: !884)
!965 = !DILocation(line: 129, column: 9, scope: !864, inlinedAt: !873)
!966 = !DILocation(line: 54, column: 13, scope: !859)
!967 = !DILocation(line: 55, column: 18, scope: !859)
!968 = !DILocation(line: 56, column: 6, scope: !823)
!969 = distinct !DISubprogram(name: "from_residual<base64::engine::DecodeMetadata, base64::decode::DecodeError, base64::decode::DecodeSliceError>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17hd0d022149a662e6dE", scope: !971, file: !970, line: 1962, type: !973, scopeLine: 1962, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !1035, retainedNodes: !1031)
!970 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/result.rs", directory: "", checksumkind: CSK_MD5, checksum: "96c793a7caa821b2d8ecbbb7303607a6")
!971 = !DINamespace(name: "{impl#27}", scope: !972)
!972 = !DINamespace(name: "result", scope: !15)
!973 = !DISubroutineType(types: !974)
!974 = !{!975, !1017, !498}
!975 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<base64::engine::DecodeMetadata, base64::decode::DecodeSliceError>", scope: !972, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !976, templateParams: !26, identifier: "d4ce247e2f566bf4524a7019ba5bdc8")
!976 = !{!977}
!977 = !DICompositeType(tag: DW_TAG_variant_part, scope: !975, file: !2, size: 192, align: 64, elements: !978, templateParams: !26, identifier: "11fb7122741cc8e596cd9ba77beb682a", discriminator: !1016)
!978 = !{!979, !1012}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !977, file: !2, baseType: !980, size: 192, align: 64)
!980 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !975, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !981, templateParams: !998, identifier: "c462f22fe5425831bc27f6f20bcfa25")
!981 = !{!982}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !980, file: !2, baseType: !983, size: 192, align: 64, flags: DIFlagPublic)
