; ModuleID = '4ex8nqtqe3rjqsfk'
source_filename = "4ex8nqtqe3rjqsfk"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128"
target triple = "arm64-apple-macosx11.0.0"

%"core::fmt::Error" = type {}
%"core::result::Result<core::convert::Infallible, core::fmt::Error>::Err" = type { %"core::fmt::Error" }
%"core::option::Option<&str>" = type { ptr, [1 x i64] }
%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, %"core::option::Option<&[core::fmt::rt::Placeholder]>" }
%"core::option::Option<&[core::fmt::rt::Placeholder]>" = type { ptr, [1 x i64] }
%"core::result::Result<i32, parser::ParseError>" = type { i8, [7 x i8] }
%"core::result::Result<i32, core::num::error::ParseIntError>" = type { i8, [7 x i8] }
%"core::result::Result<i64, parser::ParseError>" = type { i8, [15 x i8] }
%"core::result::Result<isize, parser::ParseError>" = type { i8, [15 x i8] }
%"core::result::Result<i128, parser::ParseError>" = type { i8, [31 x i8] }
%"core::result::Result<i8, parser::ParseError>" = type { i8, [1 x i8] }
%"core::result::Result<i8, core::num::error::ParseIntError>" = type { i8, [1 x i8] }
%"core::result::Result<usize, parser::ParseError>" = type { i8, [15 x i8] }
%"core::result::Result<i16, parser::ParseError>" = type { i8, [3 x i8] }
%"core::result::Result<i16, core::num::error::ParseIntError>" = type { i8, [3 x i8] }
%"core::result::Result<u16, parser::ParseError>" = type { i8, [3 x i8] }
%"core::result::Result<u16, core::num::error::ParseIntError>" = type { i8, [3 x i8] }

!0 = !{i32 8, !"PIC Level", i32 2}
!1 = !{i32 2, !"Dwarf Version", i32 4}
!2 = !{i32 2, !"Debug Info Version", i32 3}
!3 = !{!"rustc version 1.78.0-nightly (46b180ec2 2024-03-08)"}
!4 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !5, producer: "clang LLVM (rustc version 1.78.0-nightly (46b180ec2 2024-03-08))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !6, splitDebugInlining: false, nameTableKind: None)
!5 = !DIFile(filename: "src/lib.rs/@/4ex8nqtqe3rjqsfk", directory: "/private/var/folders/m6/nyw0tbd5239gngtm06pzykr00000gn/T/.tmpPXbnuW/bitflags")
!6 = !{!7, !18}
!7 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !9, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagEnumClass, elements: !13)
!8 = !DIFile(filename: "<unknown>", directory: "")
!9 = !DINamespace(name: "rt", scope: !10)
!10 = !DINamespace(name: "fmt", scope: !11)
!11 = !DINamespace(name: "core", scope: null)
!12 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!13 = !{!14, !15, !16, !17}
!14 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IntErrorKind", scope: !19, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagEnumClass, elements: !21)
!19 = !DINamespace(name: "error", scope: !20)
!20 = !DINamespace(name: "num", scope: !11)
!21 = !{!22, !23, !24, !25, !26}
!22 = !DIEnumerator(name: "Empty", value: 0, isUnsigned: true)
!23 = !DIEnumerator(name: "InvalidDigit", value: 1, isUnsigned: true)
!24 = !DIEnumerator(name: "PosOverflow", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "NegOverflow", value: 3, isUnsigned: true)
!26 = !DIEnumerator(name: "Zero", value: 4, isUnsigned: true)
!27 = distinct !DISubprogram(name: "from_residual<(), core::fmt::Error, core::fmt::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h5318fc6661fbc6ccE", scope: !29, file: !28, line: 1962, type: !31, scopeLine: 1962, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !89, retainedNodes: !85)
!28 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/result.rs", directory: "", checksumkind: CSK_MD5, checksum: "96c793a7caa821b2d8ecbbb7303607a6")
!29 = !DINamespace(name: "{impl#27}", scope: !30)
!30 = !DINamespace(name: "result", scope: !11)
!31 = !DISubroutineType(types: !32)
!32 = !{!33, !52, !70}
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !30, file: !8, size: 8, align: 8, flags: DIFlagPublic, elements: !34, templateParams: !46, identifier: "be175170a3647a571f2129780e96e9a")
!34 = !{!35}
!35 = !DICompositeType(tag: DW_TAG_variant_part, scope: !33, file: !8, size: 8, align: 8, elements: !36, templateParams: !46, identifier: "d84fc986954f0a57cdd867f92114d31f", discriminator: !51)
!36 = !{!37, !47}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !35, file: !8, baseType: !38, size: 8, align: 8, extraData: i128 0)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !33, file: !8, size: 8, align: 8, flags: DIFlagPublic, elements: !39, templateParams: !42, identifier: "8a3a859dd63bba0c896f6388bd70e8d3")
!39 = !{!40}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !38, file: !8, baseType: !41, align: 8, offset: 8, flags: DIFlagPublic)
!41 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!42 = !{!43, !44}
!43 = !DITemplateTypeParameter(name: "T", type: !41)
!44 = !DITemplateTypeParameter(name: "E", type: !45)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !10, file: !8, align: 8, flags: DIFlagPublic, elements: !46, identifier: "d17669f544649e4d3c30d94bedbae837")
!46 = !{}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !35, file: !8, baseType: !48, size: 8, align: 8, extraData: i128 1)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !33, file: !8, size: 8, align: 8, flags: DIFlagPublic, elements: !49, templateParams: !42, identifier: "80756213d1517f212b3869fb72b85f03")
!49 = !{!50}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !48, file: !8, baseType: !45, align: 8, offset: 8, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, scope: !33, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<core::convert::Infallible, core::fmt::Error>", scope: !30, file: !8, align: 8, flags: DIFlagPublic, elements: !53, templateParams: !46, identifier: "c17e0e09d2d1754a758b15ce148d20d")
!53 = !{!54}
!54 = !DICompositeType(tag: DW_TAG_variant_part, scope: !52, file: !8, align: 8, elements: !55, templateParams: !46, identifier: "20d73312a4973a6312763b27b04569be")
!55 = !{!56, !66}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !54, file: !8, baseType: !57, align: 8)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !52, file: !8, align: 8, flags: DIFlagPublic, elements: !58, templateParams: !64, identifier: "1024142a9ce70058ac901c34e1c345fc")
!58 = !{!59}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !57, file: !8, baseType: !60, align: 8, flags: DIFlagPublic)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "Infallible", scope: !61, file: !8, align: 8, flags: DIFlagPublic, elements: !62, templateParams: !46, identifier: "fa13d0b7c38db284bf843fd30710797a")
!61 = !DINamespace(name: "convert", scope: !11)
!62 = !{!63}
!63 = !DICompositeType(tag: DW_TAG_variant_part, scope: !60, file: !8, align: 8, elements: !46, identifier: "5ade76f3e3c84d3f8835c5b79b9ad8")
!64 = !{!65, !44}
!65 = !DITemplateTypeParameter(name: "T", type: !60)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !54, file: !8, baseType: !67, align: 8)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !52, file: !8, align: 8, flags: DIFlagPublic, elements: !68, templateParams: !64, identifier: "34d66714de63fe8d2414a5f3726fc6b9")
!68 = !{!69}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !67, file: !8, baseType: !45, align: 8, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !71, size: 64, align: 64, dwarfAddressSpace: 0)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !72, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !74, templateParams: !46, identifier: "6ab6d19db24f176957abb2edb6f58a8b")
!72 = !DINamespace(name: "location", scope: !73)
!73 = !DINamespace(name: "panic", scope: !11)
!74 = !{!75, !82, !84}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !71, file: !8, baseType: !76, size: 128, align: 64, flags: DIFlagPrivate)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !8, size: 128, align: 64, elements: !77, templateParams: !46, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!77 = !{!78, !80}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !76, file: !8, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !76, file: !8, baseType: !81, size: 64, align: 64, offset: 64)
!81 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !71, file: !8, baseType: !83, size: 32, align: 32, offset: 128, flags: DIFlagPrivate)
!83 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !71, file: !8, baseType: !83, size: 32, align: 32, offset: 160, flags: DIFlagPrivate)
!85 = !{!86, !87}
!86 = !DILocalVariable(name: "residual", arg: 1, scope: !27, file: !28, line: 1962, type: !52)
!87 = !DILocalVariable(name: "e", scope: !88, file: !28, line: 1964, type: !45, align: 1)
!88 = distinct !DILexicalBlock(scope: !27, file: !28, line: 1964, column: 13)
!89 = !{!43, !44, !90}
!90 = !DITemplateTypeParameter(name: "F", type: !45)
!91 = !DILocation(line: 1962, column: 22, scope: !27)
!92 = !DILocation(line: 1964, column: 17, scope: !88)
!93 = !DILocalVariable(name: "t", arg: 1, scope: !94, file: !95, line: 768, type: !45)
!94 = distinct !DISubprogram(name: "from<core::fmt::Error>", linkageName: "_ZN50_$LT$T$u20$as$u20$core..convert..From$LT$T$GT$$GT$4from17h61266c7f114bcb4dE", scope: !96, file: !95, line: 768, type: !97, scopeLine: 768, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !100, retainedNodes: !99)
!95 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/convert/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "c9b89024c4b3608225f6d01d745ad8ef")
!96 = !DINamespace(name: "{impl#4}", scope: !61)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !45}
!99 = !{!93}
!100 = !{!101}
!101 = !DITemplateTypeParameter(name: "T", type: !45)
!102 = !DILocation(line: 768, column: 13, scope: !94, inlinedAt: !103)
!103 = distinct !DILocation(line: 1964, column: 27, scope: !88)
!104 = !DILocation(line: 1964, column: 23, scope: !88)
!105 = !DILocation(line: 1966, column: 6, scope: !27)
!106 = !{i8 0, i8 2}
!107 = distinct !DISubprogram(name: "is_val_statically_known<bool>", linkageName: "_ZN4core10intrinsics23is_val_statically_known17h32b18e4d2db14527E", scope: !109, file: !108, line: 2627, type: !110, scopeLine: 2627, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !115, retainedNodes: !113)
!108 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "8e44aa294dd7cc4c037d8b6ff42222a3")
!109 = !DINamespace(name: "intrinsics", scope: !11)
!110 = !DISubroutineType(types: !111)
!111 = !{!112, !112}
!112 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!113 = !{!114}
!114 = !DILocalVariable(name: "_arg", arg: 1, scope: !107, file: !108, line: 2627, type: !112)
!115 = !{!116}
!116 = !DITemplateTypeParameter(name: "T", type: !112)
!117 = !DILocation(line: 2627, column: 47, scope: !107)
!118 = !DILocation(line: 2629, column: 2, scope: !107)
!119 = distinct !DISubprogram(name: "as_const_str", linkageName: "_ZN4core3fmt9Arguments12as_const_str17hcd4bfed00e7b100cE", scope: !121, file: !120, line: 445, type: !222, scopeLine: 445, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !46, declaration: !238, retainedNodes: !239)
!120 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "fb126a293888f279de993e69d2771a11")
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !10, file: !8, size: 384, align: 64, flags: DIFlagPublic, elements: !122, templateParams: !46, identifier: "f5a94cea047ca3dea35120609d07d08d")
!122 = !{!123, !129, !174}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !121, file: !8, baseType: !124, size: 128, align: 64, flags: DIFlagPrivate)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !8, size: 128, align: 64, elements: !125, templateParams: !46, identifier: "d76b83877ddcb5cca61caf6bdca727ac")
!125 = !{!126, !128}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !124, file: !8, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64, dwarfAddressSpace: 0)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !124, file: !8, baseType: !81, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !121, file: !8, baseType: !130, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !131, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !132, templateParams: !46, identifier: "676f3d473eca9d85e7b8651af934444b")
!131 = !DINamespace(name: "option", scope: !11)
!132 = !{!133}
!133 = !DICompositeType(tag: DW_TAG_variant_part, scope: !130, file: !8, size: 128, align: 64, elements: !134, templateParams: !46, identifier: "bfd14ac579232dd88fd2b0d1ad576493", discriminator: !173)
!134 = !{!135, !169}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !133, file: !8, baseType: !136, size: 128, align: 64, extraData: i128 0)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !130, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !46, templateParams: !137, identifier: "5cf1cdc1741ffabf116481b417e76678")
!137 = !{!138}
!138 = !DITemplateTypeParameter(name: "T", type: !139)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !8, size: 128, align: 64, elements: !140, templateParams: !46, identifier: "335f0a904b053f61c731d86311ceff8c")
!140 = !{!141, !168}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !139, file: !8, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64, dwarfAddressSpace: 0)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !9, file: !8, size: 448, align: 64, flags: DIFlagPublic, elements: !144, templateParams: !46, identifier: "f4039c5a35e0fee7484a39b4635b170f")
!144 = !{!145, !146, !148, !149, !150, !167}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !143, file: !8, baseType: !81, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !143, file: !8, baseType: !147, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!147 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !143, file: !8, baseType: !7, size: 8, align: 8, offset: 384, flags: DIFlagPublic)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !143, file: !8, baseType: !83, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !143, file: !8, baseType: !151, size: 128, align: 64, flags: DIFlagPublic)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !9, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !152, templateParams: !46, identifier: "2ae93a82e88590f730796e48e70a07a7")
!152 = !{!153}
!153 = !DICompositeType(tag: DW_TAG_variant_part, scope: !151, file: !8, size: 128, align: 64, elements: !154, templateParams: !46, identifier: "c67f77b46946c26a4aac980956de48d6", discriminator: !165)
!154 = !{!155, !159, !163}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !153, file: !8, baseType: !156, size: 128, align: 64, extraData: i128 0)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !151, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !157, templateParams: !46, identifier: "383bd1cd71fc68e2ba1c3f7e48543eff")
!157 = !{!158}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !156, file: !8, baseType: !81, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !153, file: !8, baseType: !160, size: 128, align: 64, extraData: i128 1)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !151, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !161, templateParams: !46, identifier: "ec135ad2d61c9b7e82d9f77c7d2136ad")
!161 = !{!162}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !160, file: !8, baseType: !81, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !153, file: !8, baseType: !164, size: 128, align: 64, extraData: i128 2)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !151, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !46, identifier: "163729ef05b181fe4923856687999017")
!165 = !DIDerivedType(tag: DW_TAG_member, scope: !151, file: !8, baseType: !166, size: 64, align: 64, flags: DIFlagArtificial)
!166 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !143, file: !8, baseType: !151, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !139, file: !8, baseType: !81, size: 64, align: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !133, file: !8, baseType: !170, size: 128, align: 64)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !130, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !171, templateParams: !137, identifier: "e3ff8c9215bd247d238f3585ea2dd2a4")
!171 = !{!172}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !170, file: !8, baseType: !139, size: 128, align: 64, flags: DIFlagPublic)
!173 = !DIDerivedType(tag: DW_TAG_member, scope: !130, file: !8, baseType: !166, size: 64, align: 64, flags: DIFlagArtificial)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !121, file: !8, baseType: !175, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !8, size: 128, align: 64, elements: !176, templateParams: !46, identifier: "f76267ba6692cc2d9e32e5839363f281")
!176 = !{!177, !221}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !175, file: !8, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64, dwarfAddressSpace: 0)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !9, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !180, templateParams: !46, identifier: "6a921f2d5114932f602f7e7bc4389cf9")
!180 = !{!181, !185}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !179, file: !8, baseType: !182, size: 64, align: 64, flags: DIFlagPrivate)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::rt::{extern#0}::Opaque", baseType: !183, size: 64, align: 64, dwarfAddressSpace: 0)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !184, file: !8, align: 8, elements: !46, identifier: "4982ad5e14ab39475d76ca1d05f6c500")
!184 = !DINamespace(name: "{extern#0}", scope: !9)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !179, file: !8, baseType: !186, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::rt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !187, size: 64, align: 64, dwarfAddressSpace: 0)
!187 = !DISubroutineType(types: !188)
!188 = !{!33, !182, !189}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !190, size: 64, align: 64, dwarfAddressSpace: 0)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !10, file: !8, size: 512, align: 64, flags: DIFlagPublic, elements: !191, templateParams: !46, identifier: "220d4d9789115bc6b80d4c98d9cf69c5")
!191 = !{!192, !193, !194, !195, !209, !210}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !190, file: !8, baseType: !83, size: 32, align: 32, offset: 416, flags: DIFlagPrivate)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !190, file: !8, baseType: !147, size: 32, align: 32, offset: 384, flags: DIFlagPrivate)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !190, file: !8, baseType: !7, size: 8, align: 8, offset: 448, flags: DIFlagPrivate)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !190, file: !8, baseType: !196, size: 128, align: 64, flags: DIFlagPrivate)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !131, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !197, templateParams: !46, identifier: "95187db8a945f0b837c05a93dbca053d")
!197 = !{!198}
!198 = !DICompositeType(tag: DW_TAG_variant_part, scope: !196, file: !8, size: 128, align: 64, elements: !199, templateParams: !46, identifier: "bf03ad1423ace5c017f1cefbab0a44f7", discriminator: !208)
!199 = !{!200, !204}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !198, file: !8, baseType: !201, size: 128, align: 64, extraData: i128 0)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !196, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !46, templateParams: !202, identifier: "28c1259e655b5c63dfdc8863b3b586eb")
!202 = !{!203}
!203 = !DITemplateTypeParameter(name: "T", type: !81)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !198, file: !8, baseType: !205, size: 128, align: 64, extraData: i128 1)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !196, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !206, templateParams: !202, identifier: "455fdfcabbfecd5a717255e285761794")
!206 = !{!207}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !205, file: !8, baseType: !81, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!208 = !DIDerivedType(tag: DW_TAG_member, scope: !196, file: !8, baseType: !166, size: 64, align: 64, flags: DIFlagArtificial)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !190, file: !8, baseType: !196, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !190, file: !8, baseType: !211, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !8, size: 128, align: 64, elements: !212, templateParams: !46, identifier: "94f817b1adbb3ab96b0635104fb3fde3")
!212 = !{!213, !216}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !211, file: !8, baseType: !214, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64, dwarfAddressSpace: 0)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !8, align: 8, elements: !46, identifier: "72805e6673b6ad52ecf81cbad56f4147")
!216 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !211, file: !8, baseType: !217, size: 64, align: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !218, size: 64, align: 64, dwarfAddressSpace: 0)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 192, align: 64, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 3, lowerBound: 0)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !175, file: !8, baseType: !81, size: 64, align: 64, offset: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!224, !237}
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&str>", scope: !131, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !225, templateParams: !46, identifier: "936c8253b26fdbdbd371f86b598077f")
!225 = !{!226}
!226 = !DICompositeType(tag: DW_TAG_variant_part, scope: !224, file: !8, size: 128, align: 64, elements: !227, templateParams: !46, identifier: "c37659452c396c05c51c0ec9efbf4d2d", discriminator: !236)
!227 = !{!228, !232}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !226, file: !8, baseType: !229, size: 128, align: 64, extraData: i128 0)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !224, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !46, templateParams: !230, identifier: "c15c9e029a63bfba76e8c756530457d")
!230 = !{!231}
!231 = !DITemplateTypeParameter(name: "T", type: !76)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !226, file: !8, baseType: !233, size: 128, align: 64)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !224, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !234, templateParams: !230, identifier: "d06e72ee534abde8342f269c82f1f638")
!234 = !{!235}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !233, file: !8, baseType: !76, size: 128, align: 64, flags: DIFlagPublic)
!236 = !DIDerivedType(tag: DW_TAG_member, scope: !224, file: !8, baseType: !166, size: 64, align: 64, flags: DIFlagArtificial)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::Arguments", baseType: !121, size: 64, align: 64, dwarfAddressSpace: 0)
!238 = !DISubprogram(name: "as_const_str", linkageName: "_ZN4core3fmt9Arguments12as_const_str17hcd4bfed00e7b100cE", scope: !121, file: !120, line: 445, type: !222, scopeLine: 445, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !46)
!239 = !{!240, !241}
!240 = !DILocalVariable(name: "self", arg: 1, scope: !119, file: !120, line: 445, type: !237)
!241 = !DILocalVariable(name: "s", scope: !242, file: !120, line: 446, type: !224, align: 8)
!242 = distinct !DILexicalBlock(scope: !119, file: !120, line: 446, column: 9)
!243 = !DILocation(line: 445, column: 21, scope: !119)
!244 = !DILocalVariable(name: "self", arg: 1, scope: !245, file: !120, line: 434, type: !237)
!245 = distinct !DILexicalBlock(scope: !246, file: !120, line: 434, column: 5)
!246 = distinct !DISubprogram(name: "as_str", linkageName: "_ZN4core3fmt9Arguments6as_str17hc9fce7e347cb59abE", scope: !121, file: !120, line: 434, type: !222, scopeLine: 434, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !46, declaration: !247, retainedNodes: !248)
!247 = !DISubprogram(name: "as_str", linkageName: "_ZN4core3fmt9Arguments6as_str17hc9fce7e347cb59abE", scope: !121, file: !120, line: 434, type: !222, scopeLine: 434, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !46)
!248 = !{!244, !249}
!249 = !DILocalVariable(name: "s", scope: !250, file: !120, line: 437, type: !251, align: 8)
!250 = distinct !DILexicalBlock(scope: !245, file: !120, line: 437, column: 13)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&str", baseType: !76, size: 64, align: 64, dwarfAddressSpace: 0)
!252 = !DILocation(line: 434, column: 25, scope: !245, inlinedAt: !253)
!253 = !DILocation(line: 446, column: 22, scope: !119)
!254 = !DILocation(line: 446, column: 13, scope: !242)
!255 = !DILocation(line: 435, column: 16, scope: !245, inlinedAt: !253)
!256 = !{i64 8}
!257 = !DILocation(line: 435, column: 29, scope: !245, inlinedAt: !253)
!258 = !DILocation(line: 436, column: 14, scope: !245, inlinedAt: !253)
!259 = !DILocation(line: 436, column: 18, scope: !245, inlinedAt: !253)
!260 = !DILocation(line: 437, column: 14, scope: !245, inlinedAt: !253)
!261 = !DILocation(line: 436, column: 25, scope: !245, inlinedAt: !253)
!262 = !DILocation(line: 436, column: 32, scope: !245, inlinedAt: !253)
!263 = !DILocation(line: 438, column: 18, scope: !245, inlinedAt: !253)
!264 = !{i64 1}
!265 = !DILocation(line: 447, column: 54, scope: !242)
!266 = !DILocalVariable(name: "self", arg: 1, scope: !267, file: !268, line: 607, type: !272)
!267 = distinct !DILexicalBlock(scope: !269, file: !268, line: 607, column: 5)
!268 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/option.rs", directory: "", checksumkind: CSK_MD5, checksum: "290dd9078744531e3e1c26de62cd5c06")
!269 = distinct !DISubprogram(name: "is_some<&str>", linkageName: "_ZN4core6option15Option$LT$T$GT$7is_some17h24a9a7c586eeb9f9E", scope: !224, file: !268, line: 607, type: !270, scopeLine: 607, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !230, declaration: !273, retainedNodes: !274)
!270 = !DISubroutineType(types: !271)
!271 = !{!112, !272}
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::option::Option<&str>", baseType: !224, size: 64, align: 64, dwarfAddressSpace: 0)
!273 = !DISubprogram(name: "is_some<&str>", linkageName: "_ZN4core6option15Option$LT$T$GT$7is_some17h24a9a7c586eeb9f9E", scope: !224, file: !268, line: 607, type: !270, scopeLine: 607, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !230)
!274 = !{!266}
!275 = !DILocation(line: 607, column: 26, scope: !267, inlinedAt: !276)
!276 = !DILocation(line: 447, column: 56, scope: !242)
!277 = !DILocation(line: 608, column: 18, scope: !267, inlinedAt: !276)
!278 = !DILocation(line: 608, column: 9, scope: !267, inlinedAt: !276)
!279 = !DILocation(line: 437, column: 19, scope: !245, inlinedAt: !253)
!280 = !DILocation(line: 437, column: 15, scope: !245, inlinedAt: !253)
!281 = !DILocation(line: 437, column: 15, scope: !250, inlinedAt: !253)
!282 = !DILocation(line: 437, column: 31, scope: !250, inlinedAt: !253)
!283 = !DILocation(line: 437, column: 26, scope: !250, inlinedAt: !253)
!284 = !DILocation(line: 437, column: 32, scope: !245, inlinedAt: !253)
!285 = !DILocation(line: 447, column: 12, scope: !242)
!286 = !DILocation(line: 447, column: 80, scope: !242)
!287 = !DILocation(line: 447, column: 9, scope: !242)
!288 = !DILocation(line: 447, column: 69, scope: !242)
!289 = !DILocation(line: 448, column: 6, scope: !119)
!290 = !DILocation(line: 607, column: 5, scope: !267, inlinedAt: !276)
!291 = distinct !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17he2d8b483f311bb95E", scope: !121, file: !120, line: 329, type: !292, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !46, declaration: !294, retainedNodes: !295)
!292 = !DISubroutineType(types: !293)
!293 = !{!121, !124}
!294 = !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17he2d8b483f311bb95E", scope: !121, file: !120, line: 329, type: !292, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !46)
!295 = !{!296}
!296 = !DILocalVariable(name: "pieces", arg: 1, scope: !291, file: !120, line: 329, type: !124)
!297 = !DILocation(line: 329, column: 28, scope: !291)
!298 = !DILocation(line: 330, column: 12, scope: !291)
!299 = !DILocation(line: 333, column: 9, scope: !291)
!300 = !DILocation(line: 334, column: 6, scope: !291)
!301 = !DILocation(line: 331, column: 13, scope: !291)
!302 = distinct !DISubprogram(name: "write_fmt", linkageName: "_ZN4core3fmt9Formatter9write_fmt17h73d062f48a8ae2dbE", scope: !190, file: !120, line: 1619, type: !303, scopeLine: 1619, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !46, declaration: !305, retainedNodes: !306)
!303 = !DISubroutineType(types: !304)
!304 = !{!33, !189, !121}
!305 = !DISubprogram(name: "write_fmt", linkageName: "_ZN4core3fmt9Formatter9write_fmt17h73d062f48a8ae2dbE", scope: !190, file: !120, line: 1619, type: !303, scopeLine: 1619, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !46)
!306 = !{!307, !308, !309}
!307 = !DILocalVariable(name: "self", arg: 1, scope: !302, file: !120, line: 1619, type: !189)
!308 = !DILocalVariable(name: "fmt", arg: 2, scope: !302, file: !120, line: 1619, type: !121)
!309 = !DILocalVariable(name: "s", scope: !310, file: !120, line: 1620, type: !76, align: 8)
!310 = distinct !DILexicalBlock(scope: !302, file: !120, line: 1620, column: 45)
!311 = !DILocation(line: 1619, column: 22, scope: !302)
!312 = !DILocation(line: 1619, column: 33, scope: !302)
!313 = !DILocation(line: 1620, column: 26, scope: !310)
!314 = !DILocation(line: 1620, column: 16, scope: !310)
!315 = !DILocation(line: 1620, column: 21, scope: !310)
!316 = !DILocation(line: 1620, column: 47, scope: !310)
!317 = !DILocation(line: 1620, column: 84, scope: !302)
!318 = !DILocation(line: 1620, column: 94, scope: !302)
!319 = !DILocation(line: 1620, column: 78, scope: !302)
!320 = !DILocation(line: 1620, column: 9, scope: !302)
!321 = !DILocation(line: 1621, column: 6, scope: !302)
!322 = !DILocation(line: 1619, column: 5, scope: !302)
!323 = distinct !DISubprogram(name: "map_err<i32, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#23}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h00c309b9aa6f19faE", scope: !324, file: !28, line: 826, type: !344, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !388, declaration: !387, retainedNodes: !391)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i32, core::num::error::ParseIntError>", scope: !30, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !325, templateParams: !46, identifier: "8cc6b191a0b2ef3d1298373a7d3dae9b")
!325 = !{!326}
!326 = !DICompositeType(tag: DW_TAG_variant_part, scope: !324, file: !8, size: 64, align: 32, elements: !327, templateParams: !46, identifier: "41b71364bb3fb1e3ecaa46c014094e7e", discriminator: !343)
!327 = !{!328, !339}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !326, file: !8, baseType: !329, size: 64, align: 32, extraData: i128 0)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !324, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !330, templateParams: !333, identifier: "a45edd83e8a29c6b3807620d0609ad9d")
!330 = !{!331}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !329, file: !8, baseType: !332, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!332 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!333 = !{!334, !335}
!334 = !DITemplateTypeParameter(name: "T", type: !332)
!335 = !DITemplateTypeParameter(name: "E", type: !336)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParseIntError", scope: !19, file: !8, size: 8, align: 8, flags: DIFlagPublic, elements: !337, templateParams: !46, identifier: "b4ca89494534caefc040579907052c6f")
!337 = !{!338}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !336, file: !8, baseType: !18, size: 8, align: 8, flags: DIFlagProtected)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !326, file: !8, baseType: !340, size: 64, align: 32, extraData: i128 1)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !324, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !341, templateParams: !333, identifier: "b6eb2dba2e13f1dab40d1c909a525154")
!341 = !{!342}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !340, file: !8, baseType: !336, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!343 = !DIDerivedType(tag: DW_TAG_member, scope: !324, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!344 = !DISubroutineType(types: !345)
!345 = !{!346, !324, !381}
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i32, bitflags::parser::ParseError>", scope: !30, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !347, templateParams: !46, identifier: "7916d31b5d48407b1184c5022761093")
!347 = !{!348}
!348 = !DICompositeType(tag: DW_TAG_variant_part, scope: !346, file: !8, size: 64, align: 32, elements: !349, templateParams: !46, identifier: "e23a05dc9f735ce52c823bc781e25d75", discriminator: !380)
!349 = !{!350, !376}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !348, file: !8, baseType: !351, size: 64, align: 32, extraData: i128 0)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !346, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !352, templateParams: !354, identifier: "56ba354d08f36bfbefb6719f28b08cf")
!352 = !{!353}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !351, file: !8, baseType: !332, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!354 = !{!334, !355}
!355 = !DITemplateTypeParameter(name: "E", type: !356)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParseError", scope: !357, file: !8, size: 8, align: 8, flags: DIFlagPublic, elements: !359, templateParams: !46, identifier: "3ab6b459b9d01a1dbccda801d44c362b")
!357 = !DINamespace(name: "parser", scope: !358)
!358 = !DINamespace(name: "bitflags", scope: null)
!359 = !{!360}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !356, file: !8, baseType: !361, size: 8, align: 8, flags: DIFlagPrivate)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParseErrorKind", scope: !357, file: !8, size: 8, align: 8, flags: DIFlagPrivate, elements: !362, templateParams: !46, identifier: "9d8d1244f98e43322b86b37dd471a59b")
!362 = !{!363}
!363 = !DICompositeType(tag: DW_TAG_variant_part, scope: !361, file: !8, size: 8, align: 8, elements: !364, templateParams: !46, identifier: "98ad0a2fd49c03c03db050dcaa355f94", discriminator: !375)
!364 = !{!365, !367, !371}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "EmptyFlag", scope: !363, file: !8, baseType: !366, size: 8, align: 8, extraData: i128 0)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "EmptyFlag", scope: !361, file: !8, size: 8, align: 8, flags: DIFlagPrivate, elements: !46, identifier: "4e736271469793fdf7ce678c6c7b6213")
!367 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidNamedFlag", scope: !363, file: !8, baseType: !368, size: 8, align: 8, extraData: i128 1)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidNamedFlag", scope: !361, file: !8, size: 8, align: 8, flags: DIFlagPrivate, elements: !369, templateParams: !46, identifier: "ee35e4d05f4c589334870bdba96dd8e5")
!369 = !{!370}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "got", scope: !368, file: !8, baseType: !41, align: 8, offset: 8, flags: DIFlagPrivate)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidHexFlag", scope: !363, file: !8, baseType: !372, size: 8, align: 8, extraData: i128 2)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidHexFlag", scope: !361, file: !8, size: 8, align: 8, flags: DIFlagPrivate, elements: !373, templateParams: !46, identifier: "831e8baa46869a795b2f0729980fb0a")
!373 = !{!374}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "got", scope: !372, file: !8, baseType: !41, align: 8, offset: 8, flags: DIFlagPrivate)
!375 = !DIDerivedType(tag: DW_TAG_member, scope: !361, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !348, file: !8, baseType: !377, size: 64, align: 32, extraData: i128 1)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !346, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !378, templateParams: !354, identifier: "a3d5909353f9854d7435b0217f7e8552")
!378 = !{!379}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !377, file: !8, baseType: !356, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!380 = !DIDerivedType(tag: DW_TAG_member, scope: !346, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !382, file: !8, size: 64, align: 64, elements: !385, templateParams: !46, identifier: "f5d767caefb270d3b3e6e1f57b3cbb60")
!382 = !DINamespace(name: "parse_hex", scope: !383)
!383 = !DINamespace(name: "{impl#23}", scope: !384)
!384 = !DINamespace(name: "traits", scope: !358)
!385 = !{!386}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !381, file: !8, baseType: !251, size: 64, align: 64)
!387 = !DISubprogram(name: "map_err<i32, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#23}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h00c309b9aa6f19faE", scope: !324, file: !28, line: 826, type: !344, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !388)
!388 = !{!334, !335, !389, !390}
!389 = !DITemplateTypeParameter(name: "F", type: !356)
!390 = !DITemplateTypeParameter(name: "O", type: !381)
!391 = !{!392, !393, !394, !396}
!392 = !DILocalVariable(name: "self", arg: 1, scope: !323, file: !28, line: 826, type: !324)
!393 = !DILocalVariable(name: "op", arg: 2, scope: !323, file: !28, line: 826, type: !381)
!394 = !DILocalVariable(name: "t", scope: !395, file: !28, line: 828, type: !332, align: 4)
!395 = distinct !DILexicalBlock(scope: !323, file: !28, line: 828, column: 13)
!396 = !DILocalVariable(name: "e", scope: !397, file: !28, line: 829, type: !336, align: 1)
!397 = distinct !DILexicalBlock(scope: !323, file: !28, line: 829, column: 13)
!398 = !DILocation(line: 826, column: 42, scope: !323)
!399 = !DILocation(line: 826, column: 48, scope: !323)
!400 = !DILocation(line: 827, column: 15, scope: !323)
!401 = !DILocation(line: 827, column: 9, scope: !323)
!402 = !DILocation(line: 828, column: 16, scope: !323)
!403 = !DILocation(line: 828, column: 16, scope: !395)
!404 = !DILocation(line: 828, column: 22, scope: !395)
!405 = !DILocation(line: 831, column: 5, scope: !323)
!406 = !DILocation(line: 829, column: 17, scope: !323)
!407 = !{i8 0, i8 5}
!408 = !DILocation(line: 829, column: 17, scope: !397)
!409 = !DILocation(line: 829, column: 27, scope: !397)
!410 = !{i8 0, i8 3}
!411 = !DILocation(line: 829, column: 23, scope: !397)
!412 = !DILocation(line: 829, column: 32, scope: !323)
!413 = !DILocation(line: 831, column: 6, scope: !323)
!414 = distinct !DISubprogram(name: "map_err<i64, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#31}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h027f0baeb10754f0E", scope: !415, file: !28, line: 826, type: !431, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !453, declaration: !452, retainedNodes: !455)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i64, core::num::error::ParseIntError>", scope: !30, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !416, templateParams: !46, identifier: "48410de1e1ce27daae6cbb41a17e575a")
!416 = !{!417}
!417 = !DICompositeType(tag: DW_TAG_variant_part, scope: !415, file: !8, size: 128, align: 64, elements: !418, templateParams: !46, identifier: "f9fc9749da26495e3e248fbed71093bf", discriminator: !430)
!418 = !{!419, !426}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !417, file: !8, baseType: !420, size: 128, align: 64, extraData: i128 0)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !415, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !421, templateParams: !424, identifier: "407913d12637f84c18adc8036aaf2f0")
!421 = !{!422}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !420, file: !8, baseType: !423, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!423 = !DIBasicType(name: "i64", size: 64, encoding: DW_ATE_signed)
!424 = !{!425, !335}
!425 = !DITemplateTypeParameter(name: "T", type: !423)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !417, file: !8, baseType: !427, size: 128, align: 64, extraData: i128 1)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !415, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !428, templateParams: !424, identifier: "b9ec0c9da4567fac15eb80533aa279ba")
!428 = !{!429}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !427, file: !8, baseType: !336, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!430 = !DIDerivedType(tag: DW_TAG_member, scope: !415, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!431 = !DISubroutineType(types: !432)
!432 = !{!433, !415, !447}
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i64, bitflags::parser::ParseError>", scope: !30, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !434, templateParams: !46, identifier: "8f5425195db923c3c9d1b77865d43a11")
!434 = !{!435}
!435 = !DICompositeType(tag: DW_TAG_variant_part, scope: !433, file: !8, size: 128, align: 64, elements: !436, templateParams: !46, identifier: "e9ff9e55f51896d856426969881a56ea", discriminator: !446)
!436 = !{!437, !442}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !435, file: !8, baseType: !438, size: 128, align: 64, extraData: i128 0)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !433, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !439, templateParams: !441, identifier: "6036cecc8b6e9995434b33da8de642c6")
!439 = !{!440}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !438, file: !8, baseType: !423, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!441 = !{!425, !355}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !435, file: !8, baseType: !443, size: 128, align: 64, extraData: i128 1)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !433, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !444, templateParams: !441, identifier: "5140e55857f2329f86bb81af21534e5b")
!444 = !{!445}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !443, file: !8, baseType: !356, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!446 = !DIDerivedType(tag: DW_TAG_member, scope: !433, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !448, file: !8, size: 64, align: 64, elements: !450, templateParams: !46, identifier: "6e8d98ddb0f10d159a25992f197cf055")
!448 = !DINamespace(name: "parse_hex", scope: !449)
!449 = !DINamespace(name: "{impl#31}", scope: !384)
!450 = !{!451}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !447, file: !8, baseType: !251, size: 64, align: 64)
!452 = !DISubprogram(name: "map_err<i64, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#31}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h027f0baeb10754f0E", scope: !415, file: !28, line: 826, type: !431, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !453)
!453 = !{!425, !335, !389, !454}
!454 = !DITemplateTypeParameter(name: "O", type: !447)
!455 = !{!456, !457, !458, !460}
!456 = !DILocalVariable(name: "self", arg: 1, scope: !414, file: !28, line: 826, type: !415)
!457 = !DILocalVariable(name: "op", arg: 2, scope: !414, file: !28, line: 826, type: !447)
!458 = !DILocalVariable(name: "t", scope: !459, file: !28, line: 828, type: !423, align: 8)
!459 = distinct !DILexicalBlock(scope: !414, file: !28, line: 828, column: 13)
!460 = !DILocalVariable(name: "e", scope: !461, file: !28, line: 829, type: !336, align: 1)
!461 = distinct !DILexicalBlock(scope: !414, file: !28, line: 829, column: 13)
!462 = !DILocation(line: 826, column: 42, scope: !414)
!463 = !DILocation(line: 826, column: 48, scope: !414)
!464 = !DILocation(line: 827, column: 15, scope: !414)
!465 = !DILocation(line: 827, column: 9, scope: !414)
!466 = !DILocation(line: 828, column: 16, scope: !414)
!467 = !DILocation(line: 828, column: 16, scope: !459)
!468 = !DILocation(line: 828, column: 22, scope: !459)
!469 = !DILocation(line: 831, column: 5, scope: !414)
!470 = !DILocation(line: 829, column: 17, scope: !414)
!471 = !DILocation(line: 829, column: 17, scope: !461)
!472 = !DILocation(line: 829, column: 27, scope: !461)
!473 = !DILocation(line: 829, column: 23, scope: !461)
!474 = !DILocation(line: 829, column: 32, scope: !414)
!475 = !DILocation(line: 831, column: 6, scope: !414)
!476 = distinct !DISubprogram(name: "map_err<isize, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#47}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h050317db9bc4e136E", scope: !477, file: !28, line: 826, type: !493, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !515, declaration: !514, retainedNodes: !517)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<isize, core::num::error::ParseIntError>", scope: !30, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !478, templateParams: !46, identifier: "4be95f1f59ad5d51f807815c2e58f95b")
!478 = !{!479}
!479 = !DICompositeType(tag: DW_TAG_variant_part, scope: !477, file: !8, size: 128, align: 64, elements: !480, templateParams: !46, identifier: "c8f04411eb4290dbb75a8378d9550e2c", discriminator: !492)
!480 = !{!481, !488}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !479, file: !8, baseType: !482, size: 128, align: 64, extraData: i128 0)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !477, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !483, templateParams: !486, identifier: "2faa428b9d6bcc99937ab336e70c22c7")
!483 = !{!484}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !482, file: !8, baseType: !485, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!485 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!486 = !{!487, !335}
!487 = !DITemplateTypeParameter(name: "T", type: !485)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !479, file: !8, baseType: !489, size: 128, align: 64, extraData: i128 1)
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !477, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !490, templateParams: !486, identifier: "baec1fda432bb1e034f80e98f01a06b9")
!490 = !{!491}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !489, file: !8, baseType: !336, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!492 = !DIDerivedType(tag: DW_TAG_member, scope: !477, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!493 = !DISubroutineType(types: !494)
!494 = !{!495, !477, !509}
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<isize, bitflags::parser::ParseError>", scope: !30, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !496, templateParams: !46, identifier: "dcdd1a6dd66990d55584da2396f73269")
!496 = !{!497}
!497 = !DICompositeType(tag: DW_TAG_variant_part, scope: !495, file: !8, size: 128, align: 64, elements: !498, templateParams: !46, identifier: "386144c35ea608c1f58d90a157fb9a67", discriminator: !508)
!498 = !{!499, !504}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !497, file: !8, baseType: !500, size: 128, align: 64, extraData: i128 0)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !495, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !501, templateParams: !503, identifier: "479e42433bffb1e8475e6336b64e702b")
!501 = !{!502}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !500, file: !8, baseType: !485, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!503 = !{!487, !355}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !497, file: !8, baseType: !505, size: 128, align: 64, extraData: i128 1)
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !495, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !506, templateParams: !503, identifier: "bc944aa84491282fef3b760e0979f436")
!506 = !{!507}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !505, file: !8, baseType: !356, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!508 = !DIDerivedType(tag: DW_TAG_member, scope: !495, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !510, file: !8, size: 64, align: 64, elements: !512, templateParams: !46, identifier: "214de23ac3e7eb0dae3d4429ae6ced55")
!510 = !DINamespace(name: "parse_hex", scope: !511)
!511 = !DINamespace(name: "{impl#47}", scope: !384)
!512 = !{!513}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !509, file: !8, baseType: !251, size: 64, align: 64)
!514 = !DISubprogram(name: "map_err<isize, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#47}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h050317db9bc4e136E", scope: !477, file: !28, line: 826, type: !493, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !515)
!515 = !{!487, !335, !389, !516}
!516 = !DITemplateTypeParameter(name: "O", type: !509)
!517 = !{!518, !519, !520, !522}
!518 = !DILocalVariable(name: "self", arg: 1, scope: !476, file: !28, line: 826, type: !477)
!519 = !DILocalVariable(name: "op", arg: 2, scope: !476, file: !28, line: 826, type: !509)
!520 = !DILocalVariable(name: "t", scope: !521, file: !28, line: 828, type: !485, align: 8)
!521 = distinct !DILexicalBlock(scope: !476, file: !28, line: 828, column: 13)
!522 = !DILocalVariable(name: "e", scope: !523, file: !28, line: 829, type: !336, align: 1)
!523 = distinct !DILexicalBlock(scope: !476, file: !28, line: 829, column: 13)
!524 = !DILocation(line: 826, column: 42, scope: !476)
!525 = !DILocation(line: 826, column: 48, scope: !476)
!526 = !DILocation(line: 827, column: 15, scope: !476)
!527 = !DILocation(line: 827, column: 9, scope: !476)
!528 = !DILocation(line: 828, column: 16, scope: !476)
!529 = !DILocation(line: 828, column: 16, scope: !521)
!530 = !DILocation(line: 828, column: 22, scope: !521)
!531 = !DILocation(line: 831, column: 5, scope: !476)
!532 = !DILocation(line: 829, column: 17, scope: !476)
!533 = !DILocation(line: 829, column: 17, scope: !523)
!534 = !DILocation(line: 829, column: 27, scope: !523)
!535 = !DILocation(line: 829, column: 23, scope: !523)
!536 = !DILocation(line: 829, column: 32, scope: !476)
!537 = !DILocation(line: 831, column: 6, scope: !476)
!538 = distinct !DISubprogram(name: "map_err<i128, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#39}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h05ccf80fa9512becE", scope: !539, file: !28, line: 826, type: !555, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !577, declaration: !576, retainedNodes: !579)
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i128, core::num::error::ParseIntError>", scope: !30, file: !8, size: 256, align: 128, flags: DIFlagPublic, elements: !540, templateParams: !46, identifier: "15fd36e3d3254c4fd97de4b74123ab38")
!540 = !{!541}
!541 = !DICompositeType(tag: DW_TAG_variant_part, scope: !539, file: !8, size: 256, align: 128, elements: !542, templateParams: !46, identifier: "a560905d99ab20affdc30ad80c9cae6e", discriminator: !554)
!542 = !{!543, !550}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !541, file: !8, baseType: !544, size: 256, align: 128, extraData: i128 0)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !539, file: !8, size: 256, align: 128, flags: DIFlagPublic, elements: !545, templateParams: !548, identifier: "1780d37c5b6f5d11fbf35a25f3028340")
!545 = !{!546}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !544, file: !8, baseType: !547, size: 128, align: 128, offset: 128, flags: DIFlagPublic)
!547 = !DIBasicType(name: "i128", size: 128, encoding: DW_ATE_signed)
!548 = !{!549, !335}
!549 = !DITemplateTypeParameter(name: "T", type: !547)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !541, file: !8, baseType: !551, size: 256, align: 128, extraData: i128 1)
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !539, file: !8, size: 256, align: 128, flags: DIFlagPublic, elements: !552, templateParams: !548, identifier: "9abfdc803b34cce631d77d4e24d4ebb8")
!552 = !{!553}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !551, file: !8, baseType: !336, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!554 = !DIDerivedType(tag: DW_TAG_member, scope: !539, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!555 = !DISubroutineType(types: !556)
!556 = !{!557, !539, !571}
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i128, bitflags::parser::ParseError>", scope: !30, file: !8, size: 256, align: 128, flags: DIFlagPublic, elements: !558, templateParams: !46, identifier: "d082c7c4bdb8ede1d7a81020c226dbfb")
!558 = !{!559}
!559 = !DICompositeType(tag: DW_TAG_variant_part, scope: !557, file: !8, size: 256, align: 128, elements: !560, templateParams: !46, identifier: "acf5cd430bbc839ee25374ec406a9c37", discriminator: !570)
!560 = !{!561, !566}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !559, file: !8, baseType: !562, size: 256, align: 128, extraData: i128 0)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !557, file: !8, size: 256, align: 128, flags: DIFlagPublic, elements: !563, templateParams: !565, identifier: "f64a87fe3b5de765fc13d46d84c0d9bc")
!563 = !{!564}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !562, file: !8, baseType: !547, size: 128, align: 128, offset: 128, flags: DIFlagPublic)
!565 = !{!549, !355}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !559, file: !8, baseType: !567, size: 256, align: 128, extraData: i128 1)
!567 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !557, file: !8, size: 256, align: 128, flags: DIFlagPublic, elements: !568, templateParams: !565, identifier: "49e9552a6eaf8b81fb3d948d522c7781")
!568 = !{!569}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !567, file: !8, baseType: !356, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!570 = !DIDerivedType(tag: DW_TAG_member, scope: !557, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !572, file: !8, size: 64, align: 64, elements: !574, templateParams: !46, identifier: "4e38bd849a2e20ee7d1090a87e5abbe1")
!572 = !DINamespace(name: "parse_hex", scope: !573)
!573 = !DINamespace(name: "{impl#39}", scope: !384)
!574 = !{!575}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !571, file: !8, baseType: !251, size: 64, align: 64)
!576 = !DISubprogram(name: "map_err<i128, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#39}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h05ccf80fa9512becE", scope: !539, file: !28, line: 826, type: !555, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !577)
!577 = !{!549, !335, !389, !578}
!578 = !DITemplateTypeParameter(name: "O", type: !571)
!579 = !{!580, !581, !582, !584}
!580 = !DILocalVariable(name: "self", arg: 1, scope: !538, file: !28, line: 826, type: !539)
!581 = !DILocalVariable(name: "op", arg: 2, scope: !538, file: !28, line: 826, type: !571)
!582 = !DILocalVariable(name: "t", scope: !583, file: !28, line: 828, type: !547, align: 16)
!583 = distinct !DILexicalBlock(scope: !538, file: !28, line: 828, column: 13)
!584 = !DILocalVariable(name: "e", scope: !585, file: !28, line: 829, type: !336, align: 1)
!585 = distinct !DILexicalBlock(scope: !538, file: !28, line: 829, column: 13)
!586 = !DILocation(line: 826, column: 42, scope: !538)
!587 = !DILocation(line: 826, column: 48, scope: !538)
!588 = !DILocation(line: 827, column: 15, scope: !538)
!589 = !DILocation(line: 827, column: 9, scope: !538)
!590 = !DILocation(line: 828, column: 16, scope: !538)
!591 = !DILocation(line: 828, column: 16, scope: !583)
!592 = !DILocation(line: 828, column: 22, scope: !583)
!593 = !DILocation(line: 831, column: 5, scope: !538)
!594 = !DILocation(line: 829, column: 17, scope: !538)
!595 = !DILocation(line: 829, column: 17, scope: !585)
!596 = !DILocation(line: 829, column: 27, scope: !585)
!597 = !DILocation(line: 829, column: 23, scope: !585)
!598 = !DILocation(line: 829, column: 32, scope: !538)
!599 = !DILocation(line: 831, column: 6, scope: !538)
!600 = distinct !DISubprogram(name: "map_err<i8, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#7}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h19899cd4d8439a7bE", scope: !601, file: !28, line: 826, type: !617, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !639, declaration: !638, retainedNodes: !641)
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i8, core::num::error::ParseIntError>", scope: !30, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !602, templateParams: !46, identifier: "7ca7841986406db09efe71b9a6cbc147")
!602 = !{!603}
!603 = !DICompositeType(tag: DW_TAG_variant_part, scope: !601, file: !8, size: 16, align: 8, elements: !604, templateParams: !46, identifier: "fd5b1ccbfcd687bd7e3c429f5d0f0082", discriminator: !616)
!604 = !{!605, !612}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !603, file: !8, baseType: !606, size: 16, align: 8, extraData: i128 0)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !601, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !607, templateParams: !610, identifier: "f130426f34f606901044a76deeb264ae")
!607 = !{!608}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !606, file: !8, baseType: !609, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!609 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!610 = !{!611, !335}
!611 = !DITemplateTypeParameter(name: "T", type: !609)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !603, file: !8, baseType: !613, size: 16, align: 8, extraData: i128 1)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !601, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !614, templateParams: !610, identifier: "ecad493fe045bc01596d97a52930986b")
!614 = !{!615}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !613, file: !8, baseType: !336, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!616 = !DIDerivedType(tag: DW_TAG_member, scope: !601, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!617 = !DISubroutineType(types: !618)
!618 = !{!619, !601, !633}
!619 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i8, bitflags::parser::ParseError>", scope: !30, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !620, templateParams: !46, identifier: "a010bb19843bcb751ea7414a6a667ed")
!620 = !{!621}
!621 = !DICompositeType(tag: DW_TAG_variant_part, scope: !619, file: !8, size: 16, align: 8, elements: !622, templateParams: !46, identifier: "ca7dc58dfd0617e5aebe9b3806a27b0e", discriminator: !632)
!622 = !{!623, !628}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !621, file: !8, baseType: !624, size: 16, align: 8, extraData: i128 0)
!624 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !619, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !625, templateParams: !627, identifier: "945284ec1985a4a61c800d1f3246a574")
!625 = !{!626}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !624, file: !8, baseType: !609, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!627 = !{!611, !355}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !621, file: !8, baseType: !629, size: 16, align: 8, extraData: i128 1)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !619, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !630, templateParams: !627, identifier: "73002dd20255067e44ddb0e3de8db886")
!630 = !{!631}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !629, file: !8, baseType: !356, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!632 = !DIDerivedType(tag: DW_TAG_member, scope: !619, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!633 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !634, file: !8, size: 64, align: 64, elements: !636, templateParams: !46, identifier: "7ca802d6ed891cdd19177b5cf7b3dabd")
!634 = !DINamespace(name: "parse_hex", scope: !635)
!635 = !DINamespace(name: "{impl#7}", scope: !384)
!636 = !{!637}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !633, file: !8, baseType: !251, size: 64, align: 64)
!638 = !DISubprogram(name: "map_err<i8, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#7}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h19899cd4d8439a7bE", scope: !601, file: !28, line: 826, type: !617, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !639)
!639 = !{!611, !335, !389, !640}
!640 = !DITemplateTypeParameter(name: "O", type: !633)
!641 = !{!642, !643, !644, !646}
!642 = !DILocalVariable(name: "self", arg: 1, scope: !600, file: !28, line: 826, type: !601)
!643 = !DILocalVariable(name: "op", arg: 2, scope: !600, file: !28, line: 826, type: !633)
!644 = !DILocalVariable(name: "t", scope: !645, file: !28, line: 828, type: !609, align: 1)
!645 = distinct !DILexicalBlock(scope: !600, file: !28, line: 828, column: 13)
!646 = !DILocalVariable(name: "e", scope: !647, file: !28, line: 829, type: !336, align: 1)
!647 = distinct !DILexicalBlock(scope: !600, file: !28, line: 829, column: 13)
!648 = !DILocation(line: 826, column: 42, scope: !600)
!649 = !DILocation(line: 826, column: 48, scope: !600)
!650 = !DILocation(line: 827, column: 15, scope: !600)
!651 = !DILocation(line: 827, column: 9, scope: !600)
!652 = !DILocation(line: 828, column: 16, scope: !600)
!653 = !DILocation(line: 828, column: 16, scope: !645)
!654 = !DILocation(line: 828, column: 22, scope: !645)
!655 = !DILocation(line: 831, column: 5, scope: !600)
!656 = !DILocation(line: 829, column: 17, scope: !600)
!657 = !DILocation(line: 829, column: 17, scope: !647)
!658 = !DILocation(line: 829, column: 27, scope: !647)
!659 = !DILocation(line: 829, column: 23, scope: !647)
!660 = !DILocation(line: 829, column: 32, scope: !600)
!661 = !DILocation(line: 831, column: 6, scope: !600)
!662 = distinct !DISubprogram(name: "map_err<usize, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#46}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h310122c3588b741bE", scope: !663, file: !28, line: 826, type: !677, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !699, declaration: !698, retainedNodes: !701)
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<usize, core::num::error::ParseIntError>", scope: !30, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !664, templateParams: !46, identifier: "939f78e16ecd56a3a1d995f7283d00aa")
!664 = !{!665}
!665 = !DICompositeType(tag: DW_TAG_variant_part, scope: !663, file: !8, size: 128, align: 64, elements: !666, templateParams: !46, identifier: "be57df8009663d4545f5449a73567530", discriminator: !676)
!666 = !{!667, !672}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !665, file: !8, baseType: !668, size: 128, align: 64, extraData: i128 0)
!668 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !663, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !669, templateParams: !671, identifier: "a12a331fd99d2bddd2f5ddbd48dc94b6")
!669 = !{!670}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !668, file: !8, baseType: !81, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!671 = !{!203, !335}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !665, file: !8, baseType: !673, size: 128, align: 64, extraData: i128 1)
!673 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !663, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !674, templateParams: !671, identifier: "3f367a6b73df7ec48faa6b61ade2e79")
!674 = !{!675}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !673, file: !8, baseType: !336, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!676 = !DIDerivedType(tag: DW_TAG_member, scope: !663, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!677 = !DISubroutineType(types: !678)
!678 = !{!679, !663, !693}
!679 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<usize, bitflags::parser::ParseError>", scope: !30, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !680, templateParams: !46, identifier: "82964038452c5ed193b964055664f7a")
!680 = !{!681}
!681 = !DICompositeType(tag: DW_TAG_variant_part, scope: !679, file: !8, size: 128, align: 64, elements: !682, templateParams: !46, identifier: "43bc263a3cb394cb44d75bbcdeb4d7c1", discriminator: !692)
!682 = !{!683, !688}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !681, file: !8, baseType: !684, size: 128, align: 64, extraData: i128 0)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !679, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !685, templateParams: !687, identifier: "449987ad6681a24656952bc03cf6f3e9")
!685 = !{!686}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !684, file: !8, baseType: !81, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!687 = !{!203, !355}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !681, file: !8, baseType: !689, size: 128, align: 64, extraData: i128 1)
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !679, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !690, templateParams: !687, identifier: "a0a18510a6861f0d4c250d0c8311e0c1")
!690 = !{!691}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !689, file: !8, baseType: !356, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!692 = !DIDerivedType(tag: DW_TAG_member, scope: !679, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !694, file: !8, size: 64, align: 64, elements: !696, templateParams: !46, identifier: "6df7b05be31f7aa43fe1de01cd750268")
!694 = !DINamespace(name: "parse_hex", scope: !695)
!695 = !DINamespace(name: "{impl#46}", scope: !384)
!696 = !{!697}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !693, file: !8, baseType: !251, size: 64, align: 64)
!698 = !DISubprogram(name: "map_err<usize, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#46}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h310122c3588b741bE", scope: !663, file: !28, line: 826, type: !677, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !699)
!699 = !{!203, !335, !389, !700}
!700 = !DITemplateTypeParameter(name: "O", type: !693)
!701 = !{!702, !703, !704, !706}
!702 = !DILocalVariable(name: "self", arg: 1, scope: !662, file: !28, line: 826, type: !663)
!703 = !DILocalVariable(name: "op", arg: 2, scope: !662, file: !28, line: 826, type: !693)
!704 = !DILocalVariable(name: "t", scope: !705, file: !28, line: 828, type: !81, align: 8)
!705 = distinct !DILexicalBlock(scope: !662, file: !28, line: 828, column: 13)
!706 = !DILocalVariable(name: "e", scope: !707, file: !28, line: 829, type: !336, align: 1)
!707 = distinct !DILexicalBlock(scope: !662, file: !28, line: 829, column: 13)
!708 = !DILocation(line: 826, column: 42, scope: !662)
!709 = !DILocation(line: 826, column: 48, scope: !662)
!710 = !DILocation(line: 827, column: 15, scope: !662)
!711 = !DILocation(line: 827, column: 9, scope: !662)
!712 = !DILocation(line: 828, column: 16, scope: !662)
!713 = !DILocation(line: 828, column: 16, scope: !705)
!714 = !DILocation(line: 828, column: 22, scope: !705)
!715 = !DILocation(line: 831, column: 5, scope: !662)
!716 = !DILocation(line: 829, column: 17, scope: !662)
!717 = !DILocation(line: 829, column: 17, scope: !707)
!718 = !DILocation(line: 829, column: 27, scope: !707)
!719 = !DILocation(line: 829, column: 23, scope: !707)
!720 = !DILocation(line: 829, column: 32, scope: !662)
!721 = !DILocation(line: 831, column: 6, scope: !662)
!722 = distinct !DISubprogram(name: "map_err<i16, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#15}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h476782a0836c701aE", scope: !723, file: !28, line: 826, type: !739, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !761, declaration: !760, retainedNodes: !763)
!723 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i16, core::num::error::ParseIntError>", scope: !30, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !724, templateParams: !46, identifier: "3dc430c6885447c39d0d4732851ad290")
!724 = !{!725}
!725 = !DICompositeType(tag: DW_TAG_variant_part, scope: !723, file: !8, size: 32, align: 16, elements: !726, templateParams: !46, identifier: "7e3063a8e40afba2b7a6fcbea7d50f84", discriminator: !738)
!726 = !{!727, !734}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !725, file: !8, baseType: !728, size: 32, align: 16, extraData: i128 0)
!728 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !723, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !729, templateParams: !732, identifier: "a27fe586e7bb7b30456a8b65b1672430")
!729 = !{!730}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !728, file: !8, baseType: !731, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!731 = !DIBasicType(name: "i16", size: 16, encoding: DW_ATE_signed)
!732 = !{!733, !335}
!733 = !DITemplateTypeParameter(name: "T", type: !731)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !725, file: !8, baseType: !735, size: 32, align: 16, extraData: i128 1)
!735 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !723, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !736, templateParams: !732, identifier: "8c320924422ede15fc835ccc248b1df1")
!736 = !{!737}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !735, file: !8, baseType: !336, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!738 = !DIDerivedType(tag: DW_TAG_member, scope: !723, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!739 = !DISubroutineType(types: !740)
!740 = !{!741, !723, !755}
!741 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i16, bitflags::parser::ParseError>", scope: !30, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !742, templateParams: !46, identifier: "e8ebae5f4360156b6fb02fb20ae34208")
!742 = !{!743}
!743 = !DICompositeType(tag: DW_TAG_variant_part, scope: !741, file: !8, size: 32, align: 16, elements: !744, templateParams: !46, identifier: "cf5a6d611916caedf863e9d453296161", discriminator: !754)
!744 = !{!745, !750}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !743, file: !8, baseType: !746, size: 32, align: 16, extraData: i128 0)
!746 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !741, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !747, templateParams: !749, identifier: "5cbfd409c9e21126d9eedf159e3af8bf")
!747 = !{!748}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !746, file: !8, baseType: !731, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!749 = !{!733, !355}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !743, file: !8, baseType: !751, size: 32, align: 16, extraData: i128 1)
!751 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !741, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !752, templateParams: !749, identifier: "20a21b9072dfddf3aeca197f96ae26")
!752 = !{!753}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !751, file: !8, baseType: !356, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!754 = !DIDerivedType(tag: DW_TAG_member, scope: !741, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !756, file: !8, size: 64, align: 64, elements: !758, templateParams: !46, identifier: "51a9517e12d7561887dc3c7c0edd380d")
!756 = !DINamespace(name: "parse_hex", scope: !757)
!757 = !DINamespace(name: "{impl#15}", scope: !384)
!758 = !{!759}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !755, file: !8, baseType: !251, size: 64, align: 64)
!760 = !DISubprogram(name: "map_err<i16, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#15}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h476782a0836c701aE", scope: !723, file: !28, line: 826, type: !739, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !761)
!761 = !{!733, !335, !389, !762}
!762 = !DITemplateTypeParameter(name: "O", type: !755)
!763 = !{!764, !765, !766, !768}
!764 = !DILocalVariable(name: "self", arg: 1, scope: !722, file: !28, line: 826, type: !723)
!765 = !DILocalVariable(name: "op", arg: 2, scope: !722, file: !28, line: 826, type: !755)
!766 = !DILocalVariable(name: "t", scope: !767, file: !28, line: 828, type: !731, align: 2)
!767 = distinct !DILexicalBlock(scope: !722, file: !28, line: 828, column: 13)
!768 = !DILocalVariable(name: "e", scope: !769, file: !28, line: 829, type: !336, align: 1)
!769 = distinct !DILexicalBlock(scope: !722, file: !28, line: 829, column: 13)
!770 = !DILocation(line: 826, column: 42, scope: !722)
!771 = !DILocation(line: 826, column: 48, scope: !722)
!772 = !DILocation(line: 827, column: 15, scope: !722)
!773 = !DILocation(line: 827, column: 9, scope: !722)
!774 = !DILocation(line: 828, column: 16, scope: !722)
!775 = !DILocation(line: 828, column: 16, scope: !767)
!776 = !DILocation(line: 828, column: 22, scope: !767)
!777 = !DILocation(line: 831, column: 5, scope: !722)
!778 = !DILocation(line: 829, column: 17, scope: !722)
!779 = !DILocation(line: 829, column: 17, scope: !769)
!780 = !DILocation(line: 829, column: 27, scope: !769)
!781 = !DILocation(line: 829, column: 23, scope: !769)
!782 = !DILocation(line: 829, column: 32, scope: !722)
!783 = !DILocation(line: 831, column: 6, scope: !722)
!784 = distinct !DISubprogram(name: "map_err<u16, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#14}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h6dd380a2cc62404aE", scope: !785, file: !28, line: 826, type: !801, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !823, declaration: !822, retainedNodes: !825)
!785 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u16, core::num::error::ParseIntError>", scope: !30, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !786, templateParams: !46, identifier: "82d5025ffa80fa533b1a58bf2626bdc4")
!786 = !{!787}
!787 = !DICompositeType(tag: DW_TAG_variant_part, scope: !785, file: !8, size: 32, align: 16, elements: !788, templateParams: !46, identifier: "eea64d75ee8dbe4eeef1d293b516192", discriminator: !800)
!788 = !{!789, !796}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !787, file: !8, baseType: !790, size: 32, align: 16, extraData: i128 0)
!790 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !785, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !791, templateParams: !794, identifier: "1040a882d2c5a655a368249189aa6aa9")
!791 = !{!792}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !790, file: !8, baseType: !793, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!793 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!794 = !{!795, !335}
!795 = !DITemplateTypeParameter(name: "T", type: !793)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !787, file: !8, baseType: !797, size: 32, align: 16, extraData: i128 1)
!797 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !785, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !798, templateParams: !794, identifier: "8c9c84dbde451cdd470c6e788b350bf")
!798 = !{!799}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !797, file: !8, baseType: !336, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!800 = !DIDerivedType(tag: DW_TAG_member, scope: !785, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!801 = !DISubroutineType(types: !802)
!802 = !{!803, !785, !817}
!803 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u16, bitflags::parser::ParseError>", scope: !30, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !804, templateParams: !46, identifier: "72d42bf9f39b104c54e064b89a7a9b5f")
!804 = !{!805}
!805 = !DICompositeType(tag: DW_TAG_variant_part, scope: !803, file: !8, size: 32, align: 16, elements: !806, templateParams: !46, identifier: "aa32ebabcd84e3da9da1c230b8d28afa", discriminator: !816)
!806 = !{!807, !812}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !805, file: !8, baseType: !808, size: 32, align: 16, extraData: i128 0)
!808 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !803, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !809, templateParams: !811, identifier: "efb1c6ae49c20f7522e0cb80a09cf2ed")
!809 = !{!810}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !808, file: !8, baseType: !793, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!811 = !{!795, !355}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !805, file: !8, baseType: !813, size: 32, align: 16, extraData: i128 1)
!813 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !803, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !814, templateParams: !811, identifier: "531557554c75630627b678d2b6ab7e45")
!814 = !{!815}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !813, file: !8, baseType: !356, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!816 = !DIDerivedType(tag: DW_TAG_member, scope: !803, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!817 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !818, file: !8, size: 64, align: 64, elements: !820, templateParams: !46, identifier: "8222a814cdc137207251fa4e59b5e299")
!818 = !DINamespace(name: "parse_hex", scope: !819)
!819 = !DINamespace(name: "{impl#14}", scope: !384)
!820 = !{!821}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !817, file: !8, baseType: !251, size: 64, align: 64)
!822 = !DISubprogram(name: "map_err<u16, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#14}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h6dd380a2cc62404aE", scope: !785, file: !28, line: 826, type: !801, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !823)
!823 = !{!795, !335, !389, !824}
!824 = !DITemplateTypeParameter(name: "O", type: !817)
!825 = !{!826, !827, !828, !830}
!826 = !DILocalVariable(name: "self", arg: 1, scope: !784, file: !28, line: 826, type: !785)
!827 = !DILocalVariable(name: "op", arg: 2, scope: !784, file: !28, line: 826, type: !817)
!828 = !DILocalVariable(name: "t", scope: !829, file: !28, line: 828, type: !793, align: 2)
!829 = distinct !DILexicalBlock(scope: !784, file: !28, line: 828, column: 13)
!830 = !DILocalVariable(name: "e", scope: !831, file: !28, line: 829, type: !336, align: 1)
!831 = distinct !DILexicalBlock(scope: !784, file: !28, line: 829, column: 13)
!832 = !DILocation(line: 826, column: 42, scope: !784)
!833 = !DILocation(line: 826, column: 48, scope: !784)
!834 = !DILocation(line: 827, column: 15, scope: !784)
!835 = !DILocation(line: 827, column: 9, scope: !784)
!836 = !DILocation(line: 828, column: 16, scope: !784)
!837 = !DILocation(line: 828, column: 16, scope: !829)
!838 = !DILocation(line: 828, column: 22, scope: !829)
!839 = !DILocation(line: 831, column: 5, scope: !784)
!840 = !DILocation(line: 829, column: 17, scope: !784)
!841 = !DILocation(line: 829, column: 17, scope: !831)
!842 = !DILocation(line: 829, column: 27, scope: !831)
!843 = !DILocation(line: 829, column: 23, scope: !831)
!844 = !DILocation(line: 829, column: 32, scope: !784)
!845 = !DILocation(line: 831, column: 6, scope: !784)
!846 = distinct !DISubprogram(name: "map_err<u8, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#6}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h8e7e7c0e4fe8410aE", scope: !847, file: !28, line: 826, type: !862, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !884, declaration: !883, retainedNodes: !886)
!847 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u8, core::num::error::ParseIntError>", scope: !30, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !848, templateParams: !46, identifier: "bbec4de5896a4ad9bea3d7a1dadd128f")
!848 = !{!849}
!849 = !DICompositeType(tag: DW_TAG_variant_part, scope: !847, file: !8, size: 16, align: 8, elements: !850, templateParams: !46, identifier: "19567139024df0fea3b0bea3ecf1e0a3", discriminator: !861)
!850 = !{!851, !857}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !849, file: !8, baseType: !852, size: 16, align: 8, extraData: i128 0)
!852 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !847, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !853, templateParams: !855, identifier: "dade8eb45eb334b17df1854c9c46a607")
!853 = !{!854}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !852, file: !8, baseType: !12, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!855 = !{!856, !335}
!856 = !DITemplateTypeParameter(name: "T", type: !12)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !849, file: !8, baseType: !858, size: 16, align: 8, extraData: i128 1)
!858 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !847, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !859, templateParams: !855, identifier: "1402901a4d8c54f03fce30a7085d6f44")
!859 = !{!860}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !858, file: !8, baseType: !336, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!861 = !DIDerivedType(tag: DW_TAG_member, scope: !847, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!862 = !DISubroutineType(types: !863)
!863 = !{!864, !847, !878}
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u8, bitflags::parser::ParseError>", scope: !30, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !865, templateParams: !46, identifier: "fd94a2c607f78e4b7ac044104caf75c1")
!865 = !{!866}
!866 = !DICompositeType(tag: DW_TAG_variant_part, scope: !864, file: !8, size: 16, align: 8, elements: !867, templateParams: !46, identifier: "dda6f33edbac040adb55f3311190734a", discriminator: !877)
!867 = !{!868, !873}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !866, file: !8, baseType: !869, size: 16, align: 8, extraData: i128 0)
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !864, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !870, templateParams: !872, identifier: "d5a9d85171a1bcdbb6c53fef73d8ad9c")
!870 = !{!871}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !869, file: !8, baseType: !12, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!872 = !{!856, !355}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !866, file: !8, baseType: !874, size: 16, align: 8, extraData: i128 1)
!874 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !864, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !875, templateParams: !872, identifier: "a2e864eff031cce49d13ada016bca125")
!875 = !{!876}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !874, file: !8, baseType: !356, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!877 = !DIDerivedType(tag: DW_TAG_member, scope: !864, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!878 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !879, file: !8, size: 64, align: 64, elements: !881, templateParams: !46, identifier: "3e00cda727b9db2d7c06952b9cd7871a")
!879 = !DINamespace(name: "parse_hex", scope: !880)
!880 = !DINamespace(name: "{impl#6}", scope: !384)
!881 = !{!882}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !878, file: !8, baseType: !251, size: 64, align: 64)
!883 = !DISubprogram(name: "map_err<u8, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#6}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h8e7e7c0e4fe8410aE", scope: !847, file: !28, line: 826, type: !862, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !884)
!884 = !{!856, !335, !389, !885}
!885 = !DITemplateTypeParameter(name: "O", type: !878)
!886 = !{!887, !888, !889, !891}
!887 = !DILocalVariable(name: "self", arg: 1, scope: !846, file: !28, line: 826, type: !847)
!888 = !DILocalVariable(name: "op", arg: 2, scope: !846, file: !28, line: 826, type: !878)
!889 = !DILocalVariable(name: "t", scope: !890, file: !28, line: 828, type: !12, align: 1)
!890 = distinct !DILexicalBlock(scope: !846, file: !28, line: 828, column: 13)
!891 = !DILocalVariable(name: "e", scope: !892, file: !28, line: 829, type: !336, align: 1)
!892 = distinct !DILexicalBlock(scope: !846, file: !28, line: 829, column: 13)
!893 = !DILocation(line: 826, column: 42, scope: !846)
!894 = !DILocation(line: 826, column: 48, scope: !846)
!895 = !DILocation(line: 827, column: 15, scope: !846)
!896 = !DILocation(line: 827, column: 9, scope: !846)
!897 = !DILocation(line: 828, column: 16, scope: !846)
!898 = !DILocation(line: 828, column: 16, scope: !890)
!899 = !DILocation(line: 828, column: 22, scope: !890)
!900 = !DILocation(line: 831, column: 5, scope: !846)
!901 = !DILocation(line: 829, column: 17, scope: !846)
!902 = !DILocation(line: 829, column: 17, scope: !892)
!903 = !DILocation(line: 829, column: 27, scope: !892)
!904 = !DILocation(line: 829, column: 23, scope: !892)
!905 = !DILocation(line: 829, column: 32, scope: !846)
!906 = !DILocation(line: 831, column: 6, scope: !846)
!907 = distinct !DISubprogram(name: "map_err<u64, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#30}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h9f3bf4bb58d1b5ffE", scope: !908, file: !28, line: 826, type: !923, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !945, declaration: !944, retainedNodes: !947)
!908 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u64, core::num::error::ParseIntError>", scope: !30, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !909, templateParams: !46, identifier: "babdfce272bdea45888cb758e184fec3")
!909 = !{!910}
!910 = !DICompositeType(tag: DW_TAG_variant_part, scope: !908, file: !8, size: 128, align: 64, elements: !911, templateParams: !46, identifier: "c52048e6d9554f76c33382e059f36601", discriminator: !922)
!911 = !{!912, !918}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !910, file: !8, baseType: !913, size: 128, align: 64, extraData: i128 0)
!913 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !908, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !914, templateParams: !916, identifier: "65b1d1f2ee6b7be61d6678c9c5745c8b")
!914 = !{!915}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !913, file: !8, baseType: !166, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!916 = !{!917, !335}
!917 = !DITemplateTypeParameter(name: "T", type: !166)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !910, file: !8, baseType: !919, size: 128, align: 64, extraData: i128 1)
!919 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !908, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !920, templateParams: !916, identifier: "ff93f28b29d3bdea4ad534d30ffab78e")
!920 = !{!921}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !919, file: !8, baseType: !336, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!922 = !DIDerivedType(tag: DW_TAG_member, scope: !908, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!923 = !DISubroutineType(types: !924)
!924 = !{!925, !908, !939}
!925 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u64, bitflags::parser::ParseError>", scope: !30, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !926, templateParams: !46, identifier: "9b013cc1262480743a231f151caa98cd")
!926 = !{!927}
!927 = !DICompositeType(tag: DW_TAG_variant_part, scope: !925, file: !8, size: 128, align: 64, elements: !928, templateParams: !46, identifier: "c09cccdc4c34ecf1974dc7a35ef33f69", discriminator: !938)
!928 = !{!929, !934}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !927, file: !8, baseType: !930, size: 128, align: 64, extraData: i128 0)
!930 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !925, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !931, templateParams: !933, identifier: "12228e66f270cf1dd743f7091df10a44")
!931 = !{!932}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !930, file: !8, baseType: !166, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!933 = !{!917, !355}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !927, file: !8, baseType: !935, size: 128, align: 64, extraData: i128 1)
!935 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !925, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !936, templateParams: !933, identifier: "abe4e68208ea51e9e02bed6f091aff1")
!936 = !{!937}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !935, file: !8, baseType: !356, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!938 = !DIDerivedType(tag: DW_TAG_member, scope: !925, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!939 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !940, file: !8, size: 64, align: 64, elements: !942, templateParams: !46, identifier: "26572679cf536e62471f67026c5861e3")
!940 = !DINamespace(name: "parse_hex", scope: !941)
!941 = !DINamespace(name: "{impl#30}", scope: !384)
!942 = !{!943}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !939, file: !8, baseType: !251, size: 64, align: 64)
!944 = !DISubprogram(name: "map_err<u64, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#30}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h9f3bf4bb58d1b5ffE", scope: !908, file: !28, line: 826, type: !923, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !945)
!945 = !{!917, !335, !389, !946}
!946 = !DITemplateTypeParameter(name: "O", type: !939)
!947 = !{!948, !949, !950, !952}
!948 = !DILocalVariable(name: "self", arg: 1, scope: !907, file: !28, line: 826, type: !908)
!949 = !DILocalVariable(name: "op", arg: 2, scope: !907, file: !28, line: 826, type: !939)
!950 = !DILocalVariable(name: "t", scope: !951, file: !28, line: 828, type: !166, align: 8)
!951 = distinct !DILexicalBlock(scope: !907, file: !28, line: 828, column: 13)
!952 = !DILocalVariable(name: "e", scope: !953, file: !28, line: 829, type: !336, align: 1)
!953 = distinct !DILexicalBlock(scope: !907, file: !28, line: 829, column: 13)
!954 = !DILocation(line: 826, column: 42, scope: !907)
!955 = !DILocation(line: 826, column: 48, scope: !907)
!956 = !DILocation(line: 827, column: 15, scope: !907)
!957 = !DILocation(line: 827, column: 9, scope: !907)
!958 = !DILocation(line: 828, column: 16, scope: !907)
!959 = !DILocation(line: 828, column: 16, scope: !951)
!960 = !DILocation(line: 828, column: 22, scope: !951)
!961 = !DILocation(line: 831, column: 5, scope: !907)
!962 = !DILocation(line: 829, column: 17, scope: !907)
!963 = !DILocation(line: 829, column: 17, scope: !953)
!964 = !DILocation(line: 829, column: 27, scope: !953)
!965 = !DILocation(line: 829, column: 23, scope: !953)
!966 = !DILocation(line: 829, column: 32, scope: !907)
!967 = !DILocation(line: 831, column: 6, scope: !907)
!968 = distinct !DISubprogram(name: "map_err<u32, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#22}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17hee2e15d91999d9b3E", scope: !969, file: !28, line: 826, type: !984, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !1006, declaration: !1005, retainedNodes: !1008)
!969 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u32, core::num::error::ParseIntError>", scope: !30, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !970, templateParams: !46, identifier: "f621b758cd51eef9ed75e16942dbc9ca")
!970 = !{!971}
!971 = !DICompositeType(tag: DW_TAG_variant_part, scope: !969, file: !8, size: 64, align: 32, elements: !972, templateParams: !46, identifier: "fe0ed0265e8a497b96ece12ae18b75f9", discriminator: !983)
!972 = !{!973, !979}
