; ModuleID = '298khtjw0gf4p2fb'
source_filename = "298khtjw0gf4p2fb"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128"
target triple = "arm64-apple-macosx11.0.0"

%"core::ptr::metadata::PtrComponents<[u8]>" = type { ptr, i64 }
%"core::ptr::metadata::PtrRepr<[u8]>" = type { [2 x i64] }
%"core::slice::iter::Iter<'_, u8>" = type { ptr, ptr, %"core::marker::PhantomData<&u8>" }
%"core::marker::PhantomData<&u8>" = type {}
%"core::fmt::Error" = type {}
%"core::result::Result<core::convert::Infallible, core::fmt::Error>::Err" = type { %"core::fmt::Error" }
%"core::option::Option<usize>" = type { i64, [1 x i64] }
%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, %"core::option::Option<&[core::fmt::rt::Placeholder]>" }
%"core::option::Option<&[core::fmt::rt::Placeholder]>" = type { ptr, [1 x i64] }
%"core::option::Option<&str>" = type { ptr, [1 x i64] }
%"core::fmt::rt::UnsafeArg" = type { {} }
%"bytes::Bytes" = type { ptr, ptr, i64, %"core::sync::atomic::AtomicPtr<()>" }
%"core::sync::atomic::AtomicPtr<()>" = type { ptr }
%"alloc::vec::Vec<u8>" = type { %"alloc::raw_vec::RawVec<u8>", i64 }
%"alloc::raw_vec::RawVec<u8>" = type { i64, ptr, %"alloc::alloc::Global" }
%"alloc::alloc::Global" = type {}
%"core::ops::range::Bound<&u8>" = type { i64, [1 x i64] }
%"{closure@src/bytes.rs:1002:39: 1002:47}" = type {}
%"{closure@src/bytes.rs:1035:39: 1035:47}" = type {}
%"bytes_mut::BytesMut" = type { ptr, i64, i64, ptr }
%"core::ops::range::RangeFull" = type {}

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<core::alloc::layout::LayoutError as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::alloc::layout::LayoutError as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !16, identifier: "e77fffcb0cb7c5d3ce982782c7c5ebd")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "LayoutError", scope: !13, file: !2, align: 8, flags: DIFlagPublic, elements: !16, identifier: "54f586ca68200ff2892fbfd5caff7e42")
!13 = !DINamespace(name: "layout", scope: !14)
!14 = !DINamespace(name: "alloc", scope: !15)
!15 = !DINamespace(name: "core", scope: null)
!16 = !{}
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "<&usize as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&usize as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !20, vtableHolder: !25, templateParams: !16, identifier: "7e6750a5355375eca2d7011c7d6ef463")
!20 = !{!21, !22, !23, !24}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !19, file: !2, baseType: !6, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !19, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !19, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !19, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "<*const () as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !28, isLocal: true, isDefinition: true)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "<*const () as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !29, vtableHolder: !6, templateParams: !16, identifier: "ceceb2cf57c90669204559ac34de8af5")
!29 = !{!30, !31, !32, !33}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !28, file: !2, baseType: !6, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !28, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !28, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !28, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "PROMOTABLE_EVEN_VTABLE", linkageName: "_ZN5bytes5bytes22PROMOTABLE_EVEN_VTABLE17hd5e694a94ef007deE", scope: !36, file: !38, line: 948, type: !39, isLocal: false, isDefinition: true, align: 64)
!36 = !DINamespace(name: "bytes", scope: !37)
!37 = !DINamespace(name: "bytes", scope: null)
!38 = !DIFile(filename: "src/bytes.rs", directory: "/private/var/folders/m6/nyw0tbd5239gngtm06pzykr00000gn/T/.tmpPXbnuW/bytes", checksumkind: CSK_MD5, checksum: "3d09fb9d5f16feac7c5f225ccc42e5ac")
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vtable", scope: !36, file: !2, size: 256, align: 64, flags: DIFlagProtected, elements: !40, templateParams: !16, identifier: "4e3e07876f28e71a6a8809353b000df2")
!40 = !{!41, !69, !106, !111}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !39, file: !2, baseType: !42, size: 64, align: 64, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe fn(&core::sync::atomic::AtomicPtr<()>, *const u8, usize) -> bytes::bytes::Bytes", baseType: !43, size: 64, align: 64, dwarfAddressSpace: 0)
!43 = !DISubroutineType(types: !44)
!44 = !{!45, !68, !48, !9}
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "Bytes", scope: !36, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !46, templateParams: !16, identifier: "4bc0c4b984a88d3b1dbcaa6ae912fb0b")
!46 = !{!47, !50, !51, !66}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !45, file: !2, baseType: !48, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !49, size: 64, align: 64, dwarfAddressSpace: 0)
!49 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !45, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !45, file: !2, baseType: !52, size: 64, align: 64, offset: 192, flags: DIFlagPrivate)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicPtr<()>", scope: !53, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !55, templateParams: !64, identifier: "cf65be55169ce6ab4502c61d7b6a135")
!53 = !DINamespace(name: "atomic", scope: !54)
!54 = !DINamespace(name: "sync", scope: !15)
!55 = !{!56}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !52, file: !2, baseType: !57, size: 64, align: 64, flags: DIFlagPrivate)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<*mut ()>", scope: !58, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !59, templateParams: !62, identifier: "b9ff203e432ec33f3c59c1404a87e29b")
!58 = !DINamespace(name: "cell", scope: !15)
!59 = !{!60}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !57, file: !2, baseType: !61, size: 64, align: 64, flags: DIFlagPrivate)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!62 = !{!63}
!63 = !DITemplateTypeParameter(name: "T", type: !61)
!64 = !{!65}
!65 = !DITemplateTypeParameter(name: "T", type: !7)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !45, file: !2, baseType: !67, size: 64, align: 64, flags: DIFlagPrivate)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bytes::bytes::Vtable", baseType: !39, size: 64, align: 64, dwarfAddressSpace: 0)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicPtr<()>", baseType: !52, size: 64, align: 64, dwarfAddressSpace: 0)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "to_vec", scope: !39, file: !2, baseType: !70, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe fn(&core::sync::atomic::AtomicPtr<()>, *const u8, usize) -> alloc::vec::Vec<u8, alloc::alloc::Global>", baseType: !71, size: 64, align: 64, dwarfAddressSpace: 0)
!71 = !DISubroutineType(types: !72)
!72 = !{!73, !68, !48, !9}
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !74, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !76, templateParams: !103, identifier: "75493663ebbb7ddde98b0972cfe88517")
!74 = !DINamespace(name: "vec", scope: !75)
!75 = !DINamespace(name: "alloc", scope: null)
!76 = !{!77, !105}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !73, file: !2, baseType: !78, size: 128, align: 64, flags: DIFlagPrivate)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !79, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !80, templateParams: !103, identifier: "46cd84c18a5643544a9147019d5a6d93")
!79 = !DINamespace(name: "raw_vec", scope: !75)
!80 = !{!81, !96, !100}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !78, file: !2, baseType: !82, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !83, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !85, templateParams: !91, identifier: "9b0a3349739844f85f1609423a392ced")
!83 = !DINamespace(name: "unique", scope: !84)
!84 = !DINamespace(name: "ptr", scope: !15)
!85 = !{!86, !93}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !82, file: !2, baseType: !87, size: 64, align: 64, flags: DIFlagPrivate)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !88, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !89, templateParams: !91, identifier: "e5aae4d783c62ca19d6192838800021b")
!88 = !DINamespace(name: "non_null", scope: !84)
!89 = !{!90}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !87, file: !2, baseType: !48, size: 64, align: 64, flags: DIFlagPrivate)
!91 = !{!92}
!92 = !DITemplateTypeParameter(name: "T", type: !49)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !82, file: !2, baseType: !94, align: 8, offset: 64, flags: DIFlagPrivate)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !95, file: !2, align: 8, flags: DIFlagPublic, elements: !16, templateParams: !91, identifier: "d374584ddc3e1e4bf64f7a4ecd03e9bd")
!95 = !DINamespace(name: "marker", scope: !15)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !78, file: !2, baseType: !97, size: 64, align: 64, flags: DIFlagPrivate)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cap", scope: !79, file: !2, size: 64, align: 64, flags: DIFlagPrivate, elements: !98, templateParams: !16, identifier: "f6e0172a239b20d5c4e40f5321e726d6")
!98 = !{!99}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !97, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !78, file: !2, baseType: !101, align: 8, offset: 128, flags: DIFlagPrivate)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !102, file: !2, align: 8, flags: DIFlagPublic, elements: !16, identifier: "565e9af856f873ca6c6565cfe9042298")
!102 = !DINamespace(name: "alloc", scope: !75)
!103 = !{!92, !104}
!104 = !DITemplateTypeParameter(name: "A", type: !101)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !73, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "is_unique", scope: !39, file: !2, baseType: !107, size: 64, align: 64, offset: 128, flags: DIFlagPublic)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe fn(&core::sync::atomic::AtomicPtr<()>) -> bool", baseType: !108, size: 64, align: 64, dwarfAddressSpace: 0)
!108 = !DISubroutineType(types: !109)
!109 = !{!110, !68}
!110 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "drop", scope: !39, file: !2, baseType: !112, size: 64, align: 64, offset: 192, flags: DIFlagPublic)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe fn(&mut core::sync::atomic::AtomicPtr<()>, *const u8, usize)", baseType: !113, size: 64, align: 64, dwarfAddressSpace: 0)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !115, !48, !9}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::sync::atomic::AtomicPtr<()>", baseType: !52, size: 64, align: 64, dwarfAddressSpace: 0)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "PROMOTABLE_ODD_VTABLE", linkageName: "_ZN5bytes5bytes21PROMOTABLE_ODD_VTABLE17h66e36e8ae3c7f584E", scope: !36, file: !38, line: 955, type: !39, isLocal: false, isDefinition: true, align: 64)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "SHARED_VTABLE", linkageName: "_ZN5bytes5bytes13SHARED_VTABLE17h0c9ff62309450a48E", scope: !36, file: !38, line: 1091, type: !39, isLocal: true, isDefinition: true, align: 64)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "SHARED_VTABLE", linkageName: "_ZN5bytes9bytes_mut13SHARED_VTABLE17hbddc8020eccc0865E", scope: !122, file: !123, line: 1698, type: !39, isLocal: false, isDefinition: true, align: 64)
!122 = !DINamespace(name: "bytes_mut", scope: !37)
!123 = !DIFile(filename: "src/bytes_mut.rs", directory: "/private/var/folders/m6/nyw0tbd5239gngtm06pzykr00000gn/T/.tmpPXbnuW/bytes", checksumkind: CSK_MD5, checksum: "d879504f508943a1f93ea1d08051efc9")
!124 = !{i32 8, !"PIC Level", i32 2}
!125 = !{i32 2, !"Dwarf Version", i32 4}
!126 = !{i32 2, !"Debug Info Version", i32 3}
!127 = !{!"rustc version 1.78.0-nightly (46b180ec2 2024-03-08)"}
!128 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !129, producer: "clang LLVM (rustc version 1.78.0-nightly (46b180ec2 2024-03-08))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !130, globals: !231, splitDebugInlining: false, nameTableKind: None)
!129 = !DIFile(filename: "src/lib.rs/@/298khtjw0gf4p2fb", directory: "/private/var/folders/m6/nyw0tbd5239gngtm06pzykr00000gn/T/.tmpPXbnuW/bytes")
!130 = !{!131, !139, !146, !153, !221, !227}
!131 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !132, file: !2, baseType: !49, size: 8, align: 8, flags: DIFlagEnumClass, elements: !134)
!132 = !DINamespace(name: "rt", scope: !133)
!133 = !DINamespace(name: "fmt", scope: !15)
!134 = !{!135, !136, !137, !138}
!135 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!136 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!137 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!138 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!139 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !140, file: !2, baseType: !141, size: 8, align: 8, flags: DIFlagEnumClass, elements: !142)
!140 = !DINamespace(name: "cmp", scope: !15)
!141 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!142 = !{!143, !144, !145}
!143 = !DIEnumerator(name: "Less", value: -1)
!144 = !DIEnumerator(name: "Equal", value: 0)
!145 = !DIEnumerator(name: "Greater", value: 1)
!146 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !53, file: !2, baseType: !49, size: 8, align: 8, flags: DIFlagEnumClass, elements: !147)
!147 = !{!148, !149, !150, !151, !152}
!148 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!149 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!150 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!151 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!152 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!153 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AlignmentEnum", scope: !154, file: !2, baseType: !155, size: 64, align: 64, flags: DIFlagEnumClass, elements: !156)
!154 = !DINamespace(name: "alignment", scope: !84)
!155 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!156 = !{!157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220}
!157 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!158 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!159 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!160 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!161 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!162 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!163 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!164 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!165 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!166 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!167 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!168 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!169 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!170 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!171 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!172 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!173 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!174 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!175 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!176 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!177 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!178 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!179 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!180 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!181 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!182 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!183 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!184 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!185 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!186 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!187 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!188 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!189 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!190 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!191 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!192 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!193 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!194 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!195 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!196 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!197 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!198 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!199 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!200 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!201 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!202 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!203 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!204 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!205 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!206 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!207 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!208 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!209 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!210 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!211 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!212 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!213 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!214 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!215 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!216 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!217 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!218 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!219 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!220 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!221 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !222, file: !2, baseType: !49, size: 8, align: 8, flags: DIFlagEnumClass, elements: !223)
!222 = !DINamespace(name: "panicking", scope: !15)
!223 = !{!224, !225, !226}
!224 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!225 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!226 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!227 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AllocInit", scope: !79, file: !2, baseType: !49, size: 8, align: 8, flags: DIFlagEnumClass, elements: !228)
!228 = !{!229, !230}
!229 = !DIEnumerator(name: "Uninitialized", value: 0, isUnsigned: true)
!230 = !DIEnumerator(name: "Zeroed", value: 1, isUnsigned: true)
!231 = !{!0, !17, !26, !34, !116, !118, !120}
!232 = distinct !DISubprogram(name: "spec_extend<u8, alloc::alloc::Global>", linkageName: "_ZN132_$LT$alloc..vec..Vec$LT$T$C$A$GT$$u20$as$u20$alloc..vec..spec_extend..SpecExtend$LT$$RF$T$C$core..slice..iter..Iter$LT$T$GT$$GT$$GT$11spec_extend17h19725ec67f136170E", scope: !234, file: !233, line: 53, type: !236, scopeLine: 53, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !103, retainedNodes: !250)
!233 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/alloc/src/vec/spec_extend.rs", directory: "", checksumkind: CSK_MD5, checksum: "2f128aa8845f656bd1589710f5c6857d")
!234 = !DINamespace(name: "{impl#4}", scope: !235)
!235 = !DINamespace(name: "spec_extend", scope: !74)
!236 = !DISubroutineType(types: !237)
!237 = !{null, !238, !239}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut alloc::vec::Vec<u8, alloc::alloc::Global>", baseType: !73, size: 64, align: 64, dwarfAddressSpace: 0)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<u8>", scope: !240, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !242, templateParams: !91, identifier: "c116562857a32c3baab5405f1ba7fe5f")
!240 = !DINamespace(name: "iter", scope: !241)
!241 = !DINamespace(name: "slice", scope: !15)
!242 = !{!243, !244, !245}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !239, file: !2, baseType: !87, size: 64, align: 64, flags: DIFlagPrivate)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "end_or_len", scope: !239, file: !2, baseType: !48, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !239, file: !2, baseType: !246, align: 8, offset: 128, flags: DIFlagPrivate)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&u8>", scope: !95, file: !2, align: 8, flags: DIFlagPublic, elements: !16, templateParams: !247, identifier: "4237ba9f5429bb38b8ef8eeadb5127a")
!247 = !{!248}
!248 = !DITemplateTypeParameter(name: "T", type: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !49, size: 64, align: 64, dwarfAddressSpace: 0)
!250 = !{!251, !252, !253}
!251 = !DILocalVariable(name: "self", arg: 1, scope: !232, file: !233, line: 53, type: !238)
!252 = !DILocalVariable(name: "iterator", arg: 2, scope: !232, file: !233, line: 53, type: !239)
!253 = !DILocalVariable(name: "slice", scope: !254, file: !233, line: 54, type: !255, align: 8)
!254 = distinct !DILexicalBlock(scope: !232, file: !233, line: 54, column: 9)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u8]", file: !2, size: 128, align: 64, elements: !256, templateParams: !16, identifier: "4f7d759e2003ffb713a77bd933fd0146")
!256 = !{!257, !259}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !255, file: !2, baseType: !258, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64, dwarfAddressSpace: 0)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !255, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!260 = !DILocation(line: 53, column: 20, scope: !232)
!261 = !DILocation(line: 53, column: 31, scope: !232)
!262 = !DILocation(line: 54, column: 21, scope: !232)
!263 = !DILocalVariable(name: "self", arg: 1, scope: !264, file: !265, line: 128, type: !269)
!264 = distinct !DILexicalBlock(scope: !266, file: !265, line: 128, column: 5)
!265 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/slice/iter.rs", directory: "", checksumkind: CSK_MD5, checksum: "284abbc45dd478622cb5da8bc571a86b")
!266 = distinct !DISubprogram(name: "as_slice<u8>", linkageName: "_ZN4core5slice4iter13Iter$LT$T$GT$8as_slice17haade23dbe5411f39E", scope: !239, file: !265, line: 128, type: !267, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !91, declaration: !270, retainedNodes: !271)
!267 = !DISubroutineType(types: !268)
!268 = !{!255, !269}
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::slice::iter::Iter<u8>", baseType: !239, size: 64, align: 64, dwarfAddressSpace: 0)
!270 = !DISubprogram(name: "as_slice<u8>", linkageName: "_ZN4core5slice4iter13Iter$LT$T$GT$8as_slice17haade23dbe5411f39E", scope: !239, file: !265, line: 128, type: !267, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !91)
!271 = !{!263}
!272 = !DILocation(line: 128, column: 21, scope: !264, inlinedAt: !273)
!273 = !DILocation(line: 54, column: 30, scope: !232)
!274 = !DILocalVariable(name: "self", arg: 1, scope: !275, file: !276, line: 90, type: !269)
!275 = distinct !DISubprogram(name: "make_slice<u8>", linkageName: "_ZN4core5slice4iter13Iter$LT$T$GT$10make_slice17h00a578fa744c37ecE", scope: !239, file: !276, line: 90, type: !267, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !91, declaration: !277, retainedNodes: !278)
!276 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/slice/iter/macros.rs", directory: "", checksumkind: CSK_MD5, checksum: "6f8ffd7d957e2a854f35c0c786a4dddb")
!277 = !DISubprogram(name: "make_slice<u8>", linkageName: "_ZN4core5slice4iter13Iter$LT$T$GT$10make_slice17h00a578fa744c37ecE", scope: !239, file: !276, line: 90, type: !267, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !91)
!278 = !{!274, !279, !281}
!279 = !DILocalVariable(name: "len", scope: !280, file: !276, line: 94, type: !9, align: 8)
!280 = distinct !DILexicalBlock(scope: !275, file: !276, line: 29, column: 13)
!281 = !DILocalVariable(name: "end", scope: !282, file: !276, line: 94, type: !87, align: 8)
!282 = distinct !DILexicalBlock(scope: !275, file: !276, line: 33, column: 13)
!283 = !DILocation(line: 90, column: 27, scope: !275, inlinedAt: !284)
!284 = distinct !DILocation(line: 129, column: 9, scope: !264, inlinedAt: !273)
!285 = !DILocalVariable(name: "len", arg: 2, scope: !286, file: !287, line: 95, type: !9)
!286 = distinct !DILexicalBlock(scope: !288, file: !287, line: 95, column: 1)
!287 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/slice/raw.rs", directory: "", checksumkind: CSK_MD5, checksum: "aab168912ad7aca64110c98f212940ac")
!288 = distinct !DISubprogram(name: "from_raw_parts<u8>", linkageName: "_ZN4core5slice3raw14from_raw_parts17ha0a5a407f5a2191bE", scope: !289, file: !287, line: 95, type: !290, scopeLine: 95, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !91, retainedNodes: !292)
!289 = !DINamespace(name: "raw", scope: !241)
!290 = !DISubroutineType(types: !291)
!291 = !{!255, !48, !9}
!292 = !{!293, !285}
!293 = !DILocalVariable(name: "data", arg: 1, scope: !286, file: !287, line: 95, type: !48)
!294 = !DILocation(line: 95, column: 59, scope: !286, inlinedAt: !295)
!295 = distinct !DILocation(line: 94, column: 26, scope: !275, inlinedAt: !284)
!296 = !DILocalVariable(name: "len", arg: 2, scope: !297, file: !298, line: 815, type: !9)
!297 = distinct !DILexicalBlock(scope: !299, file: !298, line: 815, column: 1)
!298 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "319662a8f09a06c38fa9ed06f53befd5")
!299 = distinct !DISubprogram(name: "slice_from_raw_parts<u8>", linkageName: "_ZN4core3ptr20slice_from_raw_parts17ha807a6e3b4c6edfbE", scope: !84, file: !298, line: 815, type: !300, scopeLine: 815, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !91, retainedNodes: !306)
!300 = !DISubroutineType(types: !301)
!301 = !{!302, !48, !9}
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const [u8]", file: !2, size: 128, align: 64, elements: !303, templateParams: !16, identifier: "a329dffc2f36de2e98a77091932cf429")
!303 = !{!304, !305}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !302, file: !2, baseType: !258, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !302, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!306 = !{!307, !296}
!307 = !DILocalVariable(name: "data", arg: 1, scope: !297, file: !298, line: 815, type: !48)
!308 = !DILocation(line: 815, column: 54, scope: !297, inlinedAt: !309)
!309 = distinct !DILocation(line: 109, column: 11, scope: !286, inlinedAt: !295)
!310 = !DILocalVariable(name: "metadata", arg: 2, scope: !311, file: !312, line: 113, type: !9)
!311 = distinct !DILexicalBlock(scope: !313, file: !312, line: 111, column: 1)
!312 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/ptr/metadata.rs", directory: "", checksumkind: CSK_MD5, checksum: "3e5f46ed28de51d38cc460b6ffb611d6")
!313 = distinct !DISubprogram(name: "from_raw_parts<[u8]>", linkageName: "_ZN4core3ptr8metadata14from_raw_parts17hecb657628c61a615E", scope: !314, file: !312, line: 111, type: !315, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !91, retainedNodes: !317)
!314 = !DINamespace(name: "metadata", scope: !84)
!315 = !DISubroutineType(types: !316)
!316 = !{!302, !6, !9}
!317 = !{!318, !310}
!318 = !DILocalVariable(name: "data_pointer", arg: 1, scope: !311, file: !312, line: 112, type: !6)
!319 = !DILocation(line: 113, column: 5, scope: !311, inlinedAt: !320)
!320 = distinct !DILocation(line: 816, column: 5, scope: !297, inlinedAt: !309)
!321 = !DILocation(line: 94, column: 41, scope: !275, inlinedAt: !284)
!322 = !DILocalVariable(name: "self", arg: 1, scope: !323, file: !324, line: 349, type: !87)
!323 = distinct !DILexicalBlock(scope: !325, file: !324, line: 349, column: 5)
!324 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/ptr/non_null.rs", directory: "", checksumkind: CSK_MD5, checksum: "a145fe82a5df4d863530a0287eb10483")
!325 = distinct !DISubprogram(name: "as_ptr<u8>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$6as_ptr17heffbc32eaee288a7E", scope: !87, file: !324, line: 349, type: !326, scopeLine: 349, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !91, declaration: !329, retainedNodes: !330)
!326 = !DISubroutineType(types: !327)
!327 = !{!328, !87}
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !49, size: 64, align: 64, dwarfAddressSpace: 0)
!329 = !DISubprogram(name: "as_ptr<u8>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$6as_ptr17heffbc32eaee288a7E", scope: !87, file: !324, line: 349, type: !326, scopeLine: 349, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !91)
!330 = !{!322}
!331 = !DILocation(line: 349, column: 25, scope: !323, inlinedAt: !332)
!332 = distinct !DILocation(line: 94, column: 50, scope: !275, inlinedAt: !284)
!333 = !DILocalVariable(name: "subtracted", arg: 2, scope: !334, file: !324, line: 952, type: !87)
!334 = distinct !DILexicalBlock(scope: !335, file: !324, line: 952, column: 5)
!335 = distinct !DISubprogram(name: "sub_ptr<u8>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$7sub_ptr17hf8e3d5da7277f199E", scope: !87, file: !324, line: 952, type: !336, scopeLine: 952, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !91, declaration: !338, retainedNodes: !339)
!336 = !DISubroutineType(types: !337)
!337 = !{!9, !87, !87}
!338 = !DISubprogram(name: "sub_ptr<u8>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$7sub_ptr17hf8e3d5da7277f199E", scope: !87, file: !324, line: 952, type: !336, scopeLine: 952, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !91)
!339 = !{!340, !333}
!340 = !DILocalVariable(name: "self", arg: 1, scope: !334, file: !324, line: 952, type: !87)
!341 = !DILocation(line: 952, column: 39, scope: !334, inlinedAt: !342)
!342 = distinct !DILocation(line: 57, column: 30, scope: !282, inlinedAt: !284)
!343 = !DILocation(line: 350, column: 9, scope: !323, inlinedAt: !332)
!344 = !DILocation(line: 95, column: 43, scope: !286, inlinedAt: !295)
!345 = !DILocation(line: 815, column: 38, scope: !297, inlinedAt: !309)
!346 = !DILocalVariable(name: "self", arg: 1, scope: !347, file: !348, line: 63, type: !48)
!347 = distinct !DILexicalBlock(scope: !349, file: !348, line: 63, column: 5)
!348 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/ptr/const_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "497dd18e023476b8914a8083d081a04c")
!349 = distinct !DISubprogram(name: "cast<u8, ()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17h8dea2cf67aa7b346E", scope: !350, file: !348, line: 63, type: !352, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !357, retainedNodes: !354)
!350 = !DINamespace(name: "{impl#0}", scope: !351)
!351 = !DINamespace(name: "const_ptr", scope: !84)
!352 = !DISubroutineType(types: !353)
!353 = !{!6, !48}
!354 = !{!355, !346}
!355 = !DILocalVariable(name: "self", arg: 1, scope: !356, file: !348, line: 63, type: !48)
!356 = distinct !DILexicalBlock(scope: !349, file: !348, line: 63, column: 5)
!357 = !{!92, !358}
!358 = !DITemplateTypeParameter(name: "U", type: !7)
!359 = !DILocation(line: 63, column: 26, scope: !347, inlinedAt: !360)
!360 = distinct !DILocation(line: 816, column: 25, scope: !297, inlinedAt: !309)
!361 = !DILocation(line: 94, column: 60, scope: !275, inlinedAt: !284)
!362 = !DILocalVariable(name: "self", arg: 1, scope: !363, file: !348, line: 63, type: !368)
!363 = distinct !DILexicalBlock(scope: !364, file: !348, line: 63, column: 5)
!364 = distinct !DISubprogram(name: "cast<*const u8, core::ptr::non_null::NonNull<u8>>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17h567074149d2a2063E", scope: !350, file: !348, line: 63, type: !365, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !370, retainedNodes: !369)
!365 = !DISubroutineType(types: !366)
!366 = !{!367, !368}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const core::ptr::non_null::NonNull<u8>", baseType: !87, size: 64, align: 64, dwarfAddressSpace: 0)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const *const u8", baseType: !48, size: 64, align: 64, dwarfAddressSpace: 0)
!369 = !{!362}
!370 = !{!371, !372}
!371 = !DITemplateTypeParameter(name: "T", type: !48)
!372 = !DITemplateTypeParameter(name: "U", type: !87)
!373 = !DILocation(line: 63, column: 26, scope: !363, inlinedAt: !374)
!374 = distinct !DILocation(line: 33, column: 66, scope: !275, inlinedAt: !284)
!375 = !DILocation(line: 94, column: 60, scope: !282, inlinedAt: !284)
!376 = !DILocation(line: 952, column: 33, scope: !334, inlinedAt: !342)
!377 = !DILocation(line: 957, column: 18, scope: !334, inlinedAt: !342)
!378 = !DILocation(line: 98, column: 9, scope: !286, inlinedAt: !295)
!379 = !DILocation(line: 64, column: 9, scope: !347, inlinedAt: !360)
!380 = !DILocation(line: 112, column: 5, scope: !311, inlinedAt: !320)
!381 = !DILocation(line: 118, column: 36, scope: !311, inlinedAt: !320)
!382 = !DILocation(line: 118, column: 14, scope: !311, inlinedAt: !320)
!383 = !DILocation(line: 95, column: 14, scope: !275, inlinedAt: !284)
!384 = !DILocation(line: 129, column: 9, scope: !264, inlinedAt: !273)
!385 = !DILocation(line: 54, column: 13, scope: !254)
!386 = !DILocation(line: 55, column: 18, scope: !254)
!387 = !DILocation(line: 56, column: 6, scope: !232)
!388 = distinct !DISubprogram(name: "from_residual<(), core::fmt::Error, core::fmt::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17hbdb693e96377b157E", scope: !390, file: !389, line: 1962, type: !392, scopeLine: 1962, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !445, retainedNodes: !441)
!389 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/result.rs", directory: "", checksumkind: CSK_MD5, checksum: "96c793a7caa821b2d8ecbbb7303607a6")
!390 = !DINamespace(name: "{impl#27}", scope: !391)
!391 = !DINamespace(name: "result", scope: !15)
!392 = !DISubroutineType(types: !393)
!393 = !{!394, !410, !428}
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !391, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !395, templateParams: !16, identifier: "be175170a3647a571f2129780e96e9a")
!395 = !{!396}
!396 = !DICompositeType(tag: DW_TAG_variant_part, scope: !394, file: !2, size: 8, align: 8, elements: !397, templateParams: !16, identifier: "d84fc986954f0a57cdd867f92114d31f", discriminator: !409)
!397 = !{!398, !405}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !396, file: !2, baseType: !399, size: 8, align: 8, extraData: i128 0)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !394, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !400, templateParams: !402, identifier: "8a3a859dd63bba0c896f6388bd70e8d3")
!400 = !{!401}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !399, file: !2, baseType: !7, align: 8, offset: 8, flags: DIFlagPublic)
!402 = !{!65, !403}
!403 = !DITemplateTypeParameter(name: "E", type: !404)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !133, file: !2, align: 8, flags: DIFlagPublic, elements: !16, identifier: "d17669f544649e4d3c30d94bedbae837")
!405 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !396, file: !2, baseType: !406, size: 8, align: 8, extraData: i128 1)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !394, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !407, templateParams: !402, identifier: "80756213d1517f212b3869fb72b85f03")
!407 = !{!408}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !406, file: !2, baseType: !404, align: 8, offset: 8, flags: DIFlagPublic)
!409 = !DIDerivedType(tag: DW_TAG_member, scope: !394, file: !2, baseType: !49, size: 8, align: 8, flags: DIFlagArtificial)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<core::convert::Infallible, core::fmt::Error>", scope: !391, file: !2, align: 8, flags: DIFlagPublic, elements: !411, templateParams: !16, identifier: "c17e0e09d2d1754a758b15ce148d20d")
!411 = !{!412}
!412 = !DICompositeType(tag: DW_TAG_variant_part, scope: !410, file: !2, align: 8, elements: !413, templateParams: !16, identifier: "20d73312a4973a6312763b27b04569be")
!413 = !{!414, !424}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !412, file: !2, baseType: !415, align: 8)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !410, file: !2, align: 8, flags: DIFlagPublic, elements: !416, templateParams: !422, identifier: "1024142a9ce70058ac901c34e1c345fc")
!416 = !{!417}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !415, file: !2, baseType: !418, align: 8, flags: DIFlagPublic)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "Infallible", scope: !419, file: !2, align: 8, flags: DIFlagPublic, elements: !420, templateParams: !16, identifier: "fa13d0b7c38db284bf843fd30710797a")
!419 = !DINamespace(name: "convert", scope: !15)
!420 = !{!421}
!421 = !DICompositeType(tag: DW_TAG_variant_part, scope: !418, file: !2, align: 8, elements: !16, identifier: "5ade76f3e3c84d3f8835c5b79b9ad8")
!422 = !{!423, !403}
!423 = !DITemplateTypeParameter(name: "T", type: !418)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !412, file: !2, baseType: !425, align: 8)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !410, file: !2, align: 8, flags: DIFlagPublic, elements: !426, templateParams: !422, identifier: "34d66714de63fe8d2414a5f3726fc6b9")
!426 = !{!427}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !425, file: !2, baseType: !404, align: 8, flags: DIFlagPublic)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !429, size: 64, align: 64, dwarfAddressSpace: 0)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !430, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !432, templateParams: !16, identifier: "6ab6d19db24f176957abb2edb6f58a8b")
!430 = !DINamespace(name: "location", scope: !431)
!431 = !DINamespace(name: "panic", scope: !15)
!432 = !{!433, !438, !440}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !429, file: !2, baseType: !434, size: 128, align: 64, flags: DIFlagPrivate)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !435, templateParams: !16, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!435 = !{!436, !437}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !434, file: !2, baseType: !258, size: 64, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !434, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !429, file: !2, baseType: !439, size: 32, align: 32, offset: 128, flags: DIFlagPrivate)
!439 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !429, file: !2, baseType: !439, size: 32, align: 32, offset: 160, flags: DIFlagPrivate)
!441 = !{!442, !443}
!442 = !DILocalVariable(name: "residual", arg: 1, scope: !388, file: !389, line: 1962, type: !410)
!443 = !DILocalVariable(name: "e", scope: !444, file: !389, line: 1964, type: !404, align: 1)
!444 = distinct !DILexicalBlock(scope: !388, file: !389, line: 1964, column: 13)
!445 = !{!65, !403, !446}
!446 = !DITemplateTypeParameter(name: "F", type: !404)
!447 = !DILocation(line: 1962, column: 22, scope: !388)
!448 = !DILocation(line: 1964, column: 17, scope: !444)
!449 = !DILocalVariable(name: "t", arg: 1, scope: !450, file: !451, line: 768, type: !404)
!450 = distinct !DISubprogram(name: "from<core::fmt::Error>", linkageName: "_ZN50_$LT$T$u20$as$u20$core..convert..From$LT$T$GT$$GT$4from17hfbd4428e7be988c7E", scope: !452, file: !451, line: 768, type: !453, scopeLine: 768, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !456, retainedNodes: !455)
!451 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/convert/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "c9b89024c4b3608225f6d01d745ad8ef")
!452 = !DINamespace(name: "{impl#4}", scope: !419)
!453 = !DISubroutineType(types: !454)
!454 = !{null, !404}
!455 = !{!449}
!456 = !{!457}
!457 = !DITemplateTypeParameter(name: "T", type: !404)
!458 = !DILocation(line: 768, column: 13, scope: !450, inlinedAt: !459)
!459 = distinct !DILocation(line: 1964, column: 27, scope: !444)
!460 = !DILocation(line: 1964, column: 23, scope: !444)
!461 = !DILocation(line: 1966, column: 6, scope: !388)
!462 = !{i8 0, i8 2}
!463 = distinct !DISubprogram(name: "drop<u8, alloc::alloc::Global>", linkageName: "_ZN169_$LT$$LT$alloc..collections..vec_deque..drain..Drain$LT$T$C$A$GT$$u20$as$u20$core..ops..drop..Drop$GT$..drop..DropGuard$LT$T$C$A$GT$$u20$as$u20$core..ops..drop..Drop$GT$4drop17h5b9406fc4e71904dE", scope: !465, file: !464, line: 116, type: !471, scopeLine: 116, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !103, retainedNodes: !497)
!464 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/alloc/src/collections/vec_deque/drain.rs", directory: "", checksumkind: CSK_MD5, checksum: "5d4dbba0f7e7407e6356494c0beed10f")
!465 = !DINamespace(name: "{impl#0}", scope: !466)
!466 = !DINamespace(name: "drop", scope: !467)
!467 = !DINamespace(name: "{impl#4}", scope: !468)
!468 = !DINamespace(name: "drain", scope: !469)
!469 = !DINamespace(name: "vec_deque", scope: !470)
!470 = !DINamespace(name: "collections", scope: !75)
!471 = !DISubroutineType(types: !472)
!472 = !{null, !473}
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut alloc::collections::vec_deque::drain::{impl#4}::drop::DropGuard<u8, alloc::alloc::Global>", baseType: !474, size: 64, align: 64, dwarfAddressSpace: 0)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "DropGuard<u8, alloc::alloc::Global>", scope: !466, file: !2, size: 64, align: 64, flags: DIFlagProtected, elements: !475, templateParams: !103, identifier: "444fcf3b5323c1216ebfd214061b5d98")
!475 = !{!476}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !474, file: !2, baseType: !477, size: 64, align: 64, flags: DIFlagProtected)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut alloc::collections::vec_deque::drain::Drain<u8, alloc::alloc::Global>", baseType: !478, size: 64, align: 64, dwarfAddressSpace: 0)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "Drain<u8, alloc::alloc::Global>", scope: !468, file: !2, size: 320, align: 64, flags: DIFlagPublic, elements: !479, templateParams: !103, identifier: "6a2174f5c8eb1413102026abda8e9c5c")
!479 = !{!480, !492, !493, !494, !495, !496}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "deque", scope: !478, file: !2, baseType: !481, size: 64, align: 64, flags: DIFlagPrivate)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::collections::vec_deque::VecDeque<u8, alloc::alloc::Global>>", scope: !88, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !482, templateParams: !490, identifier: "ecdca04b3a818af512553b27b0132fa2")
!482 = !{!483}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !481, file: !2, baseType: !484, size: 64, align: 64, flags: DIFlagPrivate)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::collections::vec_deque::VecDeque<u8, alloc::alloc::Global>", baseType: !485, size: 64, align: 64, dwarfAddressSpace: 0)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "VecDeque<u8, alloc::alloc::Global>", scope: !469, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !486, templateParams: !103, identifier: "43688879153c5602ef10d8de33e6c0fd")
!486 = !{!487, !488, !489}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !485, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !485, file: !2, baseType: !9, size: 64, align: 64, offset: 192, flags: DIFlagPrivate)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !485, file: !2, baseType: !78, size: 128, align: 64, flags: DIFlagPrivate)
!490 = !{!491}
!491 = !DITemplateTypeParameter(name: "T", type: !485)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "drain_len", scope: !478, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !478, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "new_len", scope: !478, file: !2, baseType: !9, size: 64, align: 64, offset: 192, flags: DIFlagPrivate)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "remaining", scope: !478, file: !2, baseType: !9, size: 64, align: 64, offset: 256, flags: DIFlagPrivate)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !478, file: !2, baseType: !246, align: 8, offset: 320, flags: DIFlagPrivate)
!497 = !{!498, !499, !505, !506, !509, !511, !513, !515}
!498 = !DILocalVariable(name: "self", arg: 1, scope: !463, file: !464, line: 116, type: !473)
!499 = !DILocalVariable(name: "front", scope: !500, file: !464, line: 120, type: !501, align: 8)
!500 = distinct !DILexicalBlock(scope: !463, file: !464, line: 120, column: 25)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "*mut [u8]", file: !2, size: 128, align: 64, elements: !502, templateParams: !16, identifier: "bd558e033735f213c244d7572860f8f0")
!502 = !{!503, !504}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !501, file: !2, baseType: !258, size: 64, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !501, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!505 = !DILocalVariable(name: "back", scope: !500, file: !464, line: 120, type: !501, align: 8)
!506 = !DILocalVariable(name: "source_deque", scope: !507, file: !464, line: 126, type: !508, align: 8)
!507 = distinct !DILexicalBlock(scope: !463, file: !464, line: 126, column: 17)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut alloc::collections::vec_deque::VecDeque<u8, alloc::alloc::Global>", baseType: !485, size: 64, align: 64, dwarfAddressSpace: 0)
!509 = !DILocalVariable(name: "drain_len", scope: !510, file: !464, line: 128, type: !9, align: 8)
!510 = distinct !DILexicalBlock(scope: !507, file: !464, line: 128, column: 17)
!511 = !DILocalVariable(name: "new_len", scope: !512, file: !464, line: 129, type: !9, align: 8)
!512 = distinct !DILexicalBlock(scope: !510, file: !464, line: 129, column: 17)
!513 = !DILocalVariable(name: "head_len", scope: !514, file: !464, line: 137, type: !9, align: 8)
!514 = distinct !DILexicalBlock(scope: !512, file: !464, line: 137, column: 17)
!515 = !DILocalVariable(name: "tail_len", scope: !516, file: !464, line: 138, type: !9, align: 8)
!516 = distinct !DILexicalBlock(scope: !514, file: !464, line: 138, column: 17)
!517 = !DILocation(line: 116, column: 21, scope: !463)
!518 = !DILocation(line: 601, column: 5, scope: !519, inlinedAt: !525)
!519 = distinct !DILexicalBlock(scope: !521, file: !520, line: 600, column: 1)
!520 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/mem/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "d294267a3d809681517fb3dfd5b38bac")
!521 = distinct !DISubprogram(name: "needs_drop<u8>", linkageName: "_ZN4core3mem10needs_drop17h7c2cce2085ecf407E", scope: !522, file: !520, line: 600, type: !523, scopeLine: 600, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !91)
!522 = !DINamespace(name: "mem", scope: !15)
!523 = !DISubroutineType(types: !524)
!524 = !{!110}
!525 = !DILocation(line: 117, column: 20, scope: !463)
!526 = !DILocation(line: 126, column: 45, scope: !463)
!527 = !{i64 8}
!528 = !DILocalVariable(name: "self", arg: 1, scope: !529, file: !324, line: 449, type: !534)
!529 = distinct !DILexicalBlock(scope: !530, file: !324, line: 449, column: 5)
!530 = distinct !DISubprogram(name: "as_mut<alloc::collections::vec_deque::VecDeque<u8, alloc::alloc::Global>>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$6as_mut17h700e891f5d643d8eE", scope: !481, file: !324, line: 449, type: !531, scopeLine: 449, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !490, declaration: !535, retainedNodes: !536)
!531 = !DISubroutineType(types: !532)
!532 = !{!533, !534}
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut alloc::collections::vec_deque::VecDeque<u8, alloc::alloc::Global>", baseType: !485, size: 64, align: 64, dwarfAddressSpace: 0)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::ptr::non_null::NonNull<alloc::collections::vec_deque::VecDeque<u8, alloc::alloc::Global>>", baseType: !481, size: 64, align: 64, dwarfAddressSpace: 0)
!535 = !DISubprogram(name: "as_mut<alloc::collections::vec_deque::VecDeque<u8, alloc::alloc::Global>>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$6as_mut17h700e891f5d643d8eE", scope: !481, file: !324, line: 449, type: !531, scopeLine: 449, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !490)
!536 = !{!528}
!537 = !DILocation(line: 449, column: 36, scope: !529, inlinedAt: !538)
!538 = !DILocation(line: 126, column: 58, scope: !463)
!539 = !DILocation(line: 452, column: 24, scope: !529, inlinedAt: !538)
!540 = !DILocalVariable(name: "self", arg: 1, scope: !541, file: !324, line: 349, type: !481)
!541 = distinct !DILexicalBlock(scope: !542, file: !324, line: 349, column: 5)
!542 = distinct !DISubprogram(name: "as_ptr<alloc::collections::vec_deque::VecDeque<u8, alloc::alloc::Global>>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$6as_ptr17hd6d75e5901bff0e9E", scope: !481, file: !324, line: 349, type: !543, scopeLine: 349, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !490, declaration: !545, retainedNodes: !546)
!543 = !DISubroutineType(types: !544)
!544 = !{!508, !481}
!545 = !DISubprogram(name: "as_ptr<alloc::collections::vec_deque::VecDeque<u8, alloc::alloc::Global>>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$6as_ptr17hd6d75e5901bff0e9E", scope: !481, file: !324, line: 349, type: !543, scopeLine: 349, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !490)
!546 = !{!540}
!547 = !DILocation(line: 349, column: 25, scope: !541, inlinedAt: !548)
!548 = !DILocation(line: 452, column: 29, scope: !529, inlinedAt: !538)
!549 = !DILocation(line: 350, column: 9, scope: !541, inlinedAt: !548)
!550 = !DILocation(line: 126, column: 21, scope: !507)
!551 = !DILocation(line: 128, column: 33, scope: !507)
!552 = !DILocation(line: 128, column: 21, scope: !510)
!553 = !DILocation(line: 129, column: 31, scope: !510)
!554 = !DILocation(line: 129, column: 21, scope: !512)
!555 = !DILocation(line: 131, column: 20, scope: !512)
!556 = !DILocation(line: 117, column: 46, scope: !463)
!557 = !DILocation(line: 1, column: 1, scope: !558)
!558 = !DILexicalBlockFile(scope: !463, file: !559, discriminator: 0)
!559 = !DIFile(filename: "src/lib.rs", directory: "/private/var/folders/m6/nyw0tbd5239gngtm06pzykr00000gn/T/.tmpPXbnuW/bytes", checksumkind: CSK_MD5, checksum: "e8e48afb078ceb7cde60f4026ae05111")
!560 = !DILocation(line: 120, column: 45, scope: !463)
!561 = !DILocation(line: 120, column: 30, scope: !463)
!562 = !DILocation(line: 120, column: 30, scope: !500)
!563 = !DILocation(line: 120, column: 37, scope: !463)
!564 = !DILocation(line: 120, column: 37, scope: !500)
!565 = !DILocation(line: 122, column: 25, scope: !500)
!566 = !DILocation(line: 137, column: 32, scope: !512)
!567 = !DILocation(line: 137, column: 21, scope: !514)
!568 = !DILocation(line: 138, column: 32, scope: !514)
!569 = !DILocation(line: 138, column: 21, scope: !516)
!570 = !DILocation(line: 190, column: 20, scope: !516)
!571 = !DILocation(line: 222, column: 20, scope: !516)
!572 = !DILocation(line: 190, column: 37, scope: !516)
!573 = !DILocation(line: 191, column: 21, scope: !516)
!574 = !DILocation(line: 190, column: 17, scope: !516)
!575 = !DILocation(line: 225, column: 21, scope: !516)
!576 = !DILocation(line: 222, column: 17, scope: !516)
!577 = !DILocation(line: 226, column: 27, scope: !516)
!578 = !DILocation(line: 230, column: 17, scope: !516)
!579 = !DILocation(line: 231, column: 14, scope: !463)
!580 = !DILocation(line: 228, column: 41, scope: !516)
!581 = !DILocation(line: 228, column: 21, scope: !516)
!582 = !DILocation(line: 226, column: 24, scope: !516)
!583 = !DILocation(line: 133, column: 21, scope: !512)
!584 = distinct !DISubprogram(name: "join_head_and_tail_wrapping<u8, alloc::alloc::Global>", linkageName: "_ZN169_$LT$$LT$alloc..collections..vec_deque..drain..Drain$LT$T$C$A$GT$$u20$as$u20$core..ops..drop..Drop$GT$..drop..DropGuard$LT$T$C$A$GT$$u20$as$u20$core..ops..drop..Drop$GT$4drop27join_head_and_tail_wrapping17h8260f3c4a5de3c34E", scope: !585, file: !464, line: 198, type: !586, scopeLine: 198, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !103, retainedNodes: !588)
!585 = !DINamespace(name: "drop", scope: !465)
!586 = !DISubroutineType(types: !587)
!587 = !{null, !533, !9, !9, !9}
!588 = !{!589, !590, !591, !592, !593, !595, !596}
!589 = !DILocalVariable(name: "source_deque", arg: 1, scope: !584, file: !464, line: 199, type: !533)
!590 = !DILocalVariable(name: "drain_len", arg: 2, scope: !584, file: !464, line: 200, type: !9)
!591 = !DILocalVariable(name: "head_len", arg: 3, scope: !584, file: !464, line: 201, type: !9)
!592 = !DILocalVariable(name: "tail_len", arg: 4, scope: !584, file: !464, line: 202, type: !9)
!593 = !DILocalVariable(name: "src", scope: !594, file: !464, line: 205, type: !9, align: 8)
!594 = distinct !DILexicalBlock(scope: !584, file: !464, line: 205, column: 25)
!595 = !DILocalVariable(name: "dst", scope: !594, file: !464, line: 205, type: !9, align: 8)
!596 = !DILocalVariable(name: "len", scope: !594, file: !464, line: 205, type: !9, align: 8)
!597 = !DILocation(line: 199, column: 25, scope: !584)
!598 = !DILocation(line: 200, column: 25, scope: !584)
!599 = !DILocation(line: 201, column: 25, scope: !584)
!600 = !DILocation(line: 202, column: 25, scope: !584)
!601 = !DILocation(line: 205, column: 30, scope: !594)
!602 = !DILocation(line: 205, column: 35, scope: !594)
!603 = !DILocation(line: 205, column: 40, scope: !594)
!604 = !DILocation(line: 206, column: 28, scope: !594)
!605 = !DILocation(line: 211, column: 64, scope: !594)
!606 = !DILocation(line: 211, column: 35, scope: !594)
!607 = !DILocation(line: 211, column: 29, scope: !594)
!608 = !DILocation(line: 212, column: 35, scope: !594)
!609 = !DILocation(line: 212, column: 29, scope: !594)
!610 = !DILocation(line: 213, column: 29, scope: !594)
!611 = !DILocation(line: 206, column: 25, scope: !594)
!612 = !DILocation(line: 207, column: 35, scope: !594)
!613 = !DILocation(line: 207, column: 29, scope: !594)
!614 = !DILocation(line: 208, column: 35, scope: !594)
!615 = !DILocation(line: 208, column: 29, scope: !594)
!616 = !DILocation(line: 209, column: 29, scope: !594)
!617 = !DILocation(line: 217, column: 52, scope: !594)
!618 = !DILocation(line: 217, column: 57, scope: !594)
!619 = !DILocation(line: 217, column: 62, scope: !594)
!620 = !DILocation(line: 217, column: 29, scope: !594)
!621 = !DILocation(line: 219, column: 22, scope: !584)
!622 = distinct !DISubprogram(name: "fmt<usize>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h6b1bcb3aaf29a5b5E", scope: !624, file: !623, line: 2333, type: !625, scopeLine: 2333, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !643, retainedNodes: !662)
!623 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "fb126a293888f279de993e69d2771a11")
!624 = !DINamespace(name: "{impl#51}", scope: !133)
!625 = !DISubroutineType(types: !626)
!626 = !{!394, !627, !628}
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&usize", baseType: !25, size: 64, align: 64, dwarfAddressSpace: 0)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !629, size: 64, align: 64, dwarfAddressSpace: 0)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !133, file: !2, size: 512, align: 64, flags: DIFlagPublic, elements: !630, templateParams: !16, identifier: "220d4d9789115bc6b80d4c98d9cf69c5")
!630 = !{!631, !632, !634, !635, !650, !651}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !629, file: !2, baseType: !439, size: 32, align: 32, offset: 416, flags: DIFlagPrivate)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !629, file: !2, baseType: !633, size: 32, align: 32, offset: 384, flags: DIFlagPrivate)
!633 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !629, file: !2, baseType: !131, size: 8, align: 8, offset: 448, flags: DIFlagPrivate)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !629, file: !2, baseType: !636, size: 128, align: 64, flags: DIFlagPrivate)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !637, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !638, templateParams: !16, identifier: "95187db8a945f0b837c05a93dbca053d")
!637 = !DINamespace(name: "option", scope: !15)
!638 = !{!639}
!639 = !DICompositeType(tag: DW_TAG_variant_part, scope: !636, file: !2, size: 128, align: 64, elements: !640, templateParams: !16, identifier: "bf03ad1423ace5c017f1cefbab0a44f7", discriminator: !649)
!640 = !{!641, !645}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !639, file: !2, baseType: !642, size: 128, align: 64, extraData: i128 0)
!642 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !636, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !16, templateParams: !643, identifier: "28c1259e655b5c63dfdc8863b3b586eb")
!643 = !{!644}
!644 = !DITemplateTypeParameter(name: "T", type: !9)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !639, file: !2, baseType: !646, size: 128, align: 64, extraData: i128 1)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !636, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !647, templateParams: !643, identifier: "455fdfcabbfecd5a717255e285761794")
!647 = !{!648}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !646, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!649 = !DIDerivedType(tag: DW_TAG_member, scope: !636, file: !2, baseType: !155, size: 64, align: 64, flags: DIFlagArtificial)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !629, file: !2, baseType: !636, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !629, file: !2, baseType: !652, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !653, templateParams: !16, identifier: "94f817b1adbb3ab96b0635104fb3fde3")
!653 = !{!654, !657}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !652, file: !2, baseType: !655, size: 64, align: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64, align: 64, dwarfAddressSpace: 0)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !16, identifier: "72805e6673b6ad52ecf81cbad56f4147")
!657 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !652, file: !2, baseType: !658, size: 64, align: 64, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !659, size: 64, align: 64, dwarfAddressSpace: 0)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !660)
!660 = !{!661}
!661 = !DISubrange(count: 3, lowerBound: 0)
!662 = !{!663, !664}
!663 = !DILocalVariable(name: "self", arg: 1, scope: !622, file: !623, line: 2333, type: !627)
!664 = !DILocalVariable(name: "f", arg: 2, scope: !622, file: !623, line: 2333, type: !628)
!665 = !DILocation(line: 2333, column: 20, scope: !622)
!666 = !DILocation(line: 2333, column: 27, scope: !622)
!667 = !DILocation(line: 2333, column: 71, scope: !622)
!668 = !DILocation(line: 2333, column: 62, scope: !622)
!669 = !DILocation(line: 2333, column: 84, scope: !622)
!670 = distinct !DISubprogram(name: "compare", linkageName: "_ZN49_$LT$u8$u20$as$u20$core..slice..cmp..SliceOrd$GT$7compare17h2020e9639943a95eE", scope: !672, file: !671, line: 191, type: !674, scopeLine: 191, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !16, retainedNodes: !676)
!671 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/slice/cmp.rs", directory: "", checksumkind: CSK_MD5, checksum: "b178c75ea207144abbac5f5da75b331e")
!672 = !DINamespace(name: "{impl#9}", scope: !673)
!673 = !DINamespace(name: "cmp", scope: !241)
!674 = !DISubroutineType(types: !675)
!675 = !{!139, !255, !255}
!676 = !{!677, !678, !679, !682, !684}
!677 = !DILocalVariable(name: "left", arg: 1, scope: !670, file: !671, line: 191, type: !255)
!678 = !DILocalVariable(name: "right", arg: 2, scope: !670, file: !671, line: 191, type: !255)
!679 = !DILocalVariable(name: "diff", scope: !680, file: !671, line: 193, type: !681, align: 8)
!680 = distinct !DILexicalBlock(scope: !670, file: !671, line: 193, column: 9)
!681 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!682 = !DILocalVariable(name: "len", scope: !683, file: !671, line: 195, type: !9, align: 8)
!683 = distinct !DILexicalBlock(scope: !680, file: !671, line: 195, column: 9)
!684 = !DILocalVariable(name: "order", scope: !685, file: !671, line: 199, type: !681, align: 8)
!685 = distinct !DILexicalBlock(scope: !683, file: !671, line: 199, column: 9)
!686 = !DILocation(line: 1617, column: 5, scope: !687, inlinedAt: !698)
!687 = distinct !DILexicalBlock(scope: !689, file: !688, line: 1565, column: 17)
!688 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/cmp.rs", directory: "", checksumkind: CSK_MD5, checksum: "a92d0ff535cd882f49f92c6340fed1e4")
!689 = distinct !DISubprogram(name: "cmp", linkageName: "_ZN4core3cmp5impls50_$LT$impl$u20$core..cmp..Ord$u20$for$u20$isize$GT$3cmp17h88892b65ffb6c69aE", scope: !690, file: !688, line: 1565, type: !692, scopeLine: 1565, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !16, retainedNodes: !695)
!690 = !DINamespace(name: "{impl#67}", scope: !691)
!691 = !DINamespace(name: "impls", scope: !140)
!692 = !DISubroutineType(types: !693)
!693 = !{!139, !694, !694}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&isize", baseType: !681, size: 64, align: 64, dwarfAddressSpace: 0)
!695 = !{!696, !697}
!696 = !DILocalVariable(name: "self", arg: 1, scope: !687, file: !688, line: 1617, type: !694)
!697 = !DILocalVariable(name: "other", scope: !687, file: !688, line: 1617, type: !694, align: 8)
!698 = !DILocation(line: 203, column: 15, scope: !685)
!699 = !DILocation(line: 191, column: 16, scope: !670)
!700 = !DILocalVariable(name: "self", arg: 1, scope: !701, file: !702, line: 762, type: !255)
!701 = distinct !DILexicalBlock(scope: !703, file: !702, line: 762, column: 5)
!702 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/slice/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "bd645d242e429a8f9550dabdf674e92b")
!703 = distinct !DISubprogram(name: "as_ptr<u8>", linkageName: "_ZN4core5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$6as_ptr17h6b88ef7e6c429d0aE", scope: !704, file: !702, line: 762, type: !705, scopeLine: 762, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !91, retainedNodes: !707)
!704 = !DINamespace(name: "{impl#0}", scope: !241)
!705 = !DISubroutineType(types: !706)
!706 = !{!48, !255}
!707 = !{!700, !708}
!708 = !DILocalVariable(name: "self", arg: 1, scope: !709, file: !702, line: 762, type: !255)
!709 = distinct !DILexicalBlock(scope: !703, file: !702, line: 762, column: 5)
!710 = !DILocation(line: 762, column: 25, scope: !701, inlinedAt: !711)
!711 = !DILocation(line: 199, column: 53, scope: !683)
!712 = !DILocation(line: 191, column: 31, scope: !670)
!713 = !DILocation(line: 762, column: 25, scope: !709, inlinedAt: !714)
!714 = !DILocation(line: 199, column: 69, scope: !683)
!715 = !DILocation(line: 195, column: 13, scope: !683)
!716 = !DILocation(line: 199, column: 13, scope: !685)
!717 = !DILocation(line: 193, column: 20, scope: !670)
!718 = !DILocation(line: 193, column: 13, scope: !680)
!719 = !DILocation(line: 195, column: 22, scope: !680)
!720 = !DILocation(line: 195, column: 69, scope: !680)
!721 = !DILocation(line: 195, column: 19, scope: !680)
!722 = !DILocation(line: 195, column: 49, scope: !680)
!723 = !DILocation(line: 199, column: 79, scope: !683)
!724 = !DILocation(line: 199, column: 34, scope: !683)
!725 = !DILocation(line: 200, column: 12, scope: !685)
!726 = !DILocation(line: 201, column: 13, scope: !685)
!727 = !DILocation(line: 200, column: 9, scope: !685)
!728 = !DILocation(line: 203, column: 9, scope: !685)
!729 = !DILocation(line: 204, column: 6, scope: !670)
!730 = !{i8 -1, i8 2}
!731 = distinct !DISubprogram(name: "precondition_check", linkageName: "_ZN4core10intrinsics11write_bytes18precondition_check17h30a50553496628c5E", scope: !733, file: !732, line: 2764, type: !735, scopeLine: 2764, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !16, retainedNodes: !737)
!732 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "8e44aa294dd7cc4c037d8b6ff42222a3")
!733 = !DINamespace(name: "write_bytes", scope: !734)
!734 = !DINamespace(name: "intrinsics", scope: !15)
!735 = !DISubroutineType(types: !736)
!736 = !{null, !6, !9}
!737 = !{!738, !739}
!738 = !DILocalVariable(name: "addr", arg: 1, scope: !731, file: !732, line: 2764, type: !6)
!739 = !DILocalVariable(name: "align", arg: 2, scope: !731, file: !732, line: 2764, type: !9)
!740 = !DILocation(line: 2764, column: 37, scope: !731)
!741 = !DILocation(line: 3098, column: 18, scope: !731)
!742 = !DILocation(line: 2764, column: 13, scope: !731)
!743 = !DILocation(line: 2766, column: 21, scope: !731)
!744 = !DILocation(line: 2770, column: 14, scope: !731)
!745 = distinct !DISubprogram(name: "is_nonoverlapping", linkageName: "_ZN4core10intrinsics17is_nonoverlapping17h2f6533ec4683b2e8E", scope: !734, file: !732, line: 2797, type: !746, scopeLine: 2797, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !16, retainedNodes: !748)
!746 = !DISubroutineType(types: !747)
!747 = !{!110, !6, !6, !9, !9}
!748 = !{!749, !750, !751, !752, !753, !755, !757, !759}
!749 = !DILocalVariable(name: "src", arg: 1, scope: !745, file: !732, line: 2797, type: !6)
!750 = !DILocalVariable(name: "dst", arg: 2, scope: !745, file: !732, line: 2797, type: !6)
!751 = !DILocalVariable(name: "size", arg: 3, scope: !745, file: !732, line: 2797, type: !9)
!752 = !DILocalVariable(name: "count", arg: 4, scope: !745, file: !732, line: 2797, type: !9)
!753 = !DILocalVariable(name: "src_usize", scope: !754, file: !732, line: 2798, type: !9, align: 8)
!754 = distinct !DILexicalBlock(scope: !745, file: !732, line: 2798, column: 5)
!755 = !DILocalVariable(name: "dst_usize", scope: !756, file: !732, line: 2799, type: !9, align: 8)
!756 = distinct !DILexicalBlock(scope: !754, file: !732, line: 2799, column: 5)
!757 = !DILocalVariable(name: "size", scope: !758, file: !732, line: 2800, type: !9, align: 8)
!758 = distinct !DILexicalBlock(scope: !756, file: !732, line: 2800, column: 5)
!759 = !DILocalVariable(name: "diff", scope: !760, file: !732, line: 2805, type: !9, align: 8)
!760 = distinct !DILexicalBlock(scope: !758, file: !732, line: 2805, column: 5)
!761 = !DILocation(line: 2797, column: 33, scope: !745)
!762 = !DILocalVariable(name: "self", arg: 1, scope: !763, file: !348, line: 209, type: !6)
!763 = distinct !DILexicalBlock(scope: !764, file: !348, line: 209, column: 5)
!764 = distinct !DISubprogram(name: "addr<()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4addr17h579fd94c046af06cE", scope: !350, file: !348, line: 209, type: !765, scopeLine: 209, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !64, retainedNodes: !767)
!765 = !DISubroutineType(types: !766)
!766 = !{!9, !6}
!767 = !{!762, !768}
!768 = !DILocalVariable(name: "self", arg: 1, scope: !769, file: !348, line: 209, type: !6)
!769 = distinct !DILexicalBlock(scope: !764, file: !348, line: 209, column: 5)
!770 = !DILocation(line: 209, column: 17, scope: !763, inlinedAt: !771)
!771 = !DILocation(line: 2798, column: 25, scope: !745)
!772 = !DILocalVariable(name: "self", arg: 1, scope: !773, file: !348, line: 63, type: !6)
!773 = distinct !DILexicalBlock(scope: !774, file: !348, line: 63, column: 5)
!774 = distinct !DISubprogram(name: "cast<(), ()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17h55927b0f0446057cE", scope: !350, file: !348, line: 63, type: !775, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !780, retainedNodes: !777)
!775 = !DISubroutineType(types: !776)
!776 = !{!6, !6}
!777 = !{!772, !778}
!778 = !DILocalVariable(name: "self", arg: 1, scope: !779, file: !348, line: 63, type: !6)
!779 = distinct !DILexicalBlock(scope: !774, file: !348, line: 63, column: 5)
!780 = !{!65, !358}
!781 = !DILocation(line: 63, column: 26, scope: !773, inlinedAt: !782)
!782 = !DILocation(line: 213, column: 38, scope: !763, inlinedAt: !771)
!783 = !DILocation(line: 2797, column: 49, scope: !745)
!784 = !DILocation(line: 209, column: 17, scope: !769, inlinedAt: !785)
!785 = !DILocation(line: 2799, column: 25, scope: !754)
!786 = !DILocation(line: 63, column: 26, scope: !779, inlinedAt: !787)
!787 = !DILocation(line: 213, column: 38, scope: !769, inlinedAt: !785)
!788 = !DILocation(line: 2797, column: 65, scope: !745)
!789 = !DILocalVariable(name: "self", arg: 1, scope: !790, file: !791, line: 1281, type: !9)
!790 = !DILexicalBlockFile(scope: !792, file: !791, discriminator: 0)
!791 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/num/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "03eb9371ac6ef6f22725c194b88148fe")
!792 = distinct !DILexicalBlock(scope: !794, file: !793, line: 686, column: 9)
!793 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/num/uint_macros.rs", directory: "", checksumkind: CSK_MD5, checksum: "278bd6ca98d30809003b0b6c02c39a08")
!794 = distinct !DISubprogram(name: "checked_mul", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$11checked_mul17h350c107311946e21E", scope: !795, file: !793, line: 686, type: !797, scopeLine: 686, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !16, retainedNodes: !799)
!795 = !DINamespace(name: "{impl#11}", scope: !796)
!796 = !DINamespace(name: "num", scope: !15)
!797 = !DISubroutineType(types: !798)
!798 = !{!636, !9, !9}
!799 = !{!789, !800, !801, !804}
!800 = !DILocalVariable(name: "rhs", arg: 2, scope: !790, file: !791, line: 1281, type: !9)
!801 = !DILocalVariable(name: "a", scope: !802, file: !791, line: 1281, type: !9, align: 8)
!802 = !DILexicalBlockFile(scope: !803, file: !791, discriminator: 0)
!803 = distinct !DILexicalBlock(scope: !792, file: !793, line: 687, column: 13)
!804 = !DILocalVariable(name: "b", scope: !802, file: !791, line: 1281, type: !110, align: 1)
!805 = !DILocation(line: 1281, column: 5, scope: !790, inlinedAt: !806)
!806 = !DILocation(line: 2800, column: 27, scope: !756)
!807 = !DILocalVariable(name: "self", arg: 1, scope: !808, file: !791, line: 1281, type: !9)
!808 = !DILexicalBlockFile(scope: !809, file: !791, discriminator: 0)
!809 = distinct !DILexicalBlock(scope: !810, file: !793, line: 2173, column: 9)
!810 = distinct !DISubprogram(name: "overflowing_mul", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$15overflowing_mul17hc655572562d2e056E", scope: !795, file: !793, line: 2173, type: !811, scopeLine: 2173, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !16, retainedNodes: !817)
!811 = !DISubroutineType(types: !812)
!812 = !{!813, !9, !9}
!813 = !DICompositeType(tag: DW_TAG_structure_type, name: "(usize, bool)", file: !2, size: 128, align: 64, elements: !814, templateParams: !16, identifier: "4030f8452435be378048c6d8b59c8539")
!814 = !{!815, !816}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !813, file: !2, baseType: !9, size: 64, align: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !813, file: !2, baseType: !110, size: 8, align: 8, offset: 64)
!817 = !{!807, !818, !819, !822}
!818 = !DILocalVariable(name: "rhs", arg: 2, scope: !808, file: !791, line: 1281, type: !9)
!819 = !DILocalVariable(name: "a", scope: !820, file: !791, line: 1281, type: !155, align: 8)
!820 = !DILexicalBlockFile(scope: !821, file: !791, discriminator: 0)
!821 = distinct !DILexicalBlock(scope: !809, file: !793, line: 2174, column: 13)
!822 = !DILocalVariable(name: "b", scope: !820, file: !791, line: 1281, type: !110, align: 1)
!823 = !DILocation(line: 1281, column: 5, scope: !808, inlinedAt: !824)
!824 = !DILocation(line: 687, column: 31, scope: !792, inlinedAt: !806)
!825 = !DILocation(line: 2797, column: 78, scope: !745)
!826 = !DILocation(line: 2805, column: 9, scope: !760)
!827 = !DILocation(line: 213, column: 18, scope: !763, inlinedAt: !771)
!828 = !DILocation(line: 2798, column: 9, scope: !754)
!829 = !DILocalVariable(name: "self", arg: 1, scope: !830, file: !791, line: 1281, type: !9)
!830 = !DILexicalBlockFile(scope: !831, file: !791, discriminator: 0)
!831 = distinct !DILexicalBlock(scope: !832, file: !793, line: 2137, column: 9)
!832 = distinct !DISubprogram(name: "abs_diff", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$8abs_diff17h787023a27d1b9e54E", scope: !795, file: !793, line: 2137, type: !833, scopeLine: 2137, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !16, retainedNodes: !835)
!833 = !DISubroutineType(types: !834)
!834 = !{!9, !9, !9}
!835 = !{!829, !836}
!836 = !DILocalVariable(name: "other", arg: 2, scope: !830, file: !791, line: 1281, type: !9)
!837 = !DILocation(line: 1281, column: 5, scope: !830, inlinedAt: !838)
!838 = !DILocation(line: 2805, column: 26, scope: !758)
!839 = !DILocation(line: 213, column: 18, scope: !769, inlinedAt: !785)
!840 = !DILocation(line: 2799, column: 9, scope: !756)
!841 = !DILocation(line: 1281, column: 5, scope: !820, inlinedAt: !824)
!842 = !DILocation(line: 1281, column: 5, scope: !802, inlinedAt: !806)
!843 = !DILocation(line: 2800, column: 14, scope: !756)
!844 = !DILocation(line: 2800, column: 14, scope: !758)
!845 = !DILocation(line: 2801, column: 9, scope: !756)
!846 = !DILocation(line: 2808, column: 5, scope: !760)
!847 = !DILocation(line: 2809, column: 2, scope: !745)
!848 = distinct !DISubprogram(name: "precondition_check", linkageName: "_ZN4core10intrinsics19copy_nonoverlapping18precondition_check17h53c7bbaa28bed0feE", scope: !849, file: !732, line: 2764, type: !850, scopeLine: 2764, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !16, retainedNodes: !852)
!849 = !DINamespace(name: "copy_nonoverlapping", scope: !734)
!850 = !DISubroutineType(types: !851)
!851 = !{null, !6, !61, !9, !9, !9}
!852 = !{!853, !854, !855, !856, !857}
!853 = !DILocalVariable(name: "src", arg: 1, scope: !848, file: !732, line: 2764, type: !6)
!854 = !DILocalVariable(name: "dst", arg: 2, scope: !848, file: !732, line: 2764, type: !61)
!855 = !DILocalVariable(name: "size", arg: 3, scope: !848, file: !732, line: 2764, type: !9)
!856 = !DILocalVariable(name: "align", arg: 4, scope: !848, file: !732, line: 2764, type: !9)
!857 = !DILocalVariable(name: "count", arg: 5, scope: !848, file: !732, line: 2764, type: !9)
!858 = !DILocation(line: 2764, column: 37, scope: !848)
!859 = !DILocation(line: 2922, column: 13, scope: !848)
!860 = !DILocation(line: 2764, column: 13, scope: !848)
!861 = !DILocation(line: 2766, column: 21, scope: !848)
!862 = !DILocation(line: 2923, column: 20, scope: !848)
!863 = !DILocation(line: 2924, column: 20, scope: !848)
!864 = !DILocation(line: 2770, column: 14, scope: !848)
!865 = distinct !DISubprogram(name: "is_aligned_and_not_null", linkageName: "_ZN4core10intrinsics23is_aligned_and_not_null17h75524cf5e835e5f8E", scope: !734, file: !732, line: 2784, type: !866, scopeLine: 2784, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !16, retainedNodes: !868)
!866 = !DISubroutineType(types: !867)
!867 = !{!110, !6, !9}
!868 = !{!869, !870}
!869 = !DILocalVariable(name: "ptr", arg: 1, scope: !865, file: !732, line: 2784, type: !6)
!870 = !DILocalVariable(name: "align", arg: 2, scope: !865, file: !732, line: 2784, type: !9)
!871 = !DILocation(line: 2784, column: 39, scope: !865)
!872 = !DILocalVariable(name: "self", arg: 1, scope: !873, file: !348, line: 35, type: !6)
!873 = distinct !DILexicalBlock(scope: !874, file: !348, line: 35, column: 5)
!874 = distinct !DISubprogram(name: "is_null<()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$7is_null17h03092b320ec7a1bcE", scope: !350, file: !348, line: 35, type: !875, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !64, retainedNodes: !877)
!875 = !DISubroutineType(types: !876)
!876 = !{!110, !6}
!877 = !{!872}
!878 = !DILocation(line: 35, column: 26, scope: !873, inlinedAt: !879)
!879 = !DILocation(line: 2785, column: 10, scope: !865)
!880 = !DILocalVariable(name: "self", arg: 1, scope: !881, file: !348, line: 1618, type: !6)
!881 = distinct !DILexicalBlock(scope: !882, file: !348, line: 1618, column: 5)
!882 = distinct !DISubprogram(name: "is_aligned_to<()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$13is_aligned_to17h33ec563ed6a5f3c6E", scope: !350, file: !348, line: 1618, type: !866, scopeLine: 1618, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !64, retainedNodes: !883)
!883 = !{!880, !884}
!884 = !DILocalVariable(name: "align", arg: 2, scope: !881, file: !348, line: 1618, type: !9)
!885 = !DILocation(line: 1618, column: 32, scope: !881, inlinedAt: !886)
!886 = !DILocation(line: 2785, column: 27, scope: !865)
!887 = !DILocalVariable(name: "self", arg: 1, scope: !888, file: !348, line: 63, type: !6)
!888 = distinct !DILexicalBlock(scope: !889, file: !348, line: 63, column: 5)
!889 = distinct !DISubprogram(name: "cast<(), ()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17h55927b0f0446057cE", scope: !350, file: !348, line: 63, type: !775, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !780, retainedNodes: !890)
!890 = !{!887, !891}
!891 = !DILocalVariable(name: "self", arg: 1, scope: !892, file: !348, line: 63, type: !6)
!892 = distinct !DILexicalBlock(scope: !889, file: !348, line: 63, column: 5)
!893 = !DILocation(line: 63, column: 26, scope: !888, inlinedAt: !894)
!894 = !DILocation(line: 1640, column: 37, scope: !881, inlinedAt: !886)
!895 = !DILocalVariable(name: "ptr", arg: 1, scope: !896, file: !348, line: 1624, type: !6)
!896 = distinct !DILexicalBlock(scope: !897, file: !348, line: 1624, column: 9)
!897 = distinct !DISubprogram(name: "runtime_impl", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$13is_aligned_to12runtime_impl17he87992649de3d1afE", scope: !898, file: !348, line: 1624, type: !866, scopeLine: 1624, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !16, retainedNodes: !899)
!898 = !DINamespace(name: "is_aligned_to", scope: !350)
!899 = !{!895, !900}
!900 = !DILocalVariable(name: "align", arg: 2, scope: !896, file: !348, line: 1624, type: !9)
!901 = !DILocation(line: 1624, column: 25, scope: !896, inlinedAt: !902)
!902 = !DILocation(line: 1640, column: 13, scope: !881, inlinedAt: !886)
!903 = !DILocalVariable(name: "self", arg: 1, scope: !904, file: !348, line: 209, type: !6)
!904 = distinct !DILexicalBlock(scope: !905, file: !348, line: 209, column: 5)
!905 = distinct !DISubprogram(name: "addr<()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4addr17h579fd94c046af06cE", scope: !350, file: !348, line: 209, type: !765, scopeLine: 209, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !64, retainedNodes: !906)
!906 = !{!903}
!907 = !DILocation(line: 209, column: 17, scope: !904, inlinedAt: !908)
!908 = !DILocation(line: 1625, column: 17, scope: !896, inlinedAt: !902)
!909 = !DILocation(line: 63, column: 26, scope: !892, inlinedAt: !910)
!910 = !DILocation(line: 213, column: 38, scope: !904, inlinedAt: !908)
!911 = !DILocation(line: 2784, column: 55, scope: !865)
!912 = !DILocation(line: 1618, column: 38, scope: !881, inlinedAt: !886)
!913 = !DILocalVariable(name: "self", arg: 1, scope: !914, file: !791, line: 1281, type: !9)
!914 = !DILexicalBlockFile(scope: !915, file: !791, discriminator: 0)
!915 = distinct !DILexicalBlock(scope: !916, file: !793, line: 2689, column: 9)
!916 = distinct !DISubprogram(name: "is_power_of_two", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$15is_power_of_two17hf984871fa0afca14E", scope: !795, file: !793, line: 2689, type: !917, scopeLine: 2689, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !16, retainedNodes: !919)
!917 = !DISubroutineType(types: !918)
!918 = !{!110, !9}
!919 = !{!913}
!920 = !DILocation(line: 1281, column: 5, scope: !914, inlinedAt: !921)
!921 = !DILocation(line: 1619, column: 19, scope: !881, inlinedAt: !886)
!922 = !DILocalVariable(name: "self", arg: 1, scope: !923, file: !791, line: 1281, type: !9)
!923 = !DILexicalBlockFile(scope: !924, file: !791, discriminator: 0)
!924 = distinct !DILexicalBlock(scope: !925, file: !793, line: 106, column: 9)
!925 = distinct !DISubprogram(name: "count_ones", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$10count_ones17hce199ea15231247aE", scope: !795, file: !793, line: 106, type: !926, scopeLine: 106, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !16, retainedNodes: !928)
!926 = !DISubroutineType(types: !927)
!927 = !{!439, !9}
!928 = !{!922}
!929 = !DILocation(line: 1281, column: 5, scope: !923, inlinedAt: !930)
!930 = !DILocation(line: 2690, column: 18, scope: !915, inlinedAt: !921)
!931 = !DILocation(line: 1624, column: 41, scope: !896, inlinedAt: !902)
!932 = !DILocation(line: 54, column: 32, scope: !873, inlinedAt: !879)
!933 = !DILocalVariable(name: "ptr", arg: 1, scope: !934, file: !348, line: 37, type: !48)
!934 = distinct !DILexicalBlock(scope: !935, file: !348, line: 37, column: 9)
!935 = distinct !DISubprogram(name: "runtime_impl", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$7is_null12runtime_impl17h162570f576d92ee0E", scope: !936, file: !348, line: 37, type: !937, scopeLine: 37, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !16, retainedNodes: !939)
!936 = !DINamespace(name: "is_null", scope: !350)
!937 = !DISubroutineType(types: !938)
!938 = !{!110, !48}
!939 = !{!933}
!940 = !DILocation(line: 37, column: 25, scope: !934, inlinedAt: !941)
!941 = !DILocation(line: 54, column: 13, scope: !873, inlinedAt: !879)
!942 = !DILocalVariable(name: "self", arg: 1, scope: !943, file: !348, line: 209, type: !48)
!943 = distinct !DILexicalBlock(scope: !944, file: !348, line: 209, column: 5)
!944 = distinct !DISubprogram(name: "addr<u8>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4addr17h785f2bc6a9e1d3afE", scope: !350, file: !348, line: 209, type: !945, scopeLine: 209, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !91, retainedNodes: !947)
!945 = !DISubroutineType(types: !946)
!946 = !{!9, !48}
!947 = !{!942}
!948 = !DILocation(line: 209, column: 17, scope: !943, inlinedAt: !949)
!949 = !DILocation(line: 38, column: 17, scope: !934, inlinedAt: !941)
!950 = !DILocalVariable(name: "self", arg: 1, scope: !951, file: !348, line: 63, type: !48)
!951 = distinct !DILexicalBlock(scope: !952, file: !348, line: 63, column: 5)
!952 = distinct !DISubprogram(name: "cast<u8, ()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17h8dea2cf67aa7b346E", scope: !350, file: !348, line: 63, type: !352, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !357, retainedNodes: !953)
!953 = !{!950}
!954 = !DILocation(line: 63, column: 26, scope: !951, inlinedAt: !955)
!955 = !DILocation(line: 213, column: 38, scope: !943, inlinedAt: !949)
!956 = !DILocation(line: 213, column: 18, scope: !943, inlinedAt: !949)
!957 = !DILocation(line: 2785, column: 6, scope: !865)
!958 = !DILocation(line: 2785, column: 5, scope: !865)
!959 = !DILocation(line: 1619, column: 13, scope: !881, inlinedAt: !886)
!960 = !DILocation(line: 2786, column: 2, scope: !865)
!961 = !DILocation(line: 1625, column: 26, scope: !896, inlinedAt: !902)
!962 = !DILocation(line: 1625, column: 13, scope: !896, inlinedAt: !902)
!963 = !DILocation(line: 1620, column: 20, scope: !881, inlinedAt: !886)
!964 = !DILocalVariable(name: "pieces", arg: 1, scope: !965, file: !623, line: 329, type: !970)
!965 = distinct !DILexicalBlock(scope: !966, file: !623, line: 329, column: 5)
!966 = distinct !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17hd85e94d977d0da7cE", scope: !967, file: !623, line: 329, type: !1033, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !128, templateParams: !16, declaration: !1035, retainedNodes: !1036)
!967 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !133, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !968, templateParams: !16, identifier: "f5a94cea047ca3dea35120609d07d08d")
!968 = !{!969, !975, !1017}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !967, file: !2, baseType: !970, size: 128, align: 64, flags: DIFlagPrivate)
!970 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !971, templateParams: !16, identifier: "d76b83877ddcb5cca61caf6bdca727ac")
!971 = !{!972, !974}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !970, file: !2, baseType: !973, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64, align: 64, dwarfAddressSpace: 0)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !970, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !967, file: !2, baseType: !976, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!976 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !637, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !977, templateParams: !16, identifier: "676f3d473eca9d85e7b8651af934444b")
!977 = !{!978}
!978 = !DICompositeType(tag: DW_TAG_variant_part, scope: !976, file: !2, size: 128, align: 64, elements: !979, templateParams: !16, identifier: "bfd14ac579232dd88fd2b0d1ad576493", discriminator: !1016)
!979 = !{!980, !1012}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !978, file: !2, baseType: !981, size: 128, align: 64, extraData: i128 0)
!981 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !976, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !16, templateParams: !982, identifier: "5cf1cdc1741ffabf116481b417e76678")
!982 = !{!983}
!983 = !DITemplateTypeParameter(name: "T", type: !984)
!984 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !2, size: 128, align: 64, elements: !985, templateParams: !16, identifier: "335f0a904b053f61c731d86311ceff8c")
!985 = !{!986, !1011}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !984, file: !2, baseType: !987, size: 64, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64, dwarfAddressSpace: 0)
!988 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !132, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !989, templateParams: !16, identifier: "f4039c5a35e0fee7484a39b4635b170f")
!989 = !{!990, !991, !992, !993, !994, !1010}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !988, file: !2, baseType: !9, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !988, file: !2, baseType: !633, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !988, file: !2, baseType: !131, size: 8, align: 8, offset: 384, flags: DIFlagPublic)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !988, file: !2, baseType: !439, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !988, file: !2, baseType: !995, size: 128, align: 64, flags: DIFlagPublic)
!995 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !132, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !996, templateParams: !16, identifier: "2ae93a82e88590f730796e48e70a07a7")
!996 = !{!997}
!997 = !DICompositeType(tag: DW_TAG_variant_part, scope: !995, file: !2, size: 128, align: 64, elements: !998, templateParams: !16, identifier: "c67f77b46946c26a4aac980956de48d6", discriminator: !1009)
!998 = !{!999, !1003, !1007}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !997, file: !2, baseType: !1000, size: 128, align: 64, extraData: i128 0)
!1000 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !995, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !1001, templateParams: !16, identifier: "383bd1cd71fc68e2ba1c3f7e48543eff")
!1001 = !{!1002}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1000, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !997, file: !2, baseType: !1004, size: 128, align: 64, extraData: i128 1)
!1004 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !995, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !1005, templateParams: !16, identifier: "ec135ad2d61c9b7e82d9f77c7d2136ad")
!1005 = !{!1006}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1004, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !997, file: !2, baseType: !1008, size: 128, align: 64, extraData: i128 2)
!1008 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !995, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !16, identifier: "163729ef05b181fe4923856687999017")
!1009 = !DIDerivedType(tag: DW_TAG_member, scope: !995, file: !2, baseType: !155, size: 64, align: 64, flags: DIFlagArtificial)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !988, file: !2, baseType: !995, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !984, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !978, file: !2, baseType: !1013, size: 128, align: 64)
!1013 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !976, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !1014, templateParams: !982, identifier: "e3ff8c9215bd247d238f3585ea2dd2a4")
!1014 = !{!1015}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1013, file: !2, baseType: !984, size: 128, align: 64, flags: DIFlagPublic)
!1016 = !DIDerivedType(tag: DW_TAG_member, scope: !976, file: !2, baseType: !155, size: 64, align: 64, flags: DIFlagArtificial)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !967, file: !2, baseType: !1018, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
