; ModuleID = '3o01now2fbcu6ycw'
source_filename = "3o01now2fbcu6ycw"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128"
target triple = "arm64-apple-macosx11.0.0"

%"unix::group" = type { ptr, ptr, i32, [1 x i32], ptr }
%"unix::rusage" = type { %"unix::timeval", %"unix::timeval", i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64 }
%"unix::timeval" = type { i64, i32, [1 x i32] }
%"unix::ipv6_mreq" = type { %"unix::align::in6_addr", i32 }
%"unix::align::in6_addr" = type { [16 x i8] }
%"unix::hostent" = type { ptr, ptr, i32, i32, ptr }
%"unix::pollfd" = type { i32, i16, i16 }
%"unix::winsize" = type { i16, i16, i16, i16 }
%"unix::sigval" = type { ptr }
%"unix::itimerval" = type { %"unix::timeval", %"unix::timeval" }
%"unix::tms" = type { i64, i64, i64, i64 }
%"unix::servent" = type { ptr, ptr, i32, [1 x i32], ptr }
%"unix::protoent" = type { ptr, ptr, i32, [1 x i32] }
%"unix::bsd::sockaddr" = type { i8, i8, [14 x i8] }
%"unix::bsd::sockaddr_in6" = type { i8, i8, i16, i32, %"unix::align::in6_addr", i32 }
%"unix::bsd::passwd" = type { ptr, ptr, i32, i32, i64, ptr, ptr, ptr, ptr, i64 }
%"unix::bsd::ifaddrs" = type { ptr, ptr, i32, [1 x i32], ptr, ptr, ptr, ptr }
%"unix::bsd::fd_set" = type { [32 x i32] }
%"unix::bsd::tm" = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, [1 x i32], i64, ptr }
%"unix::bsd::msghdr" = type { ptr, i32, [1 x i32], ptr, i32, [1 x i32], ptr, i32, i32 }
%"unix::bsd::cmsghdr" = type { i32, i32, i32 }

!4 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !5, producer: "clang LLVM (rustc version 1.78.0-nightly (46b180ec2 2024-03-08))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !6, splitDebugInlining: false, nameTableKind: None)
!5 = !DIFile(filename: "src/lib.rs/@/3o01now2fbcu6ycw", directory: "/private/var/folders/m6/nyw0tbd5239gngtm06pzykr00000gn/T/.tmpPXbnuW/libc")
!6 = !{!7, !15, !28, !54}
!7 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_void", scope: !9, file: !8, baseType: !11, size: 8, align: 8, flags: DIFlagEnumClass, elements: !12)
!8 = !DIFile(filename: "<unknown>", directory: "")
!9 = !DINamespace(name: "ffi", scope: !10)
!10 = !DINamespace(name: "core", scope: null)
!11 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!12 = !{!13, !14}
!13 = !DIEnumerator(name: "__variant1", value: 0, isUnsigned: true)
!14 = !DIEnumerator(name: "__variant2", value: 1, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "qos_class_t", scope: !16, file: !8, baseType: !20, size: 32, align: 32, flags: DIFlagEnumClass, elements: !21)
!16 = !DINamespace(name: "apple", scope: !17)
!17 = !DINamespace(name: "bsd", scope: !18)
!18 = !DINamespace(name: "unix", scope: !19)
!19 = !DINamespace(name: "libc", scope: null)
!20 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!21 = !{!22, !23, !24, !25, !26, !27}
!22 = !DIEnumerator(name: "QOS_CLASS_USER_INTERACTIVE", value: 33, isUnsigned: true)
!23 = !DIEnumerator(name: "QOS_CLASS_USER_INITIATED", value: 25, isUnsigned: true)
!24 = !DIEnumerator(name: "QOS_CLASS_DEFAULT", value: 21, isUnsigned: true)
!25 = !DIEnumerator(name: "QOS_CLASS_UTILITY", value: 17, isUnsigned: true)
!26 = !DIEnumerator(name: "QOS_CLASS_BACKGROUND", value: 9, isUnsigned: true)
!27 = !DIEnumerator(name: "QOS_CLASS_UNSPECIFIED", value: 0, isUnsigned: true)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sysdir_search_path_directory_t", scope: !16, file: !8, baseType: !20, size: 32, align: 32, flags: DIFlagEnumClass, elements: !29)
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53}
!30 = !DIEnumerator(name: "SYSDIR_DIRECTORY_APPLICATION", value: 1, isUnsigned: true)
!31 = !DIEnumerator(name: "SYSDIR_DIRECTORY_DEMO_APPLICATION", value: 2, isUnsigned: true)
!32 = !DIEnumerator(name: "SYSDIR_DIRECTORY_DEVELOPER_APPLICATION", value: 3, isUnsigned: true)
!33 = !DIEnumerator(name: "SYSDIR_DIRECTORY_ADMIN_APPLICATION", value: 4, isUnsigned: true)
!34 = !DIEnumerator(name: "SYSDIR_DIRECTORY_LIBRARY", value: 5, isUnsigned: true)
!35 = !DIEnumerator(name: "SYSDIR_DIRECTORY_DEVELOPER", value: 6, isUnsigned: true)
!36 = !DIEnumerator(name: "SYSDIR_DIRECTORY_USER", value: 7, isUnsigned: true)
!37 = !DIEnumerator(name: "SYSDIR_DIRECTORY_DOCUMENTATION", value: 8, isUnsigned: true)
!38 = !DIEnumerator(name: "SYSDIR_DIRECTORY_DOCUMENT", value: 9, isUnsigned: true)
!39 = !DIEnumerator(name: "SYSDIR_DIRECTORY_CORESERVICE", value: 10, isUnsigned: true)
!40 = !DIEnumerator(name: "SYSDIR_DIRECTORY_AUTOSAVED_INFORMATION", value: 11, isUnsigned: true)
!41 = !DIEnumerator(name: "SYSDIR_DIRECTORY_DESKTOP", value: 12, isUnsigned: true)
!42 = !DIEnumerator(name: "SYSDIR_DIRECTORY_CACHES", value: 13, isUnsigned: true)
!43 = !DIEnumerator(name: "SYSDIR_DIRECTORY_APPLICATION_SUPPORT", value: 14, isUnsigned: true)
!44 = !DIEnumerator(name: "SYSDIR_DIRECTORY_DOWNLOADS", value: 15, isUnsigned: true)
!45 = !DIEnumerator(name: "SYSDIR_DIRECTORY_INPUT_METHODS", value: 16, isUnsigned: true)
!46 = !DIEnumerator(name: "SYSDIR_DIRECTORY_MOVIES", value: 17, isUnsigned: true)
!47 = !DIEnumerator(name: "SYSDIR_DIRECTORY_MUSIC", value: 18, isUnsigned: true)
!48 = !DIEnumerator(name: "SYSDIR_DIRECTORY_PICTURES", value: 19, isUnsigned: true)
!49 = !DIEnumerator(name: "SYSDIR_DIRECTORY_PRINTER_DESCRIPTION", value: 20, isUnsigned: true)
!50 = !DIEnumerator(name: "SYSDIR_DIRECTORY_SHARED_PUBLIC", value: 21, isUnsigned: true)
!51 = !DIEnumerator(name: "SYSDIR_DIRECTORY_PREFERENCE_PANES", value: 22, isUnsigned: true)
!52 = !DIEnumerator(name: "SYSDIR_DIRECTORY_ALL_APPLICATIONS", value: 100, isUnsigned: true)
!53 = !DIEnumerator(name: "SYSDIR_DIRECTORY_ALL_LIBRARIES", value: 101, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sysdir_search_path_domain_mask_t", scope: !16, file: !8, baseType: !20, size: 32, align: 32, flags: DIFlagEnumClass, elements: !55)
!55 = !{!56, !57, !58, !59, !60}
!56 = !DIEnumerator(name: "SYSDIR_DOMAIN_MASK_USER", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "SYSDIR_DOMAIN_MASK_LOCAL", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "SYSDIR_DOMAIN_MASK_NETWORK", value: 4, isUnsigned: true)
!59 = !DIEnumerator(name: "SYSDIR_DOMAIN_MASK_SYSTEM", value: 8, isUnsigned: true)
!60 = !DIEnumerator(name: "SYSDIR_DOMAIN_MASK_ALL", value: 65535, isUnsigned: true)
!61 = distinct !DISubprogram(name: "clone", linkageName: "_ZN56_$LT$libc..unix..group$u20$as$u20$core..clone..Clone$GT$5clone17h563995e0cdcc0570E", scope: !63, file: !62, line: 83, type: !64, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !77)
!62 = !DIFile(filename: "src/macros.rs", directory: "/private/var/folders/m6/nyw0tbd5239gngtm06pzykr00000gn/T/.tmpPXbnuW/libc", checksumkind: CSK_MD5, checksum: "bc1ba182f4f705e3391e34bb921b3b85")
!63 = !DINamespace(name: "{impl#1}", scope: !18)
!64 = !DISubroutineType(types: !65)
!65 = !{!66, !76}
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "group", scope: !18, file: !8, size: 256, align: 64, flags: DIFlagPublic, elements: !67, templateParams: !75, identifier: "f3edc5251af0c3fd15b30079c88e8e1f")
!67 = !{!68, !71, !72, !73}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !66, file: !8, baseType: !69, size: 64, align: 64, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut i8", baseType: !70, size: 64, align: 64, dwarfAddressSpace: 0)
!70 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !66, file: !8, baseType: !69, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !66, file: !8, baseType: !20, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !66, file: !8, baseType: !74, size: 64, align: 64, offset: 192, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut *mut i8", baseType: !69, size: 64, align: 64, dwarfAddressSpace: 0)
!75 = !{}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::group", baseType: !66, size: 64, align: 64, dwarfAddressSpace: 0)
!77 = !{!78}
!78 = !DILocalVariable(name: "self", arg: 1, scope: !61, file: !62, line: 83, type: !76)
!79 = !DILocation(line: 83, column: 22, scope: !61)
!80 = !DILocation(line: 83, column: 37, scope: !61)
!81 = !DILocation(line: 83, column: 44, scope: !61)
!82 = distinct !DISubprogram(name: "clone", linkageName: "_ZN58_$LT$libc..unix..utimbuf$u20$as$u20$core..clone..Clone$GT$5clone17h424c4c045d682301E", scope: !83, file: !62, line: 83, type: !84, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !92)
!83 = !DINamespace(name: "{impl#3}", scope: !18)
!84 = !DISubroutineType(types: !85)
!85 = !{!86, !91}
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "utimbuf", scope: !18, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !87, templateParams: !75, identifier: "1e489b94b078f06b4704d55e665623dc")
!87 = !{!88, !90}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "actime", scope: !86, file: !8, baseType: !89, size: 64, align: 64, flags: DIFlagPublic)
!89 = !DIBasicType(name: "i64", size: 64, encoding: DW_ATE_signed)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "modtime", scope: !86, file: !8, baseType: !89, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::utimbuf", baseType: !86, size: 64, align: 64, dwarfAddressSpace: 0)
!92 = !{!93}
!93 = !DILocalVariable(name: "self", arg: 1, scope: !82, file: !62, line: 83, type: !91)
!94 = !DILocation(line: 83, column: 22, scope: !82)
!95 = !DILocation(line: 83, column: 37, scope: !82)
!96 = !DILocation(line: 83, column: 44, scope: !82)
!97 = distinct !DISubprogram(name: "clone", linkageName: "_ZN58_$LT$libc..unix..timeval$u20$as$u20$core..clone..Clone$GT$5clone17hed3b0f095623fd46E", scope: !98, file: !62, line: 83, type: !99, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !107)
!98 = !DINamespace(name: "{impl#5}", scope: !18)
!99 = !DISubroutineType(types: !100)
!100 = !{!101, !106}
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", scope: !18, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !102, templateParams: !75, identifier: "3951e03ba1c6f43197f03aa9a600646f")
!102 = !{!103, !104}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !101, file: !8, baseType: !89, size: 64, align: 64, flags: DIFlagPublic)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !101, file: !8, baseType: !105, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!105 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::timeval", baseType: !101, size: 64, align: 64, dwarfAddressSpace: 0)
!107 = !{!108}
!108 = !DILocalVariable(name: "self", arg: 1, scope: !97, file: !62, line: 83, type: !106)
!109 = !DILocation(line: 83, column: 22, scope: !97)
!110 = !DILocation(line: 83, column: 37, scope: !97)
!111 = !DILocation(line: 83, column: 44, scope: !97)
!112 = distinct !DISubprogram(name: "clone", linkageName: "_ZN59_$LT$libc..unix..timespec$u20$as$u20$core..clone..Clone$GT$5clone17h4ccaa316fb219f4aE", scope: !113, file: !62, line: 83, type: !114, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !121)
!113 = !DINamespace(name: "{impl#7}", scope: !18)
!114 = !DISubroutineType(types: !115)
!115 = !{!116, !120}
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", scope: !18, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !117, templateParams: !75, identifier: "1cfbb9a9069ff19a8993b754b041a8")
!117 = !{!118, !119}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !116, file: !8, baseType: !89, size: 64, align: 64, flags: DIFlagPublic)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !116, file: !8, baseType: !89, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::timespec", baseType: !116, size: 64, align: 64, dwarfAddressSpace: 0)
!121 = !{!122}
!122 = !DILocalVariable(name: "self", arg: 1, scope: !112, file: !62, line: 83, type: !120)
!123 = !DILocation(line: 83, column: 22, scope: !112)
!124 = !DILocation(line: 83, column: 37, scope: !112)
!125 = !DILocation(line: 83, column: 44, scope: !112)
!126 = distinct !DISubprogram(name: "clone", linkageName: "_ZN57_$LT$libc..unix..rlimit$u20$as$u20$core..clone..Clone$GT$5clone17h3cb49cb0708d47f9E", scope: !127, file: !62, line: 83, type: !128, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !136)
!127 = !DINamespace(name: "{impl#9}", scope: !18)
!128 = !DISubroutineType(types: !129)
!129 = !{!130, !135}
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "rlimit", scope: !18, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !131, templateParams: !75, identifier: "1c1ceea0ba7747c8a4aebfd12e707c32")
!131 = !{!132, !134}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_cur", scope: !130, file: !8, baseType: !133, size: 64, align: 64, flags: DIFlagPublic)
!133 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_max", scope: !130, file: !8, baseType: !133, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::rlimit", baseType: !130, size: 64, align: 64, dwarfAddressSpace: 0)
!136 = !{!137}
!137 = !DILocalVariable(name: "self", arg: 1, scope: !126, file: !62, line: 83, type: !135)
!138 = !DILocation(line: 83, column: 22, scope: !126)
!139 = !DILocation(line: 83, column: 37, scope: !126)
!140 = !DILocation(line: 83, column: 44, scope: !126)
!141 = distinct !DISubprogram(name: "clone", linkageName: "_ZN57_$LT$libc..unix..rusage$u20$as$u20$core..clone..Clone$GT$5clone17h4c7846c379e8acdbE", scope: !142, file: !62, line: 83, type: !143, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !164)
!142 = !DINamespace(name: "{impl#11}", scope: !18)
!143 = !DISubroutineType(types: !144)
!144 = !{!145, !163}
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "rusage", scope: !18, file: !8, size: 1152, align: 64, flags: DIFlagPublic, elements: !146, templateParams: !75, identifier: "4337b298336a738db8a20fe23ce11eb")
!146 = !{!147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "ru_utime", scope: !145, file: !8, baseType: !101, size: 128, align: 64, flags: DIFlagPublic)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ru_stime", scope: !145, file: !8, baseType: !101, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ru_maxrss", scope: !145, file: !8, baseType: !89, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "ru_ixrss", scope: !145, file: !8, baseType: !89, size: 64, align: 64, offset: 320, flags: DIFlagPublic)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "ru_idrss", scope: !145, file: !8, baseType: !89, size: 64, align: 64, offset: 384, flags: DIFlagPublic)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "ru_isrss", scope: !145, file: !8, baseType: !89, size: 64, align: 64, offset: 448, flags: DIFlagPublic)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ru_minflt", scope: !145, file: !8, baseType: !89, size: 64, align: 64, offset: 512, flags: DIFlagPublic)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ru_majflt", scope: !145, file: !8, baseType: !89, size: 64, align: 64, offset: 576, flags: DIFlagPublic)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nswap", scope: !145, file: !8, baseType: !89, size: 64, align: 64, offset: 640, flags: DIFlagPublic)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ru_inblock", scope: !145, file: !8, baseType: !89, size: 64, align: 64, offset: 704, flags: DIFlagPublic)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "ru_oublock", scope: !145, file: !8, baseType: !89, size: 64, align: 64, offset: 768, flags: DIFlagPublic)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ru_msgsnd", scope: !145, file: !8, baseType: !89, size: 64, align: 64, offset: 832, flags: DIFlagPublic)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ru_msgrcv", scope: !145, file: !8, baseType: !89, size: 64, align: 64, offset: 896, flags: DIFlagPublic)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nsignals", scope: !145, file: !8, baseType: !89, size: 64, align: 64, offset: 960, flags: DIFlagPublic)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nvcsw", scope: !145, file: !8, baseType: !89, size: 64, align: 64, offset: 1024, flags: DIFlagPublic)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nivcsw", scope: !145, file: !8, baseType: !89, size: 64, align: 64, offset: 1088, flags: DIFlagPublic)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::rusage", baseType: !145, size: 64, align: 64, dwarfAddressSpace: 0)
!164 = !{!165}
!165 = !DILocalVariable(name: "self", arg: 1, scope: !141, file: !62, line: 83, type: !163)
!166 = !DILocation(line: 83, column: 22, scope: !141)
!167 = !DILocation(line: 83, column: 37, scope: !141)
!168 = !DILocation(line: 83, column: 44, scope: !141)
!169 = distinct !DISubprogram(name: "clone", linkageName: "_ZN60_$LT$libc..unix..ipv6_mreq$u20$as$u20$core..clone..Clone$GT$5clone17h28f112f5323dfee2E", scope: !170, file: !62, line: 83, type: !171, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !185)
!170 = !DINamespace(name: "{impl#13}", scope: !18)
!171 = !DISubroutineType(types: !172)
!172 = !{!173, !184}
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6_mreq", scope: !18, file: !8, size: 160, align: 32, flags: DIFlagPublic, elements: !174, templateParams: !75, identifier: "711470e04b772d08470f2098fe67dcd3")
!174 = !{!175, !183}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6mr_multiaddr", scope: !173, file: !8, baseType: !176, size: 128, align: 32, flags: DIFlagPublic)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", scope: !177, file: !8, size: 128, align: 32, flags: DIFlagPublic, elements: !178, templateParams: !75, identifier: "53ecfc500672088fba603a5415d0a659")
!177 = !DINamespace(name: "align", scope: !18)
!178 = !{!179}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "s6_addr", scope: !176, file: !8, baseType: !180, size: 128, align: 8, flags: DIFlagPublic)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 128, align: 8, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 16, lowerBound: 0)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6mr_interface", scope: !173, file: !8, baseType: !20, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::ipv6_mreq", baseType: !173, size: 64, align: 64, dwarfAddressSpace: 0)
!185 = !{!186}
!186 = !DILocalVariable(name: "self", arg: 1, scope: !169, file: !62, line: 83, type: !184)
!187 = !DILocation(line: 83, column: 22, scope: !169)
!188 = !DILocation(line: 83, column: 37, scope: !169)
!189 = !DILocation(line: 83, column: 44, scope: !169)
!190 = distinct !DISubprogram(name: "clone", linkageName: "_ZN58_$LT$libc..unix..hostent$u20$as$u20$core..clone..Clone$GT$5clone17h89b254619c21aa8eE", scope: !191, file: !62, line: 83, type: !192, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !202)
!191 = !DINamespace(name: "{impl#15}", scope: !18)
!192 = !DISubroutineType(types: !193)
!193 = !{!194, !201}
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "hostent", scope: !18, file: !8, size: 256, align: 64, flags: DIFlagPublic, elements: !195, templateParams: !75, identifier: "ead06ca8dca86841d83000839d2b2c11")
!195 = !{!196, !197, !198, !199, !200}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "h_name", scope: !194, file: !8, baseType: !69, size: 64, align: 64, flags: DIFlagPublic)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "h_aliases", scope: !194, file: !8, baseType: !74, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "h_addrtype", scope: !194, file: !8, baseType: !105, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "h_length", scope: !194, file: !8, baseType: !105, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "h_addr_list", scope: !194, file: !8, baseType: !74, size: 64, align: 64, offset: 192, flags: DIFlagPublic)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::hostent", baseType: !194, size: 64, align: 64, dwarfAddressSpace: 0)
!202 = !{!203}
!203 = !DILocalVariable(name: "self", arg: 1, scope: !190, file: !62, line: 83, type: !201)
!204 = !DILocation(line: 83, column: 22, scope: !190)
!205 = !DILocation(line: 83, column: 37, scope: !190)
!206 = !DILocation(line: 83, column: 44, scope: !190)
!207 = distinct !DISubprogram(name: "clone", linkageName: "_ZN56_$LT$libc..unix..iovec$u20$as$u20$core..clone..Clone$GT$5clone17ha7226ff67a805b19E", scope: !208, file: !62, line: 83, type: !209, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !218)
!208 = !DINamespace(name: "{impl#17}", scope: !18)
!209 = !DISubroutineType(types: !210)
!210 = !{!211, !217}
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", scope: !18, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !212, templateParams: !75, identifier: "14f02c70e319865620d0c2026c50f357")
!212 = !{!213, !215}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !211, file: !8, baseType: !214, size: 64, align: 64, flags: DIFlagPublic)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::ffi::c_void", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !211, file: !8, baseType: !216, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!216 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::iovec", baseType: !211, size: 64, align: 64, dwarfAddressSpace: 0)
!218 = !{!219}
!219 = !DILocalVariable(name: "self", arg: 1, scope: !207, file: !62, line: 83, type: !217)
!220 = !DILocation(line: 83, column: 22, scope: !207)
!221 = !DILocation(line: 83, column: 37, scope: !207)
!222 = !DILocation(line: 83, column: 44, scope: !207)
!223 = distinct !DISubprogram(name: "clone", linkageName: "_ZN57_$LT$libc..unix..pollfd$u20$as$u20$core..clone..Clone$GT$5clone17hd1c9e2a2bbe8f162E", scope: !224, file: !62, line: 83, type: !225, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !234)
!224 = !DINamespace(name: "{impl#19}", scope: !18)
!225 = !DISubroutineType(types: !226)
!226 = !{!227, !233}
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", scope: !18, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !228, templateParams: !75, identifier: "c6b0bb0a5de227ab311aa34f6c88cffb")
!228 = !{!229, !230, !232}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !227, file: !8, baseType: !105, size: 32, align: 32, flags: DIFlagPublic)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !227, file: !8, baseType: !231, size: 16, align: 16, offset: 32, flags: DIFlagPublic)
!231 = !DIBasicType(name: "i16", size: 16, encoding: DW_ATE_signed)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "revents", scope: !227, file: !8, baseType: !231, size: 16, align: 16, offset: 48, flags: DIFlagPublic)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::pollfd", baseType: !227, size: 64, align: 64, dwarfAddressSpace: 0)
!234 = !{!235}
!235 = !DILocalVariable(name: "self", arg: 1, scope: !223, file: !62, line: 83, type: !233)
!236 = !DILocation(line: 83, column: 22, scope: !223)
!237 = !DILocation(line: 83, column: 37, scope: !223)
!238 = !DILocation(line: 83, column: 44, scope: !223)
!239 = distinct !DISubprogram(name: "clone", linkageName: "_ZN58_$LT$libc..unix..winsize$u20$as$u20$core..clone..Clone$GT$5clone17h8accf3674e49358dE", scope: !240, file: !62, line: 83, type: !241, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !251)
!240 = !DINamespace(name: "{impl#21}", scope: !18)
!241 = !DISubroutineType(types: !242)
!242 = !{!243, !250}
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "winsize", scope: !18, file: !8, size: 64, align: 16, flags: DIFlagPublic, elements: !244, templateParams: !75, identifier: "bb536796fbbd78e68deb47231113079c")
!244 = !{!245, !247, !248, !249}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ws_row", scope: !243, file: !8, baseType: !246, size: 16, align: 16, flags: DIFlagPublic)
!246 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ws_col", scope: !243, file: !8, baseType: !246, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "ws_xpixel", scope: !243, file: !8, baseType: !246, size: 16, align: 16, offset: 32, flags: DIFlagPublic)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "ws_ypixel", scope: !243, file: !8, baseType: !246, size: 16, align: 16, offset: 48, flags: DIFlagPublic)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::winsize", baseType: !243, size: 64, align: 64, dwarfAddressSpace: 0)
!251 = !{!252}
!252 = !DILocalVariable(name: "self", arg: 1, scope: !239, file: !62, line: 83, type: !250)
!253 = !DILocation(line: 83, column: 22, scope: !239)
!254 = !DILocation(line: 83, column: 37, scope: !239)
!255 = !DILocation(line: 83, column: 44, scope: !239)
!256 = distinct !DISubprogram(name: "clone", linkageName: "_ZN57_$LT$libc..unix..linger$u20$as$u20$core..clone..Clone$GT$5clone17h7052f5fab7fe1753E", scope: !257, file: !62, line: 83, type: !258, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !265)
!257 = !DINamespace(name: "{impl#23}", scope: !18)
!258 = !DISubroutineType(types: !259)
!259 = !{!260, !264}
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "linger", scope: !18, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !261, templateParams: !75, identifier: "12406b8390c1c92afe5aa81ac961f829")
!261 = !{!262, !263}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "l_onoff", scope: !260, file: !8, baseType: !105, size: 32, align: 32, flags: DIFlagPublic)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "l_linger", scope: !260, file: !8, baseType: !105, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linger", baseType: !260, size: 64, align: 64, dwarfAddressSpace: 0)
!265 = !{!266}
!266 = !DILocalVariable(name: "self", arg: 1, scope: !256, file: !62, line: 83, type: !264)
!267 = !DILocation(line: 83, column: 22, scope: !256)
!268 = !DILocation(line: 83, column: 37, scope: !256)
!269 = !DILocation(line: 83, column: 44, scope: !256)
!270 = distinct !DISubprogram(name: "clone", linkageName: "_ZN57_$LT$libc..unix..sigval$u20$as$u20$core..clone..Clone$GT$5clone17he16218bf8a6f9c11E", scope: !271, file: !62, line: 83, type: !272, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !278)
!271 = !DINamespace(name: "{impl#25}", scope: !18)
!272 = !DISubroutineType(types: !273)
!273 = !{!274, !277}
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "sigval", scope: !18, file: !8, size: 64, align: 64, flags: DIFlagPublic, elements: !275, templateParams: !75, identifier: "260cd143ebb8c63b9f0ebebb97a493fd")
!275 = !{!276}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !274, file: !8, baseType: !214, size: 64, align: 64, flags: DIFlagPublic)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::sigval", baseType: !274, size: 64, align: 64, dwarfAddressSpace: 0)
!278 = !{!279}
!279 = !DILocalVariable(name: "self", arg: 1, scope: !270, file: !62, line: 83, type: !277)
!280 = !DILocation(line: 83, column: 22, scope: !270)
!281 = !DILocation(line: 83, column: 37, scope: !270)
!282 = !DILocation(line: 83, column: 44, scope: !270)
!283 = distinct !DISubprogram(name: "clone", linkageName: "_ZN60_$LT$libc..unix..itimerval$u20$as$u20$core..clone..Clone$GT$5clone17h02f4ef625299b605E", scope: !284, file: !62, line: 83, type: !285, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !292)
!284 = !DINamespace(name: "{impl#27}", scope: !18)
!285 = !DISubroutineType(types: !286)
!286 = !{!287, !291}
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "itimerval", scope: !18, file: !8, size: 256, align: 64, flags: DIFlagPublic, elements: !288, templateParams: !75, identifier: "6967780f1daa3bad54e53480b5ff8b99")
!288 = !{!289, !290}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "it_interval", scope: !287, file: !8, baseType: !101, size: 128, align: 64, flags: DIFlagPublic)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "it_value", scope: !287, file: !8, baseType: !101, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::itimerval", baseType: !287, size: 64, align: 64, dwarfAddressSpace: 0)
!292 = !{!293}
!293 = !DILocalVariable(name: "self", arg: 1, scope: !283, file: !62, line: 83, type: !291)
!294 = !DILocation(line: 83, column: 22, scope: !283)
!295 = !DILocation(line: 83, column: 37, scope: !283)
!296 = !DILocation(line: 83, column: 44, scope: !283)
!297 = distinct !DISubprogram(name: "clone", linkageName: "_ZN54_$LT$libc..unix..tms$u20$as$u20$core..clone..Clone$GT$5clone17hcea2d6b6535b63b3E", scope: !298, file: !62, line: 83, type: !299, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !308)
!298 = !DINamespace(name: "{impl#29}", scope: !18)
!299 = !DISubroutineType(types: !300)
!300 = !{!301, !307}
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "tms", scope: !18, file: !8, size: 256, align: 64, flags: DIFlagPublic, elements: !302, templateParams: !75, identifier: "cddf4eb9afcaed743d84b5ac3c7f96a3")
!302 = !{!303, !304, !305, !306}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tms_utime", scope: !301, file: !8, baseType: !133, size: 64, align: 64, flags: DIFlagPublic)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "tms_stime", scope: !301, file: !8, baseType: !133, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tms_cutime", scope: !301, file: !8, baseType: !133, size: 64, align: 64, offset: 128, flags: DIFlagPublic)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tms_cstime", scope: !301, file: !8, baseType: !133, size: 64, align: 64, offset: 192, flags: DIFlagPublic)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::tms", baseType: !301, size: 64, align: 64, dwarfAddressSpace: 0)
!308 = !{!309}
!309 = !DILocalVariable(name: "self", arg: 1, scope: !297, file: !62, line: 83, type: !307)
!310 = !DILocation(line: 83, column: 22, scope: !297)
!311 = !DILocation(line: 83, column: 37, scope: !297)
!312 = !DILocation(line: 83, column: 44, scope: !297)
!313 = distinct !DISubprogram(name: "clone", linkageName: "_ZN58_$LT$libc..unix..servent$u20$as$u20$core..clone..Clone$GT$5clone17h95544c7665c704b3E", scope: !314, file: !62, line: 83, type: !315, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !324)
!314 = !DINamespace(name: "{impl#31}", scope: !18)
!315 = !DISubroutineType(types: !316)
!316 = !{!317, !323}
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "servent", scope: !18, file: !8, size: 256, align: 64, flags: DIFlagPublic, elements: !318, templateParams: !75, identifier: "fe592ef70a538e8eed68043c35858f13")
!318 = !{!319, !320, !321, !322}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "s_name", scope: !317, file: !8, baseType: !69, size: 64, align: 64, flags: DIFlagPublic)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "s_aliases", scope: !317, file: !8, baseType: !74, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "s_port", scope: !317, file: !8, baseType: !105, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "s_proto", scope: !317, file: !8, baseType: !69, size: 64, align: 64, offset: 192, flags: DIFlagPublic)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::servent", baseType: !317, size: 64, align: 64, dwarfAddressSpace: 0)
!324 = !{!325}
!325 = !DILocalVariable(name: "self", arg: 1, scope: !313, file: !62, line: 83, type: !323)
!326 = !DILocation(line: 83, column: 22, scope: !313)
!327 = !DILocation(line: 83, column: 37, scope: !313)
!328 = !DILocation(line: 83, column: 44, scope: !313)
!329 = distinct !DISubprogram(name: "clone", linkageName: "_ZN59_$LT$libc..unix..protoent$u20$as$u20$core..clone..Clone$GT$5clone17hacf6290c1afa4715E", scope: !330, file: !62, line: 83, type: !331, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !339)
!330 = !DINamespace(name: "{impl#33}", scope: !18)
!331 = !DISubroutineType(types: !332)
!332 = !{!333, !338}
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "protoent", scope: !18, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !334, templateParams: !75, identifier: "8d34d6176404fbdd373f634a3106f527")
!334 = !{!335, !336, !337}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "p_name", scope: !333, file: !8, baseType: !69, size: 64, align: 64, flags: DIFlagPublic)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "p_aliases", scope: !333, file: !8, baseType: !74, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "p_proto", scope: !333, file: !8, baseType: !105, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::protoent", baseType: !333, size: 64, align: 64, dwarfAddressSpace: 0)
!339 = !{!340}
!340 = !DILocalVariable(name: "self", arg: 1, scope: !329, file: !62, line: 83, type: !338)
!341 = !DILocation(line: 83, column: 22, scope: !329)
!342 = !DILocation(line: 83, column: 37, scope: !329)
!343 = !DILocation(line: 83, column: 44, scope: !329)
!344 = distinct !DISubprogram(name: "clone", linkageName: "_ZN64_$LT$libc..unix..bsd..sockaddr$u20$as$u20$core..clone..Clone$GT$5clone17h367c18b0a153483aE", scope: !345, file: !62, line: 83, type: !346, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !357)
!345 = !DINamespace(name: "{impl#1}", scope: !17)
!346 = !DISubroutineType(types: !347)
!347 = !{!348, !356}
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", scope: !17, file: !8, size: 128, align: 8, flags: DIFlagPublic, elements: !349, templateParams: !75, identifier: "e8a5a86032565384c678d1c4289ef6d9")
!349 = !{!350, !351, !352}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "sa_len", scope: !348, file: !8, baseType: !11, size: 8, align: 8, flags: DIFlagPublic)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !348, file: !8, baseType: !11, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !348, file: !8, baseType: !353, size: 112, align: 8, offset: 16, flags: DIFlagPublic)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 112, align: 8, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 14, lowerBound: 0)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::bsd::sockaddr", baseType: !348, size: 64, align: 64, dwarfAddressSpace: 0)
!357 = !{!358}
!358 = !DILocalVariable(name: "self", arg: 1, scope: !344, file: !62, line: 83, type: !356)
!359 = !DILocation(line: 83, column: 22, scope: !344)
!360 = !DILocation(line: 83, column: 37, scope: !344)
!361 = !DILocation(line: 83, column: 44, scope: !344)
!362 = distinct !DISubprogram(name: "clone", linkageName: "_ZN68_$LT$libc..unix..bsd..sockaddr_in6$u20$as$u20$core..clone..Clone$GT$5clone17hc44c282451929a2fE", scope: !363, file: !62, line: 83, type: !364, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !375)
!363 = !DINamespace(name: "{impl#3}", scope: !17)
!364 = !DISubroutineType(types: !365)
!365 = !{!366, !374}
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", scope: !17, file: !8, size: 224, align: 32, flags: DIFlagPublic, elements: !367, templateParams: !75, identifier: "d21edc9119fce1eb44dbe045087848c1")
!367 = !{!368, !369, !370, !371, !372, !373}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_len", scope: !366, file: !8, baseType: !11, size: 8, align: 8, flags: DIFlagPublic)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !366, file: !8, baseType: !11, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !366, file: !8, baseType: !246, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !366, file: !8, baseType: !20, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !366, file: !8, baseType: !176, size: 128, align: 32, offset: 64, flags: DIFlagPublic)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !366, file: !8, baseType: !20, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::bsd::sockaddr_in6", baseType: !366, size: 64, align: 64, dwarfAddressSpace: 0)
!375 = !{!376}
!376 = !DILocalVariable(name: "self", arg: 1, scope: !362, file: !62, line: 83, type: !374)
!377 = !DILocation(line: 83, column: 22, scope: !362)
!378 = !DILocation(line: 83, column: 37, scope: !362)
!379 = !DILocation(line: 83, column: 44, scope: !362)
!380 = distinct !DISubprogram(name: "clone", linkageName: "_ZN62_$LT$libc..unix..bsd..passwd$u20$as$u20$core..clone..Clone$GT$5clone17hc57e65c36acb5809E", scope: !381, file: !62, line: 83, type: !382, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !397)
!381 = !DINamespace(name: "{impl#5}", scope: !17)
!382 = !DISubroutineType(types: !383)
!383 = !{!384, !396}
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", scope: !17, file: !8, size: 576, align: 64, flags: DIFlagPublic, elements: !385, templateParams: !75, identifier: "edb44651656fe11fa185ee5d196f2864")
!385 = !{!386, !387, !388, !389, !390, !391, !392, !393, !394, !395}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !384, file: !8, baseType: !69, size: 64, align: 64, flags: DIFlagPublic)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !384, file: !8, baseType: !69, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !384, file: !8, baseType: !20, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !384, file: !8, baseType: !20, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "pw_change", scope: !384, file: !8, baseType: !89, size: 64, align: 64, offset: 192, flags: DIFlagPublic)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "pw_class", scope: !384, file: !8, baseType: !69, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !384, file: !8, baseType: !69, size: 64, align: 64, offset: 320, flags: DIFlagPublic)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !384, file: !8, baseType: !69, size: 64, align: 64, offset: 384, flags: DIFlagPublic)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !384, file: !8, baseType: !69, size: 64, align: 64, offset: 448, flags: DIFlagPublic)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pw_expire", scope: !384, file: !8, baseType: !89, size: 64, align: 64, offset: 512, flags: DIFlagPublic)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::bsd::passwd", baseType: !384, size: 64, align: 64, dwarfAddressSpace: 0)
!397 = !{!398}
!398 = !DILocalVariable(name: "self", arg: 1, scope: !380, file: !62, line: 83, type: !396)
!399 = !DILocation(line: 83, column: 22, scope: !380)
!400 = !DILocation(line: 83, column: 37, scope: !380)
!401 = !DILocation(line: 83, column: 44, scope: !380)
!402 = distinct !DISubprogram(name: "clone", linkageName: "_ZN63_$LT$libc..unix..bsd..ifaddrs$u20$as$u20$core..clone..Clone$GT$5clone17hfcf8c03bafdf438bE", scope: !403, file: !62, line: 83, type: !404, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !418)
!403 = !DINamespace(name: "{impl#7}", scope: !17)
!404 = !DISubroutineType(types: !405)
!405 = !{!406, !417}
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "ifaddrs", scope: !17, file: !8, size: 448, align: 64, flags: DIFlagPublic, elements: !407, templateParams: !75, identifier: "2d83d5df39d751953974e6e2da269e8")
!407 = !{!408, !410, !411, !412, !414, !415, !416}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_next", scope: !406, file: !8, baseType: !409, size: 64, align: 64, flags: DIFlagPublic)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut libc::unix::bsd::ifaddrs", baseType: !406, size: 64, align: 64, dwarfAddressSpace: 0)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_name", scope: !406, file: !8, baseType: !69, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_flags", scope: !406, file: !8, baseType: !20, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_addr", scope: !406, file: !8, baseType: !413, size: 64, align: 64, offset: 192, flags: DIFlagPublic)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut libc::unix::bsd::sockaddr", baseType: !348, size: 64, align: 64, dwarfAddressSpace: 0)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_netmask", scope: !406, file: !8, baseType: !413, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_dstaddr", scope: !406, file: !8, baseType: !413, size: 64, align: 64, offset: 320, flags: DIFlagPublic)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_data", scope: !406, file: !8, baseType: !214, size: 64, align: 64, offset: 384, flags: DIFlagPublic)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::bsd::ifaddrs", baseType: !406, size: 64, align: 64, dwarfAddressSpace: 0)
!418 = !{!419}
!419 = !DILocalVariable(name: "self", arg: 1, scope: !402, file: !62, line: 83, type: !417)
!420 = !DILocation(line: 83, column: 22, scope: !402)
!421 = !DILocation(line: 83, column: 37, scope: !402)
!422 = !DILocation(line: 83, column: 44, scope: !402)
!423 = distinct !DISubprogram(name: "clone", linkageName: "_ZN62_$LT$libc..unix..bsd..fd_set$u20$as$u20$core..clone..Clone$GT$5clone17h3e1a266e79bc768aE", scope: !424, file: !62, line: 83, type: !425, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !434)
!424 = !DINamespace(name: "{impl#9}", scope: !17)
!425 = !DISubroutineType(types: !426)
!426 = !{!427, !433}
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "fd_set", scope: !17, file: !8, size: 1024, align: 32, flags: DIFlagPublic, elements: !428, templateParams: !75, identifier: "1315b3de593c1641c891f1eb5664f973")
!428 = !{!429}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "fds_bits", scope: !427, file: !8, baseType: !430, size: 1024, align: 32, flags: DIFlagPrivate)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 1024, align: 32, elements: !431)
!431 = !{!432}
!432 = !DISubrange(count: 32, lowerBound: 0)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::bsd::fd_set", baseType: !427, size: 64, align: 64, dwarfAddressSpace: 0)
!434 = !{!435}
!435 = !DILocalVariable(name: "self", arg: 1, scope: !423, file: !62, line: 83, type: !433)
!436 = !DILocation(line: 83, column: 22, scope: !423)
!437 = !DILocation(line: 83, column: 37, scope: !423)
!438 = !DILocation(line: 83, column: 44, scope: !423)
!439 = distinct !DISubprogram(name: "clone", linkageName: "_ZN58_$LT$libc..unix..bsd..tm$u20$as$u20$core..clone..Clone$GT$5clone17h3a6f83dbe004cdbdE", scope: !440, file: !62, line: 83, type: !441, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !457)
!440 = !DINamespace(name: "{impl#11}", scope: !17)
!441 = !DISubroutineType(types: !442)
!442 = !{!443, !456}
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", scope: !17, file: !8, size: 448, align: 64, flags: DIFlagPublic, elements: !444, templateParams: !75, identifier: "f4109e7dcaf0600ea334527465a3aefa")
!444 = !{!445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !443, file: !8, baseType: !105, size: 32, align: 32, flags: DIFlagPublic)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !443, file: !8, baseType: !105, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !443, file: !8, baseType: !105, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !443, file: !8, baseType: !105, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !443, file: !8, baseType: !105, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !443, file: !8, baseType: !105, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !443, file: !8, baseType: !105, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !443, file: !8, baseType: !105, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !443, file: !8, baseType: !105, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !443, file: !8, baseType: !89, size: 64, align: 64, offset: 320, flags: DIFlagPublic)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !443, file: !8, baseType: !69, size: 64, align: 64, offset: 384, flags: DIFlagPublic)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::bsd::tm", baseType: !443, size: 64, align: 64, dwarfAddressSpace: 0)
!457 = !{!458}
!458 = !DILocalVariable(name: "self", arg: 1, scope: !439, file: !62, line: 83, type: !456)
!459 = !DILocation(line: 83, column: 22, scope: !439)
!460 = !DILocation(line: 83, column: 37, scope: !439)
!461 = !DILocation(line: 83, column: 44, scope: !439)
!462 = distinct !DISubprogram(name: "clone", linkageName: "_ZN62_$LT$libc..unix..bsd..msghdr$u20$as$u20$core..clone..Clone$GT$5clone17h447103519ae64567E", scope: !463, file: !62, line: 83, type: !464, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !477)
!463 = !DINamespace(name: "{impl#13}", scope: !17)
!464 = !DISubroutineType(types: !465)
!465 = !{!466, !476}
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "msghdr", scope: !17, file: !8, size: 384, align: 64, flags: DIFlagPublic, elements: !467, templateParams: !75, identifier: "dbc2aa6089ef096df3c84f75c53d3268")
!467 = !{!468, !469, !470, !472, !473, !474, !475}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "msg_name", scope: !466, file: !8, baseType: !214, size: 64, align: 64, flags: DIFlagPublic)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "msg_namelen", scope: !466, file: !8, baseType: !20, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iov", scope: !466, file: !8, baseType: !471, size: 64, align: 64, offset: 128, flags: DIFlagPublic)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut libc::unix::iovec", baseType: !211, size: 64, align: 64, dwarfAddressSpace: 0)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iovlen", scope: !466, file: !8, baseType: !105, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "msg_control", scope: !466, file: !8, baseType: !214, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "msg_controllen", scope: !466, file: !8, baseType: !20, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "msg_flags", scope: !466, file: !8, baseType: !105, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::bsd::msghdr", baseType: !466, size: 64, align: 64, dwarfAddressSpace: 0)
!477 = !{!478}
!478 = !DILocalVariable(name: "self", arg: 1, scope: !462, file: !62, line: 83, type: !476)
!479 = !DILocation(line: 83, column: 22, scope: !462)
!480 = !DILocation(line: 83, column: 37, scope: !462)
!481 = !DILocation(line: 83, column: 44, scope: !462)
!482 = distinct !DISubprogram(name: "clone", linkageName: "_ZN63_$LT$libc..unix..bsd..cmsghdr$u20$as$u20$core..clone..Clone$GT$5clone17hcd6fdfb33e77744aE", scope: !483, file: !62, line: 83, type: !484, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !492)
!483 = !DINamespace(name: "{impl#15}", scope: !17)
!484 = !DISubroutineType(types: !485)
!485 = !{!486, !491}
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "cmsghdr", scope: !17, file: !8, size: 96, align: 32, flags: DIFlagPublic, elements: !487, templateParams: !75, identifier: "722b08708f86ebd862a07ba2dbc038f1")
!487 = !{!488, !489, !490}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg_len", scope: !486, file: !8, baseType: !20, size: 32, align: 32, flags: DIFlagPublic)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg_level", scope: !486, file: !8, baseType: !105, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg_type", scope: !486, file: !8, baseType: !105, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::bsd::cmsghdr", baseType: !486, size: 64, align: 64, dwarfAddressSpace: 0)
!492 = !{!493}
!493 = !DILocalVariable(name: "self", arg: 1, scope: !482, file: !62, line: 83, type: !491)
!494 = !DILocation(line: 83, column: 22, scope: !482)
!495 = !DILocation(line: 83, column: 37, scope: !482)
!496 = !DILocation(line: 83, column: 44, scope: !482)
!497 = distinct !DISubprogram(name: "clone", linkageName: "_ZN62_$LT$libc..unix..bsd..fsid_t$u20$as$u20$core..clone..Clone$GT$5clone17h70b4afe3b0ff01dbE", scope: !498, file: !62, line: 83, type: !499, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !508)
!498 = !DINamespace(name: "{impl#17}", scope: !17)
!499 = !DISubroutineType(types: !500)
!500 = !{!501, !507}
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "fsid_t", scope: !17, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !502, templateParams: !75, identifier: "c42c01e0c16484c342fb5672d8e0f752")
!502 = !{!503}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "__fsid_val", scope: !501, file: !8, baseType: !504, size: 64, align: 32, flags: DIFlagPrivate)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 64, align: 32, elements: !505)
!505 = !{!506}
!506 = !DISubrange(count: 2, lowerBound: 0)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::bsd::fsid_t", baseType: !501, size: 64, align: 64, dwarfAddressSpace: 0)
!508 = !{!509}
!509 = !DILocalVariable(name: "self", arg: 1, scope: !497, file: !62, line: 83, type: !507)
!510 = !DILocation(line: 83, column: 22, scope: !497)
!511 = !DILocation(line: 83, column: 37, scope: !497)
!512 = !DILocation(line: 83, column: 44, scope: !497)
!513 = distinct !DISubprogram(name: "clone", linkageName: "_ZN68_$LT$libc..unix..bsd..if_nameindex$u20$as$u20$core..clone..Clone$GT$5clone17hbf2bdc51869d57b5E", scope: !514, file: !62, line: 83, type: !515, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !522)
!514 = !DINamespace(name: "{impl#19}", scope: !17)
!515 = !DISubroutineType(types: !516)
!516 = !{!517, !521}
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "if_nameindex", scope: !17, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !518, templateParams: !75, identifier: "5dd5cc7b5818f353f141454db2e80eb1")
!518 = !{!519, !520}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "if_index", scope: !517, file: !8, baseType: !20, size: 32, align: 32, flags: DIFlagPublic)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "if_name", scope: !517, file: !8, baseType: !69, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::bsd::if_nameindex", baseType: !517, size: 64, align: 64, dwarfAddressSpace: 0)
!522 = !{!523}
!523 = !DILocalVariable(name: "self", arg: 1, scope: !513, file: !62, line: 83, type: !521)
!524 = !DILocation(line: 83, column: 22, scope: !513)
!525 = !DILocation(line: 83, column: 37, scope: !513)
!526 = !DILocation(line: 83, column: 44, scope: !513)
!527 = distinct !DISubprogram(name: "clone", linkageName: "_ZN63_$LT$libc..unix..bsd..regex_t$u20$as$u20$core..clone..Clone$GT$5clone17hfd208eac67afdff6E", scope: !528, file: !62, line: 83, type: !529, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !539)
!528 = !DINamespace(name: "{impl#21}", scope: !17)
!529 = !DISubroutineType(types: !530)
!530 = !{!531, !538}
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "regex_t", scope: !17, file: !8, size: 256, align: 64, flags: DIFlagPublic, elements: !532, templateParams: !75, identifier: "60efad59b1ff8c85e7ca483c98f99bc8")
!532 = !{!533, !534, !535, !537}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "__re_magic", scope: !531, file: !8, baseType: !105, size: 32, align: 32, flags: DIFlagPrivate)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "__re_nsub", scope: !531, file: !8, baseType: !216, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "__re_endp", scope: !531, file: !8, baseType: !536, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const i8", baseType: !70, size: 64, align: 64, dwarfAddressSpace: 0)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "__re_g", scope: !531, file: !8, baseType: !214, size: 64, align: 64, offset: 192, flags: DIFlagPrivate)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::bsd::regex_t", baseType: !531, size: 64, align: 64, dwarfAddressSpace: 0)
!539 = !{!540}
!540 = !DILocalVariable(name: "self", arg: 1, scope: !527, file: !62, line: 83, type: !538)
!541 = !DILocation(line: 83, column: 22, scope: !527)
!542 = !DILocation(line: 83, column: 37, scope: !527)
!543 = !DILocation(line: 83, column: 44, scope: !527)
!544 = distinct !DISubprogram(name: "clone", linkageName: "_ZN66_$LT$libc..unix..bsd..regmatch_t$u20$as$u20$core..clone..Clone$GT$5clone17hc2d05ef2cd82f4adE", scope: !545, file: !62, line: 83, type: !546, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !553)
!545 = !DINamespace(name: "{impl#23}", scope: !17)
!546 = !DISubroutineType(types: !547)
!547 = !{!548, !552}
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "regmatch_t", scope: !17, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !549, templateParams: !75, identifier: "b2a157eaac09961b8b5d3f6c7009620d")
!549 = !{!550, !551}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "rm_so", scope: !548, file: !8, baseType: !89, size: 64, align: 64, flags: DIFlagPublic)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "rm_eo", scope: !548, file: !8, baseType: !89, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::bsd::regmatch_t", baseType: !548, size: 64, align: 64, dwarfAddressSpace: 0)
!553 = !{!554}
!554 = !DILocalVariable(name: "self", arg: 1, scope: !544, file: !62, line: 83, type: !552)
!555 = !DILocation(line: 83, column: 22, scope: !544)
!556 = !DILocation(line: 83, column: 37, scope: !544)
!557 = !DILocation(line: 83, column: 44, scope: !544)
!558 = distinct !DISubprogram(name: "clone", linkageName: "_ZN62_$LT$libc..unix..bsd..option$u20$as$u20$core..clone..Clone$GT$5clone17h2e979e5664476cb1E", scope: !559, file: !62, line: 83, type: !560, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !570)
!559 = !DINamespace(name: "{impl#25}", scope: !17)
!560 = !DISubroutineType(types: !561)
!561 = !{!562, !569}
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "option", scope: !17, file: !8, size: 256, align: 64, flags: DIFlagPublic, elements: !563, templateParams: !75, identifier: "1877967a7e144208d6332804c6fbcebf")
!563 = !{!564, !565, !566, !568}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !562, file: !8, baseType: !536, size: 64, align: 64, flags: DIFlagPublic)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !562, file: !8, baseType: !105, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !562, file: !8, baseType: !567, size: 64, align: 64, offset: 128, flags: DIFlagPublic)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut i32", baseType: !105, size: 64, align: 64, dwarfAddressSpace: 0)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !562, file: !8, baseType: !105, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::bsd::option", baseType: !562, size: 64, align: 64, dwarfAddressSpace: 0)
!570 = !{!571}
!571 = !DILocalVariable(name: "self", arg: 1, scope: !558, file: !62, line: 83, type: !569)
!572 = !DILocation(line: 83, column: 22, scope: !558)
!573 = !DILocation(line: 83, column: 37, scope: !558)
!574 = !DILocation(line: 83, column: 44, scope: !558)
!575 = distinct !DISubprogram(name: "clone", linkageName: "_ZN67_$LT$libc..unix..bsd..sockaddr_un$u20$as$u20$core..clone..Clone$GT$5clone17h829c993aa8280979E", scope: !576, file: !62, line: 114, type: !577, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !588)
!576 = !DINamespace(name: "{impl#27}", scope: !17)
!577 = !DISubroutineType(types: !578)
!578 = !{!579, !587}
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_un", scope: !17, file: !8, size: 848, align: 8, flags: DIFlagPublic, elements: !580, templateParams: !75, identifier: "a14479458e5ef83bbd79054016251312")
!580 = !{!581, !582, !583}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "sun_len", scope: !579, file: !8, baseType: !11, size: 8, align: 8, flags: DIFlagPublic)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "sun_family", scope: !579, file: !8, baseType: !11, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "sun_path", scope: !579, file: !8, baseType: !584, size: 832, align: 8, offset: 16, flags: DIFlagPublic)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 832, align: 8, elements: !585)
!585 = !{!586}
!586 = !DISubrange(count: 104, lowerBound: 0)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::bsd::sockaddr_un", baseType: !579, size: 64, align: 64, dwarfAddressSpace: 0)
!588 = !{!589}
!589 = !DILocalVariable(name: "self", arg: 1, scope: !575, file: !62, line: 114, type: !587)
!590 = !DILocation(line: 114, column: 22, scope: !575)
!591 = !DILocation(line: 114, column: 37, scope: !575)
!592 = !DILocation(line: 114, column: 44, scope: !575)
!593 = distinct !DISubprogram(name: "clone", linkageName: "_ZN63_$LT$libc..unix..bsd..utsname$u20$as$u20$core..clone..Clone$GT$5clone17h0495069a35119046E", scope: !594, file: !62, line: 114, type: !595, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !608)
!594 = !DINamespace(name: "{impl#29}", scope: !17)
!595 = !DISubroutineType(types: !596)
!596 = !{!597, !607}
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "utsname", scope: !17, file: !8, size: 10240, align: 8, flags: DIFlagPublic, elements: !598, templateParams: !75, identifier: "2ba1c1c81ebb403b85fb1a5680ab0f35")
!598 = !{!599, !603, !604, !605, !606}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "sysname", scope: !597, file: !8, baseType: !600, size: 2048, align: 8, flags: DIFlagPublic)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 2048, align: 8, elements: !601)
!601 = !{!602}
!602 = !DISubrange(count: 256, lowerBound: 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "nodename", scope: !597, file: !8, baseType: !600, size: 2048, align: 8, offset: 2048, flags: DIFlagPublic)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !597, file: !8, baseType: !600, size: 2048, align: 8, offset: 4096, flags: DIFlagPublic)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !597, file: !8, baseType: !600, size: 2048, align: 8, offset: 6144, flags: DIFlagPublic)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !597, file: !8, baseType: !600, size: 2048, align: 8, offset: 8192, flags: DIFlagPublic)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::bsd::utsname", baseType: !597, size: 64, align: 64, dwarfAddressSpace: 0)
!608 = !{!609}
!609 = !DILocalVariable(name: "self", arg: 1, scope: !593, file: !62, line: 114, type: !607)
!610 = !DILocation(line: 114, column: 22, scope: !593)
!611 = !DILocation(line: 114, column: 37, scope: !593)
!612 = !DILocation(line: 114, column: 44, scope: !593)
!613 = distinct !DISubprogram(name: "clone", linkageName: "_ZN71_$LT$libc..unix..bsd..apple..timezone$u20$as$u20$core..clone..Clone$GT$5clone17h1daf7524a4785607E", scope: !615, file: !614, line: 166, type: !616, scopeLine: 166, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !622)
!614 = !DIFile(filename: "src/unix/bsd/apple/mod.rs", directory: "/private/var/folders/m6/nyw0tbd5239gngtm06pzykr00000gn/T/.tmpPXbnuW/libc", checksumkind: CSK_MD5, checksum: "e8e532b42774bf364300fe5421dce507")
!615 = !DINamespace(name: "{impl#1}", scope: !16)
!616 = !DISubroutineType(types: !617)
!617 = !{null, !618}
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::bsd::apple::timezone", baseType: !619, size: 64, align: 64, dwarfAddressSpace: 0)
!619 = !DICompositeType(tag: DW_TAG_structure_type, name: "timezone", scope: !16, file: !8, align: 8, flags: DIFlagPublic, elements: !620, templateParams: !75, identifier: "fab91f4b819c43bddfef63b4a1f3d521")
!620 = !{!621}
!621 = !DICompositeType(tag: DW_TAG_variant_part, scope: !619, file: !8, align: 8, elements: !75, identifier: "5fdd8d4bd484b87022ceb295d8f3fde")
!622 = !{!623}
!623 = !DILocalVariable(name: "self", arg: 1, scope: !613, file: !614, line: 166, type: !618)
!624 = !DILocation(line: 166, column: 14, scope: !613)
!625 = !DILocation(line: 168, column: 6, scope: !613)
!626 = distinct !DISubprogram(name: "clone", linkageName: "_ZN74_$LT$libc..unix..bsd..apple..qos_class_t$u20$as$u20$core..clone..Clone$GT$5clone17h088a74227783fea5E", scope: !627, file: !614, line: 183, type: !628, scopeLine: 183, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !631)
!627 = !DINamespace(name: "{impl#3}", scope: !16)
!628 = !DISubroutineType(types: !629)
!629 = !{!15, !630}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::bsd::apple::qos_class_t", baseType: !15, size: 64, align: 64, dwarfAddressSpace: 0)
!631 = !{!632}
!632 = !DILocalVariable(name: "self", arg: 1, scope: !626, file: !614, line: 183, type: !630)
!633 = !DILocation(line: 183, column: 14, scope: !626)
!634 = !DILocation(line: 184, column: 9, scope: !626)
!635 = !{i32 0, i32 34}
!636 = !DILocation(line: 185, column: 6, scope: !626)
!637 = distinct !DISubprogram(name: "clone", linkageName: "_ZN93_$LT$libc..unix..bsd..apple..sysdir_search_path_directory_t$u20$as$u20$core..clone..Clone$GT$5clone17h733c0c7578983355E", scope: !638, file: !614, line: 218, type: !639, scopeLine: 218, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !642)
!638 = !DINamespace(name: "{impl#5}", scope: !16)
!639 = !DISubroutineType(types: !640)
!640 = !{!28, !641}
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::bsd::apple::sysdir_search_path_directory_t", baseType: !28, size: 64, align: 64, dwarfAddressSpace: 0)
!642 = !{!643}
!643 = !DILocalVariable(name: "self", arg: 1, scope: !637, file: !614, line: 218, type: !641)
!644 = !DILocation(line: 218, column: 14, scope: !637)
!645 = !DILocation(line: 219, column: 9, scope: !637)
!646 = !{i32 1, i32 102}
!647 = !DILocation(line: 220, column: 6, scope: !637)
!648 = distinct !DISubprogram(name: "clone", linkageName: "_ZN95_$LT$libc..unix..bsd..apple..sysdir_search_path_domain_mask_t$u20$as$u20$core..clone..Clone$GT$5clone17he3c3ed1b0f795973E", scope: !649, file: !614, line: 234, type: !650, scopeLine: 234, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !653)
!649 = !DINamespace(name: "{impl#7}", scope: !16)
!650 = !DISubroutineType(types: !651)
!651 = !{!54, !652}
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::bsd::apple::sysdir_search_path_domain_mask_t", baseType: !54, size: 64, align: 64, dwarfAddressSpace: 0)
!653 = !{!654}
!654 = !DILocalVariable(name: "self", arg: 1, scope: !648, file: !614, line: 234, type: !652)
!655 = !DILocation(line: 234, column: 14, scope: !648)
!656 = !DILocation(line: 235, column: 9, scope: !648)
!657 = !{i32 1, i32 65536}
!658 = !DILocation(line: 236, column: 6, scope: !648)
!659 = distinct !DISubprogram(name: "si_addr", linkageName: "_ZN4libc4unix3bsd5apple9siginfo_t7si_addr17h131c8d49d9234bacE", scope: !660, file: !614, line: 1479, type: !673, scopeLine: 1479, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, declaration: !676, retainedNodes: !677)
!660 = !DICompositeType(tag: DW_TAG_structure_type, name: "siginfo_t", scope: !16, file: !8, size: 832, align: 64, flags: DIFlagPublic, elements: !661, templateParams: !75, identifier: "db1be8ada02565a390fa0c7feb1bc3a0")
!661 = !{!662, !663, !664, !665, !666, !667, !668, !669}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !660, file: !8, baseType: !105, size: 32, align: 32, flags: DIFlagPublic)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !660, file: !8, baseType: !105, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !660, file: !8, baseType: !105, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !660, file: !8, baseType: !105, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !660, file: !8, baseType: !20, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !660, file: !8, baseType: !105, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !660, file: !8, baseType: !214, size: 64, align: 64, offset: 192, flags: DIFlagPublic)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !660, file: !8, baseType: !670, size: 576, align: 64, offset: 256, flags: DIFlagPrivate)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 576, align: 64, elements: !671)
!671 = !{!672}
!672 = !DISubrange(count: 9, lowerBound: 0)
!673 = !DISubroutineType(types: !674)
!674 = !{!214, !675}
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::bsd::apple::siginfo_t", baseType: !660, size: 64, align: 64, dwarfAddressSpace: 0)
!676 = !DISubprogram(name: "si_addr", linkageName: "_ZN4libc4unix3bsd5apple9siginfo_t7si_addr17h131c8d49d9234bacE", scope: !660, file: !614, line: 1479, type: !673, scopeLine: 1479, flags: DIFlagPrototyped, spFlags: 0, templateParams: !75)
!677 = !{!678}
!678 = !DILocalVariable(name: "self", arg: 1, scope: !659, file: !614, line: 1479, type: !675)
!679 = !DILocation(line: 1479, column: 27, scope: !659)
!680 = !DILocation(line: 1480, column: 9, scope: !659)
!681 = !DILocation(line: 1481, column: 6, scope: !659)
!682 = distinct !DISubprogram(name: "si_value", linkageName: "_ZN4libc4unix3bsd5apple9siginfo_t8si_value17hf52b940d1c4c2282E", scope: !660, file: !614, line: 1483, type: !683, scopeLine: 1483, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, declaration: !685, retainedNodes: !686)
!683 = !DISubroutineType(types: !684)
!684 = !{!274, !675}
!685 = !DISubprogram(name: "si_value", linkageName: "_ZN4libc4unix3bsd5apple9siginfo_t8si_value17hf52b940d1c4c2282E", scope: !660, file: !614, line: 1483, type: !683, scopeLine: 1483, flags: DIFlagPrototyped, spFlags: 0, templateParams: !75)
!686 = !{!687}
!687 = !DILocalVariable(name: "self", arg: 1, scope: !682, file: !614, line: 1483, type: !675)
!688 = !DILocation(line: 1483, column: 28, scope: !682)
!689 = !DILocation(line: 1496, column: 9, scope: !682)
!690 = !DILocation(line: 1497, column: 6, scope: !682)
!691 = distinct !DISubprogram(name: "si_pid", linkageName: "_ZN4libc4unix3bsd5apple9siginfo_t6si_pid17hbc72082daf84ddbcE", scope: !660, file: !614, line: 1499, type: !692, scopeLine: 1499, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, declaration: !694, retainedNodes: !695)
!692 = !DISubroutineType(types: !693)
!693 = !{!105, !675}
!694 = !DISubprogram(name: "si_pid", linkageName: "_ZN4libc4unix3bsd5apple9siginfo_t6si_pid17hbc72082daf84ddbcE", scope: !660, file: !614, line: 1499, type: !692, scopeLine: 1499, flags: DIFlagPrototyped, spFlags: 0, templateParams: !75)
!695 = !{!696}
!696 = !DILocalVariable(name: "self", arg: 1, scope: !691, file: !614, line: 1499, type: !675)
!697 = !DILocation(line: 1499, column: 26, scope: !691)
!698 = !DILocation(line: 1500, column: 9, scope: !691)
!699 = !DILocation(line: 1501, column: 6, scope: !691)
!700 = distinct !DISubprogram(name: "si_uid", linkageName: "_ZN4libc4unix3bsd5apple9siginfo_t6si_uid17h6951bf7ecdedec57E", scope: !660, file: !614, line: 1503, type: !701, scopeLine: 1503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, declaration: !703, retainedNodes: !704)
!701 = !DISubroutineType(types: !702)
!702 = !{!20, !675}
!703 = !DISubprogram(name: "si_uid", linkageName: "_ZN4libc4unix3bsd5apple9siginfo_t6si_uid17h6951bf7ecdedec57E", scope: !660, file: !614, line: 1503, type: !701, scopeLine: 1503, flags: DIFlagPrototyped, spFlags: 0, templateParams: !75)
!704 = !{!705}
!705 = !DILocalVariable(name: "self", arg: 1, scope: !700, file: !614, line: 1503, type: !675)
!706 = !DILocation(line: 1503, column: 26, scope: !700)
!707 = !DILocation(line: 1504, column: 9, scope: !700)
!708 = !DILocation(line: 1505, column: 6, scope: !700)
!709 = distinct !DISubprogram(name: "si_status", linkageName: "_ZN4libc4unix3bsd5apple9siginfo_t9si_status17h60c2c135ff58d895E", scope: !660, file: !614, line: 1507, type: !692, scopeLine: 1507, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, declaration: !710, retainedNodes: !711)
!710 = !DISubprogram(name: "si_status", linkageName: "_ZN4libc4unix3bsd5apple9siginfo_t9si_status17h60c2c135ff58d895E", scope: !660, file: !614, line: 1507, type: !692, scopeLine: 1507, flags: DIFlagPrototyped, spFlags: 0, templateParams: !75)
!711 = !{!712}
!712 = !DILocalVariable(name: "self", arg: 1, scope: !709, file: !614, line: 1507, type: !675)
!713 = !DILocation(line: 1507, column: 29, scope: !709)
!714 = !DILocation(line: 1508, column: 9, scope: !709)
!715 = !DILocation(line: 1509, column: 6, scope: !709)
!716 = distinct !DISubprogram(name: "__DARWIN_ALIGN32", linkageName: "_ZN4libc4unix3bsd5apple16__DARWIN_ALIGN3217ha2a8433e1ff6a578E", scope: !16, file: !614, line: 5274, type: !717, scopeLine: 5274, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !719)
!717 = !DISubroutineType(types: !718)
!718 = !{!216, !216}
!719 = !{!720}
!720 = !DILocalVariable(name: "p", arg: 1, scope: !716, file: !614, line: 5274, type: !216)
!721 = !DILocation(line: 5274, column: 27, scope: !716)
!722 = !DILocation(line: 5276, column: 5, scope: !716)
!723 = !DILocation(line: 5277, column: 2, scope: !716)
!724 = distinct !DISubprogram(name: "mach_task_self", linkageName: "_ZN4libc4unix3bsd5apple14mach_task_self17hb4a9a779c6570d6dE", scope: !16, file: !614, line: 6233, type: !725, scopeLine: 6233, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75)
!725 = !DISubroutineType(types: !726)
!726 = !{!20}
!727 = !DILocation(line: 6234, column: 5, scope: !724)
!728 = !DILocation(line: 6235, column: 2, scope: !724)
!729 = distinct !DISubprogram(name: "clone", linkageName: "_ZN70_$LT$libc..unix..bsd..apple..ip_mreq$u20$as$u20$core..clone..Clone$GT$5clone17h74c1ab7085494a91E", scope: !730, file: !62, line: 83, type: !731, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !741)
!730 = !DINamespace(name: "{impl#10}", scope: !16)
!731 = !DISubroutineType(types: !732)
!732 = !{!733, !740}
!733 = !DICompositeType(tag: DW_TAG_structure_type, name: "ip_mreq", scope: !16, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !734, templateParams: !75, identifier: "f6bd04d40f2a9799c9e2fe8893b71d14")
!734 = !{!735, !739}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "imr_multiaddr", scope: !733, file: !8, baseType: !736, size: 32, align: 32, flags: DIFlagPublic)
!736 = !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", scope: !16, file: !8, size: 32, align: 32, flags: DIFlagPublic, elements: !737, templateParams: !75, identifier: "585d3a6db792c0686903044b054f1791")
!737 = !{!738}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !736, file: !8, baseType: !20, size: 32, align: 32, flags: DIFlagPublic)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "imr_interface", scope: !733, file: !8, baseType: !736, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::bsd::apple::ip_mreq", baseType: !733, size: 64, align: 64, dwarfAddressSpace: 0)
!741 = !{!742}
!742 = !DILocalVariable(name: "self", arg: 1, scope: !729, file: !62, line: 83, type: !740)
!743 = !DILocation(line: 83, column: 22, scope: !729)
!744 = !DILocation(line: 83, column: 37, scope: !729)
!745 = !DILocation(line: 83, column: 44, scope: !729)
!746 = distinct !DISubprogram(name: "clone", linkageName: "_ZN71_$LT$libc..unix..bsd..apple..ip_mreqn$u20$as$u20$core..clone..Clone$GT$5clone17h0eeb7eb52e6f462bE", scope: !747, file: !62, line: 83, type: !748, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !756)
!747 = !DINamespace(name: "{impl#12}", scope: !16)
!748 = !DISubroutineType(types: !749)
!749 = !{!750, !755}
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "ip_mreqn", scope: !16, file: !8, size: 96, align: 32, flags: DIFlagPublic, elements: !751, templateParams: !75, identifier: "6ac4e0eb2eadc562a999c3b655a2557a")
!751 = !{!752, !753, !754}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "imr_multiaddr", scope: !750, file: !8, baseType: !736, size: 32, align: 32, flags: DIFlagPublic)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "imr_address", scope: !750, file: !8, baseType: !736, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "imr_ifindex", scope: !750, file: !8, baseType: !105, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::bsd::apple::ip_mreqn", baseType: !750, size: 64, align: 64, dwarfAddressSpace: 0)
!756 = !{!757}
!757 = !DILocalVariable(name: "self", arg: 1, scope: !746, file: !62, line: 83, type: !755)
!758 = !DILocation(line: 83, column: 22, scope: !746)
!759 = !DILocation(line: 83, column: 37, scope: !746)
!760 = !DILocation(line: 83, column: 44, scope: !746)
!761 = distinct !DISubprogram(name: "clone", linkageName: "_ZN77_$LT$libc..unix..bsd..apple..ip_mreq_source$u20$as$u20$core..clone..Clone$GT$5clone17hb4bd54698e6f027eE", scope: !762, file: !62, line: 83, type: !763, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !771)
!762 = !DINamespace(name: "{impl#14}", scope: !16)
!763 = !DISubroutineType(types: !764)
!764 = !{!765, !770}
!765 = !DICompositeType(tag: DW_TAG_structure_type, name: "ip_mreq_source", scope: !16, file: !8, size: 96, align: 32, flags: DIFlagPublic, elements: !766, templateParams: !75, identifier: "1751eaa7b797cb38ceca695c7ec93d1d")
!766 = !{!767, !768, !769}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "imr_multiaddr", scope: !765, file: !8, baseType: !736, size: 32, align: 32, flags: DIFlagPublic)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "imr_sourceaddr", scope: !765, file: !8, baseType: !736, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "imr_interface", scope: !765, file: !8, baseType: !736, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::bsd::apple::ip_mreq_source", baseType: !765, size: 64, align: 64, dwarfAddressSpace: 0)
!771 = !{!772}
!772 = !DILocalVariable(name: "self", arg: 1, scope: !761, file: !62, line: 83, type: !770)
!773 = !DILocation(line: 83, column: 22, scope: !761)
!774 = !DILocation(line: 83, column: 37, scope: !761)
!775 = !DILocation(line: 83, column: 44, scope: !761)
!776 = distinct !DISubprogram(name: "clone", linkageName: "_ZN68_$LT$libc..unix..bsd..apple..aiocb$u20$as$u20$core..clone..Clone$GT$5clone17h0e7cdfa6334111b7E", scope: !777, file: !62, line: 83, type: !778, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !806)
!777 = !DINamespace(name: "{impl#16}", scope: !16)
!778 = !DISubroutineType(types: !779)
!779 = !{!780, !805}
!780 = !DICompositeType(tag: DW_TAG_structure_type, name: "aiocb", scope: !16, file: !8, size: 640, align: 64, flags: DIFlagPublic, elements: !781, templateParams: !75, identifier: "538ab0129387cd95c6eb878187b4d7c1")
!781 = !{!782, !783, !784, !785, !786, !787, !804}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "aio_fildes", scope: !780, file: !8, baseType: !105, size: 32, align: 32, flags: DIFlagPublic)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "aio_offset", scope: !780, file: !8, baseType: !89, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "aio_buf", scope: !780, file: !8, baseType: !214, size: 64, align: 64, offset: 128, flags: DIFlagPublic)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "aio_nbytes", scope: !780, file: !8, baseType: !216, size: 64, align: 64, offset: 192, flags: DIFlagPublic)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "aio_reqprio", scope: !780, file: !8, baseType: !105, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "aio_sigevent", scope: !780, file: !8, baseType: !788, size: 256, align: 64, offset: 320, flags: DIFlagPublic)
!788 = !DICompositeType(tag: DW_TAG_structure_type, name: "sigevent", scope: !16, file: !8, size: 256, align: 64, flags: DIFlagPublic, elements: !789, templateParams: !75, identifier: "30e1f3055155aa6d30052818c6ddf23c")
!789 = !{!790, !791, !792, !793, !794}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_notify", scope: !788, file: !8, baseType: !105, size: 32, align: 32, flags: DIFlagPublic)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_signo", scope: !788, file: !8, baseType: !105, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_value", scope: !788, file: !8, baseType: !274, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "__unused1", scope: !788, file: !8, baseType: !214, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_notify_attributes", scope: !788, file: !8, baseType: !795, size: 64, align: 64, offset: 192, flags: DIFlagPublic)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut libc::unix::bsd::apple::b64::pthread_attr_t", baseType: !796, size: 64, align: 64, dwarfAddressSpace: 0)
!796 = !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_attr_t", scope: !797, file: !8, size: 512, align: 64, flags: DIFlagPublic, elements: !798, templateParams: !75, identifier: "44daec28b61a58ed7f1f03de4fff3476")
!797 = !DINamespace(name: "b64", scope: !16)
!798 = !{!799, !800}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !796, file: !8, baseType: !89, size: 64, align: 64, flags: DIFlagPrivate)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !796, file: !8, baseType: !801, size: 448, align: 8, offset: 64, flags: DIFlagPrivate)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 448, align: 8, elements: !802)
!802 = !{!803}
!803 = !DISubrange(count: 56, lowerBound: 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "aio_lio_opcode", scope: !780, file: !8, baseType: !105, size: 32, align: 32, offset: 576, flags: DIFlagPublic)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::bsd::apple::aiocb", baseType: !780, size: 64, align: 64, dwarfAddressSpace: 0)
!806 = !{!807}
!807 = !DILocalVariable(name: "self", arg: 1, scope: !776, file: !62, line: 83, type: !805)
!808 = !DILocation(line: 83, column: 22, scope: !776)
!809 = !DILocation(line: 83, column: 37, scope: !776)
!810 = !DILocation(line: 83, column: 44, scope: !776)
!811 = distinct !DISubprogram(name: "clone", linkageName: "_ZN69_$LT$libc..unix..bsd..apple..glob_t$u20$as$u20$core..clone..Clone$GT$5clone17he37d1f2473a060fcE", scope: !812, file: !62, line: 83, type: !813, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !829)
!812 = !DINamespace(name: "{impl#18}", scope: !16)
!813 = !DISubroutineType(types: !814)
!814 = !{!815, !828}
!815 = !DICompositeType(tag: DW_TAG_structure_type, name: "glob_t", scope: !16, file: !8, size: 704, align: 64, flags: DIFlagPublic, elements: !816, templateParams: !75, identifier: "3bae55a9e0e2f74141e4bdb9187d4942")
!816 = !{!817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "gl_pathc", scope: !815, file: !8, baseType: !216, size: 64, align: 64, flags: DIFlagPublic)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "__unused1", scope: !815, file: !8, baseType: !105, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "gl_offs", scope: !815, file: !8, baseType: !216, size: 64, align: 64, offset: 128, flags: DIFlagPublic)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "__unused2", scope: !815, file: !8, baseType: !105, size: 32, align: 32, offset: 192, flags: DIFlagPrivate)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "gl_pathv", scope: !815, file: !8, baseType: !74, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "__unused3", scope: !815, file: !8, baseType: !214, size: 64, align: 64, offset: 320, flags: DIFlagPrivate)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "__unused4", scope: !815, file: !8, baseType: !214, size: 64, align: 64, offset: 384, flags: DIFlagPrivate)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "__unused5", scope: !815, file: !8, baseType: !214, size: 64, align: 64, offset: 448, flags: DIFlagPrivate)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "__unused6", scope: !815, file: !8, baseType: !214, size: 64, align: 64, offset: 512, flags: DIFlagPrivate)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "__unused7", scope: !815, file: !8, baseType: !214, size: 64, align: 64, offset: 576, flags: DIFlagPrivate)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "__unused8", scope: !815, file: !8, baseType: !214, size: 64, align: 64, offset: 640, flags: DIFlagPrivate)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::bsd::apple::glob_t", baseType: !815, size: 64, align: 64, dwarfAddressSpace: 0)
!829 = !{!830}
!830 = !DILocalVariable(name: "self", arg: 1, scope: !811, file: !62, line: 83, type: !828)
!831 = !DILocation(line: 83, column: 22, scope: !811)
!832 = !DILocation(line: 83, column: 37, scope: !811)
!833 = !DILocation(line: 83, column: 44, scope: !811)
!834 = distinct !DISubprogram(name: "clone", linkageName: "_ZN71_$LT$libc..unix..bsd..apple..addrinfo$u20$as$u20$core..clone..Clone$GT$5clone17h4b707a061fad9901E", scope: !835, file: !62, line: 83, type: !836, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !850)
!835 = !DINamespace(name: "{impl#20}", scope: !16)
!836 = !DISubroutineType(types: !837)
!837 = !{!838, !849}
!838 = !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", scope: !16, file: !8, size: 384, align: 64, flags: DIFlagPublic, elements: !839, templateParams: !75, identifier: "5367ff369b6e015a42c079ed15f9ba32")
!839 = !{!840, !841, !842, !843, !844, !845, !846, !847}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !838, file: !8, baseType: !105, size: 32, align: 32, flags: DIFlagPublic)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !838, file: !8, baseType: !105, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !838, file: !8, baseType: !105, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !838, file: !8, baseType: !105, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !838, file: !8, baseType: !20, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !838, file: !8, baseType: !69, size: 64, align: 64, offset: 192, flags: DIFlagPublic)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !838, file: !8, baseType: !413, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !838, file: !8, baseType: !848, size: 64, align: 64, offset: 320, flags: DIFlagPublic)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut libc::unix::bsd::apple::addrinfo", baseType: !838, size: 64, align: 64, dwarfAddressSpace: 0)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::bsd::apple::addrinfo", baseType: !838, size: 64, align: 64, dwarfAddressSpace: 0)
!850 = !{!851}
!851 = !DILocalVariable(name: "self", arg: 1, scope: !834, file: !62, line: 83, type: !849)
!852 = !DILocation(line: 83, column: 22, scope: !834)
!853 = !DILocation(line: 83, column: 37, scope: !834)
!854 = !DILocation(line: 83, column: 44, scope: !834)
!855 = distinct !DISubprogram(name: "clone", linkageName: "_ZN67_$LT$libc..unix..bsd..apple..stat$u20$as$u20$core..clone..Clone$GT$5clone17h7c5a01c4e97339e1E", scope: !856, file: !62, line: 83, type: !857, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !885)
!856 = !DINamespace(name: "{impl#22}", scope: !16)
!857 = !DISubroutineType(types: !858)
!858 = !{!859, !884}
!859 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat", scope: !16, file: !8, size: 1152, align: 64, flags: DIFlagPublic, elements: !860, templateParams: !75, identifier: "921441eb3d690e8948579eccf588c9da")
!860 = !{!861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !859, file: !8, baseType: !105, size: 32, align: 32, flags: DIFlagPublic)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !859, file: !8, baseType: !246, size: 16, align: 16, offset: 32, flags: DIFlagPublic)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !859, file: !8, baseType: !246, size: 16, align: 16, offset: 48, flags: DIFlagPublic)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !859, file: !8, baseType: !133, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !859, file: !8, baseType: !20, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !859, file: !8, baseType: !20, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !859, file: !8, baseType: !105, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "st_atime", scope: !859, file: !8, baseType: !89, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "st_atime_nsec", scope: !859, file: !8, baseType: !89, size: 64, align: 64, offset: 320, flags: DIFlagPublic)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtime", scope: !859, file: !8, baseType: !89, size: 64, align: 64, offset: 384, flags: DIFlagPublic)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtime_nsec", scope: !859, file: !8, baseType: !89, size: 64, align: 64, offset: 448, flags: DIFlagPublic)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctime", scope: !859, file: !8, baseType: !89, size: 64, align: 64, offset: 512, flags: DIFlagPublic)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctime_nsec", scope: !859, file: !8, baseType: !89, size: 64, align: 64, offset: 576, flags: DIFlagPublic)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "st_birthtime", scope: !859, file: !8, baseType: !89, size: 64, align: 64, offset: 640, flags: DIFlagPublic)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "st_birthtime_nsec", scope: !859, file: !8, baseType: !89, size: 64, align: 64, offset: 704, flags: DIFlagPublic)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !859, file: !8, baseType: !89, size: 64, align: 64, offset: 768, flags: DIFlagPublic)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !859, file: !8, baseType: !89, size: 64, align: 64, offset: 832, flags: DIFlagPublic)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !859, file: !8, baseType: !105, size: 32, align: 32, offset: 896, flags: DIFlagPublic)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "st_flags", scope: !859, file: !8, baseType: !20, size: 32, align: 32, offset: 928, flags: DIFlagPublic)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "st_gen", scope: !859, file: !8, baseType: !20, size: 32, align: 32, offset: 960, flags: DIFlagPublic)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "st_lspare", scope: !859, file: !8, baseType: !105, size: 32, align: 32, offset: 992, flags: DIFlagPublic)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "st_qspare", scope: !859, file: !8, baseType: !883, size: 128, align: 64, offset: 1024, flags: DIFlagPublic)
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 128, align: 64, elements: !505)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::bsd::apple::stat", baseType: !859, size: 64, align: 64, dwarfAddressSpace: 0)
!885 = !{!886}
!886 = !DILocalVariable(name: "self", arg: 1, scope: !855, file: !62, line: 83, type: !884)
!887 = !DILocation(line: 83, column: 22, scope: !855)
!888 = !DILocation(line: 83, column: 37, scope: !855)
!889 = !DILocation(line: 83, column: 44, scope: !855)
!890 = distinct !DISubprogram(name: "clone", linkageName: "_ZN82_$LT$libc..unix..bsd..apple..pthread_mutexattr_t$u20$as$u20$core..clone..Clone$GT$5clone17h48cc287657fbdde4E", scope: !891, file: !62, line: 83, type: !892, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !902)
!891 = !DINamespace(name: "{impl#24}", scope: !16)
!892 = !DISubroutineType(types: !893)
!893 = !{!894, !901}
!894 = !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_mutexattr_t", scope: !16, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !895, templateParams: !75, identifier: "89dd09286a80759fc5d160dc64ac365b")
!895 = !{!896, !897}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !894, file: !8, baseType: !89, size: 64, align: 64, flags: DIFlagPrivate)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !894, file: !8, baseType: !898, size: 64, align: 8, offset: 64, flags: DIFlagPrivate)
!898 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 64, align: 8, elements: !899)
!899 = !{!900}
!900 = !DISubrange(count: 8, lowerBound: 0)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::bsd::apple::pthread_mutexattr_t", baseType: !894, size: 64, align: 64, dwarfAddressSpace: 0)
!902 = !{!903}
!903 = !DILocalVariable(name: "self", arg: 1, scope: !890, file: !62, line: 83, type: !901)
!904 = !DILocation(line: 83, column: 22, scope: !890)
!905 = !DILocation(line: 83, column: 37, scope: !890)
!906 = !DILocation(line: 83, column: 44, scope: !890)
!907 = distinct !DISubprogram(name: "clone", linkageName: "_ZN81_$LT$libc..unix..bsd..apple..pthread_condattr_t$u20$as$u20$core..clone..Clone$GT$5clone17hdb68379625191378E", scope: !908, file: !62, line: 83, type: !909, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !916)
!908 = !DINamespace(name: "{impl#26}", scope: !16)
!909 = !DISubroutineType(types: !910)
!910 = !{!911, !915}
!911 = !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_condattr_t", scope: !16, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !912, templateParams: !75, identifier: "351976ee6c316bb31c086cc51ed54abe")
!912 = !{!913, !914}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !911, file: !8, baseType: !89, size: 64, align: 64, flags: DIFlagPrivate)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !911, file: !8, baseType: !898, size: 64, align: 8, offset: 64, flags: DIFlagPrivate)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::bsd::apple::pthread_condattr_t", baseType: !911, size: 64, align: 64, dwarfAddressSpace: 0)
!916 = !{!917}
!917 = !DILocalVariable(name: "self", arg: 1, scope: !907, file: !62, line: 83, type: !915)
!918 = !DILocation(line: 83, column: 22, scope: !907)
!919 = !DILocation(line: 83, column: 37, scope: !907)
!920 = !DILocation(line: 83, column: 44, scope: !907)
!921 = distinct !DISubprogram(name: "clone", linkageName: "_ZN83_$LT$libc..unix..bsd..apple..pthread_rwlockattr_t$u20$as$u20$core..clone..Clone$GT$5clone17h3d49b1ec8d1d332fE", scope: !922, file: !62, line: 83, type: !923, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !930)
!922 = !DINamespace(name: "{impl#28}", scope: !16)
!923 = !DISubroutineType(types: !924)
!924 = !{!925, !929}
!925 = !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_rwlockattr_t", scope: !16, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !926, templateParams: !75, identifier: "9846dfebe905ca1660a059394385c72b")
!926 = !{!927, !928}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !925, file: !8, baseType: !89, size: 64, align: 64, flags: DIFlagPrivate)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !925, file: !8, baseType: !180, size: 128, align: 8, offset: 64, flags: DIFlagPrivate)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::bsd::apple::pthread_rwlockattr_t", baseType: !925, size: 64, align: 64, dwarfAddressSpace: 0)
!930 = !{!931}
!931 = !DILocalVariable(name: "self", arg: 1, scope: !921, file: !62, line: 83, type: !929)
!932 = !DILocation(line: 83, column: 22, scope: !921)
!933 = !DILocation(line: 83, column: 37, scope: !921)
!934 = !DILocation(line: 83, column: 44, scope: !921)
!935 = distinct !DISubprogram(name: "clone", linkageName: "_ZN72_$LT$libc..unix..bsd..apple..siginfo_t$u20$as$u20$core..clone..Clone$GT$5clone17h81f87d06aacae25eE", scope: !936, file: !62, line: 83, type: !937, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !939)
!936 = !DINamespace(name: "{impl#30}", scope: !16)
!937 = !DISubroutineType(types: !938)
!938 = !{!660, !675}
!939 = !{!940}
!940 = !DILocalVariable(name: "self", arg: 1, scope: !935, file: !62, line: 83, type: !675)
!941 = !DILocation(line: 83, column: 22, scope: !935)
!942 = !DILocation(line: 83, column: 37, scope: !935)
!943 = !DILocation(line: 83, column: 44, scope: !935)
!944 = distinct !DISubprogram(name: "clone", linkageName: "_ZN72_$LT$libc..unix..bsd..apple..sigaction$u20$as$u20$core..clone..Clone$GT$5clone17h6fecaca6f8e3e7faE", scope: !945, file: !62, line: 83, type: !946, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !75, retainedNodes: !954)
!945 = !DINamespace(name: "{impl#32}", scope: !16)
!946 = !DISubroutineType(types: !947)
!947 = !{!948, !953}
