; ModuleID = '12xa34wcmc7wj7gn'
source_filename = "12xa34wcmc7wj7gn"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128"
target triple = "arm64-apple-macosx11.0.0"

%"{closure@core::iter::adapters::map::map_fold<proc_macro2::TokenTree, proc_macro2::TokenTree, (), {closure@src/runtime.rs:277:22: 277:29}, {closure@core::iter::traits::iterator::Iterator::for_each::call<proc_macro2::TokenTree, {closure@<proc_macro2::fallback::TokenStream as core::iter::traits::collect::Extend<proc_macro2::TokenTree>>::extend<core::iter::adapters::map::Map<proc_macro2::token_stream::IntoIter, {closure@src/runtime.rs:277:22: 277:29}>>::{closure#0}}>::{closure#0}}>::{closure#0}}" = type { ptr, ptr }
%"proc_macro2::token_stream::IntoIter" = type { %"proc_macro2::imp::TokenTreeIter", %"proc_macro2::marker::ProcMacroAutoTraits" }
%"proc_macro2::imp::TokenTreeIter" = type { i64, [4 x i64] }
%"proc_macro2::marker::ProcMacroAutoTraits" = type { %"core::marker::PhantomData<alloc::rc::Rc<()>>" }
%"core::marker::PhantomData<alloc::rc::Rc<()>>" = type {}
%"{closure@<proc_macro2::TokenStream as core::iter::traits::collect::Extend<proc_macro2::TokenStream>>::extend<core::iter::sources::once::Once<proc_macro2::TokenStream>>::{closure#0}}" = type {}
%"core::iter::sources::once::Once<proc_macro2::TokenStream>" = type { %"core::option::IntoIter<proc_macro2::TokenStream>" }
%"core::option::IntoIter<proc_macro2::TokenStream>" = type { %"core::option::Item<proc_macro2::TokenStream>" }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<proc_macro2::LexError as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<proc_macro2::LexError as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !27, identifier: "1231ed71c0c106739b50e637c1e35a0")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "LexError", scope: !13, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !14, templateParams: !27, identifier: "612bdfce5ab52d1d3191e5ef2af5d23f")
!13 = !DINamespace(name: "proc_macro2", scope: null)
!14 = !{!15, !41}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !12, file: !2, baseType: !16, size: 8, align: 8, flags: DIFlagPrivate)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "LexError", scope: !17, file: !2, size: 8, align: 8, flags: DIFlagProtected, elements: !18, templateParams: !27, identifier: "f8b1873b1eec1afae95620c77d0ca65f")
!17 = !DINamespace(name: "imp", scope: !13)
!18 = !{!19}
!19 = !DICompositeType(tag: DW_TAG_variant_part, scope: !16, file: !2, size: 8, align: 8, elements: !20, templateParams: !27, identifier: "5bbdab55a014180ee3fb711358f0ca7f", discriminator: !39)
!20 = !{!21, !28, !37}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "Compiler", scope: !19, file: !2, baseType: !22, size: 8, align: 8, extraData: i128 0)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "Compiler", scope: !16, file: !2, size: 8, align: 8, flags: DIFlagProtected, elements: !23, templateParams: !27, identifier: "c46e66ae2c8b1bde545d3053887093c2")
!23 = !{!24}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !22, file: !2, baseType: !25, align: 8, offset: 8, flags: DIFlagProtected)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "LexError", scope: !26, file: !2, align: 8, flags: DIFlagPublic, elements: !27, identifier: "638d1cd8099c24d93011d3b71d7052a8")
!26 = !DINamespace(name: "proc_macro", scope: null)
!27 = !{}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "Fallback", scope: !19, file: !2, baseType: !29, size: 8, align: 8, extraData: i128 1)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "Fallback", scope: !16, file: !2, size: 8, align: 8, flags: DIFlagProtected, elements: !30, templateParams: !27, identifier: "3eda29cfb9c261ee96864fd6830c25b0")
!30 = !{!31}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !29, file: !2, baseType: !32, align: 8, offset: 8, flags: DIFlagProtected)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "LexError", scope: !33, file: !2, align: 8, flags: DIFlagProtected, elements: !34, templateParams: !27, identifier: "9592d4291ca2510a2ca6c9d7651c09e4")
!33 = !DINamespace(name: "fallback", scope: !13)
!34 = !{!35}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "span", scope: !32, file: !2, baseType: !36, align: 8, flags: DIFlagProtected)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "Span", scope: !33, file: !2, align: 8, flags: DIFlagProtected, elements: !27, identifier: "18c4a270ada430d432089438f4b34e79")
!37 = !DIDerivedType(tag: DW_TAG_member, name: "CompilerPanic", scope: !19, file: !2, baseType: !38, size: 8, align: 8, extraData: i128 2)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "CompilerPanic", scope: !16, file: !2, size: 8, align: 8, flags: DIFlagProtected, elements: !27, identifier: "7faa4434de15bac5be1eae61f08abbc6")
!39 = !DIDerivedType(tag: DW_TAG_member, scope: !16, file: !2, baseType: !40, size: 8, align: 8, flags: DIFlagArtificial)
!40 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !12, file: !2, baseType: !42, align: 8, offset: 8, flags: DIFlagPrivate)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProcMacroAutoTraits", scope: !43, file: !2, align: 8, flags: DIFlagProtected, elements: !44, templateParams: !27, identifier: "a6f1879fc007b7207556925adcb6747b")
!43 = !DINamespace(name: "marker", scope: !13)
!44 = !{!45}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !42, file: !2, baseType: !46, align: 8, flags: DIFlagPrivate)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::rc::Rc<(), alloc::alloc::Global>>", scope: !47, file: !2, align: 8, flags: DIFlagPublic, elements: !27, templateParams: !49, identifier: "1ae0c2fab8a3901baf141ad61949ca83")
!47 = !DINamespace(name: "marker", scope: !48)
!48 = !DINamespace(name: "core", scope: null)
!49 = !{!50}
!50 = !DITemplateTypeParameter(name: "T", type: !51)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rc<(), alloc::alloc::Global>", scope: !52, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !54, templateParams: !85, identifier: "e108861514fd4b392ea8903548dafd49")
!52 = !DINamespace(name: "rc", scope: !53)
!53 = !DINamespace(name: "alloc", scope: null)
!54 = !{!55, !80, !82}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !51, file: !2, baseType: !56, size: 64, align: 64, flags: DIFlagPrivate)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::rc::RcBox<()>>", scope: !57, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !59, templateParams: !78, identifier: "49f01bb4de16b2fa43c2b259cd4a150a")
!57 = !DINamespace(name: "non_null", scope: !58)
!58 = !DINamespace(name: "ptr", scope: !48)
!59 = !{!60}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !56, file: !2, baseType: !61, size: 64, align: 64, flags: DIFlagPrivate)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::rc::RcBox<()>", baseType: !62, size: 64, align: 64, dwarfAddressSpace: 0)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "RcBox<()>", scope: !52, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !63, templateParams: !76, identifier: "1b080e07e8883e4b7050f2566f374977")
!63 = !{!64, !74, !75}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !62, file: !2, baseType: !65, size: 64, align: 64, flags: DIFlagPrivate)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<usize>", scope: !66, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !67, templateParams: !72, identifier: "f4ce6b172bbab0a95f26028a66e0e0")
!66 = !DINamespace(name: "cell", scope: !48)
!67 = !{!68}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !65, file: !2, baseType: !69, size: 64, align: 64, flags: DIFlagPrivate)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !66, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !70, templateParams: !72, identifier: "b9cc5c0458370c6defd001b9936cd7c")
!70 = !{!71}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !69, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!72 = !{!73}
!73 = !DITemplateTypeParameter(name: "T", type: !9)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !62, file: !2, baseType: !65, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !62, file: !2, baseType: !7, align: 8, offset: 128, flags: DIFlagPrivate)
!76 = !{!77}
!77 = !DITemplateTypeParameter(name: "T", type: !7)
!78 = !{!79}
!79 = !DITemplateTypeParameter(name: "T", type: !62)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !51, file: !2, baseType: !81, align: 8, offset: 64, flags: DIFlagPrivate)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::rc::RcBox<()>>", scope: !47, file: !2, align: 8, flags: DIFlagPublic, elements: !27, templateParams: !78, identifier: "d87b8c72c02ee8b517ae57091a228fd")
!82 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !51, file: !2, baseType: !83, align: 8, offset: 64, flags: DIFlagPrivate)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !84, file: !2, align: 8, flags: DIFlagPublic, elements: !27, identifier: "565e9af856f873ca6c6565cfe9042298")
!84 = !DINamespace(name: "alloc", scope: !53)
!85 = !{!77, !86}
!86 = !DITemplateTypeParameter(name: "A", type: !83)
!87 = !{i32 8, !"PIC Level", i32 2}
!88 = !{i32 2, !"Dwarf Version", i32 4}
!89 = !{i32 2, !"Debug Info Version", i32 3}
!90 = !{!"rustc version 1.78.0-nightly (46b180ec2 2024-03-08)"}
!91 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !92, producer: "clang LLVM (rustc version 1.78.0-nightly (46b180ec2 2024-03-08))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !93, globals: !187, splitDebugInlining: false, nameTableKind: None)
!92 = !DIFile(filename: "src/lib.rs/@/12xa34wcmc7wj7gn", directory: "/private/var/folders/m6/nyw0tbd5239gngtm06pzykr00000gn/T/.tmpPXbnuW/quote")
!93 = !{!94, !100, !101, !105, !113, !181}
!94 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Delimiter", scope: !26, file: !2, baseType: !40, size: 8, align: 8, flags: DIFlagEnumClass, elements: !95)
!95 = !{!96, !97, !98, !99}
!96 = !DIEnumerator(name: "Parenthesis", value: 0, isUnsigned: true)
!97 = !DIEnumerator(name: "Brace", value: 1, isUnsigned: true)
!98 = !DIEnumerator(name: "Bracket", value: 2, isUnsigned: true)
!99 = !DIEnumerator(name: "None", value: 3, isUnsigned: true)
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Delimiter", scope: !13, file: !2, baseType: !40, size: 8, align: 8, flags: DIFlagEnumClass, elements: !95)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Spacing", scope: !13, file: !2, baseType: !40, size: 8, align: 8, flags: DIFlagEnumClass, elements: !102)
!102 = !{!103, !104}
!103 = !DIEnumerator(name: "Alone", value: 0, isUnsigned: true)
!104 = !DIEnumerator(name: "Joint", value: 1, isUnsigned: true)
!105 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !106, file: !2, baseType: !40, size: 8, align: 8, flags: DIFlagEnumClass, elements: !108)
!106 = !DINamespace(name: "rt", scope: !107)
!107 = !DINamespace(name: "fmt", scope: !48)
!108 = !{!109, !110, !111, !112}
!109 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!110 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!111 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!112 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!113 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AlignmentEnum", scope: !114, file: !2, baseType: !115, size: 64, align: 64, flags: DIFlagEnumClass, elements: !116)
!114 = !DINamespace(name: "alignment", scope: !58)
!115 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180}
!117 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!118 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!119 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!120 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!121 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!122 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!123 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!124 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!125 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!126 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!127 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!128 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!129 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!130 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!131 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!132 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!133 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!134 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!135 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!136 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!137 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!138 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!139 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!140 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!141 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!142 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!143 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!144 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!145 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!146 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!147 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!148 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!149 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!150 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!151 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!152 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!153 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!154 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!155 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!156 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!157 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!158 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!159 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!160 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!161 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!162 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!163 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!164 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!165 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!166 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!167 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!168 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!169 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!170 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!171 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!172 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!173 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!174 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!175 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!176 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!177 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!178 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!179 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!180 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!181 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !182, file: !2, baseType: !40, size: 8, align: 8, flags: DIFlagEnumClass, elements: !183)
!182 = !DINamespace(name: "panicking", scope: !48)
!183 = !{!184, !185, !186}
!184 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!185 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!186 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!187 = !{!0}
!188 = distinct !DISubprogram(name: "fold<proc_macro2::TokenTree, proc_macro2::token_stream::IntoIter, quote::__private::respan_token_tree::{closure_env#0}, (), core::iter::traits::iterator::Iterator::for_each::call::{closure_env#0}<proc_macro2::TokenTree, proc_macro2::fallback::{impl#13}::extend::{closure_env#0}<core::iter::adapters::map::Map<proc_macro2::token_stream::IntoIter, quote::__private::respan_token_tree::{closure_env#0}>>>>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4fold17h5bc4820989c0a316E", scope: !190, file: !189, line: 125, type: !194, scopeLine: 125, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !91, templateParams: !629, retainedNodes: !625)
!189 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/iter/adapters/map.rs", directory: "", checksumkind: CSK_MD5, checksum: "b96b61197ceb3b53a13be432e7aff20e")
!190 = !DINamespace(name: "{impl#2}", scope: !191)
!191 = !DINamespace(name: "map", scope: !192)
!192 = !DINamespace(name: "adapters", scope: !193)
!193 = !DINamespace(name: "iter", scope: !48)
!194 = !DISubroutineType(types: !195)
!195 = !{null, !196, !7, !607}
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map<proc_macro2::token_stream::IntoIter, quote::__private::respan_token_tree::{closure_env#0}>", scope: !191, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !197, templateParams: !604, identifier: "954b1e64f572fa5a2406c9b26c778707")
!197 = !{!198, !596}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !196, file: !2, baseType: !199, size: 320, align: 64, flags: DIFlagProtected)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "IntoIter", scope: !200, file: !2, size: 320, align: 64, flags: DIFlagPublic, elements: !201, templateParams: !27, identifier: "fd57c2f65a49169830cdb800b008632d")
!200 = !DINamespace(name: "token_stream", scope: !13)
!201 = !{!202, !595}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !199, file: !2, baseType: !203, size: 320, align: 64, flags: DIFlagPrivate)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "TokenTreeIter", scope: !17, file: !2, size: 320, align: 64, flags: DIFlagProtected, elements: !204, templateParams: !27, identifier: "1d0df01c2b99ca4f82f7e705106ee4a6")
!204 = !{!205}
!205 = !DICompositeType(tag: DW_TAG_variant_part, scope: !203, file: !2, size: 320, align: 64, elements: !206, templateParams: !27, identifier: "9f3d41296a215a40fd58d77d905e58ae", discriminator: !594)
!206 = !{!207, !381}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "Compiler", scope: !205, file: !2, baseType: !208, size: 320, align: 64, extraData: i128 0)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "Compiler", scope: !203, file: !2, size: 320, align: 64, flags: DIFlagProtected, elements: !209, templateParams: !27, identifier: "5d4483bd2d238fa755e7c87822292dde")
!209 = !{!210}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !208, file: !2, baseType: !211, size: 256, align: 64, offset: 64, flags: DIFlagProtected)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "IntoIter", scope: !212, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !213, templateParams: !27, identifier: "ff11b004fb6216b139024ae00b6fc7")
!212 = !DINamespace(name: "token_stream", scope: !26)
!213 = !{!214}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !211, file: !2, baseType: !215, size: 256, align: 64, flags: DIFlagPrivate)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "IntoIter<proc_macro::bridge::TokenTree<proc_macro::bridge::client::TokenStream, proc_macro::bridge::client::Span, proc_macro::bridge::symbol::Symbol>, alloc::alloc::Global>", scope: !216, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !218, templateParams: !380, identifier: "58648b2546b6f21eec0b6a51507cca8")
!216 = !DINamespace(name: "into_iter", scope: !217)
!217 = !DINamespace(name: "vec", scope: !53)
!218 = !{!219, !367, !369, !370, !378, !379}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !215, file: !2, baseType: !220, size: 64, align: 64, flags: DIFlagProtected)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<proc_macro::bridge::TokenTree<proc_macro::bridge::client::TokenStream, proc_macro::bridge::client::Span, proc_macro::bridge::symbol::Symbol>>", scope: !57, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !221, templateParams: !365, identifier: "b86cb1df0aecf4672e2c29964ca914f5")
!221 = !{!222}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !220, file: !2, baseType: !223, size: 64, align: 64, flags: DIFlagPrivate)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const proc_macro::bridge::TokenTree<proc_macro::bridge::client::TokenStream, proc_macro::bridge::client::Span, proc_macro::bridge::symbol::Symbol>", baseType: !224, size: 64, align: 64, dwarfAddressSpace: 0)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "TokenTree<proc_macro::bridge::client::TokenStream, proc_macro::bridge::client::Span, proc_macro::bridge::symbol::Symbol>", scope: !225, file: !2, size: 160, align: 32, flags: DIFlagPublic, elements: !226, templateParams: !27, identifier: "9e0f65992f3f036377ec24e7d6547bd4")
!225 = !DINamespace(name: "bridge", scope: !26)
!226 = !{!227}
!227 = !DICompositeType(tag: DW_TAG_variant_part, scope: !224, file: !2, size: 160, align: 32, elements: !228, templateParams: !27, identifier: "a87b0d19b17e28c1c0bc81fb8245f1f8", discriminator: !364)
!228 = !{!229, !288, !298, !308}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "Group", scope: !227, file: !2, baseType: !230, size: 160, align: 32)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", scope: !224, file: !2, size: 160, align: 32, flags: DIFlagPublic, elements: !231, templateParams: !282, identifier: "214fddf6226d5d80dc41ee992cb5b8ca")
!231 = !{!232}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !230, file: !2, baseType: !233, size: 160, align: 32, flags: DIFlagPublic)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group<proc_macro::bridge::client::TokenStream, proc_macro::bridge::client::Span>", scope: !225, file: !2, size: 160, align: 32, flags: DIFlagPublic, elements: !234, templateParams: !280, identifier: "c464d594469032c712d9b6fb2a13e3ce")
!234 = !{!235, !236, !268}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "delimiter", scope: !233, file: !2, baseType: !94, size: 8, align: 8, offset: 128, flags: DIFlagPublic)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !233, file: !2, baseType: !237, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<proc_macro::bridge::client::TokenStream>", scope: !238, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !239, templateParams: !27, identifier: "3bd44a3c4fbd13be5ce0d89fbb4d4a4a")
!238 = !DINamespace(name: "option", scope: !48)
!239 = !{!240}
!240 = !DICompositeType(tag: DW_TAG_variant_part, scope: !237, file: !2, size: 32, align: 32, elements: !241, templateParams: !27, identifier: "7614480fb2dad92b18bd6eb5fe6ab987", discriminator: !267)
!241 = !{!242, !263}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !240, file: !2, baseType: !243, size: 32, align: 32, extraData: i128 0)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !237, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !27, templateParams: !244, identifier: "112588dceb44d0cf237a936394d8f6a3")
!244 = !{!245}
!245 = !DITemplateTypeParameter(name: "T", type: !246)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "TokenStream", scope: !247, file: !2, size: 32, align: 32, flags: DIFlagProtected, elements: !248, templateParams: !27, identifier: "a61bc219586479364af9e1f3fe246dbf")
!247 = !DINamespace(name: "client", scope: !225)
!248 = !{!249, !258}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !246, file: !2, baseType: !250, size: 32, align: 32, flags: DIFlagPrivate)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonZero<u32>", scope: !251, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !253, templateParams: !256, identifier: "40352b0e2af2cbfe210ecaa67d165701")
!251 = !DINamespace(name: "nonzero", scope: !252)
!252 = !DINamespace(name: "num", scope: !48)
!253 = !{!254}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !250, file: !2, baseType: !255, size: 32, align: 32, flags: DIFlagPrivate)
!255 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!256 = !{!257}
!257 = !DITemplateTypeParameter(name: "T", type: !255)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !246, file: !2, baseType: !259, align: 8, offset: 32, flags: DIFlagPrivate)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<*mut ()>", scope: !47, file: !2, align: 8, flags: DIFlagPublic, elements: !27, templateParams: !260, identifier: "30cac01b602e7591d5bed376674f0e9")
!260 = !{!261}
!261 = !DITemplateTypeParameter(name: "T", type: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !240, file: !2, baseType: !264, size: 32, align: 32)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !237, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !265, templateParams: !244, identifier: "cd981e87dbcfaddf9d84d3b4c78ef0b7")
!265 = !{!266}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !264, file: !2, baseType: !246, size: 32, align: 32, flags: DIFlagPublic)
!267 = !DIDerivedType(tag: DW_TAG_member, scope: !237, file: !2, baseType: !255, size: 32, align: 32, flags: DIFlagArtificial)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "span", scope: !233, file: !2, baseType: !269, size: 96, align: 32, flags: DIFlagPublic)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "DelimSpan<proc_macro::bridge::client::Span>", scope: !225, file: !2, size: 96, align: 32, flags: DIFlagPublic, elements: !270, templateParams: !278, identifier: "8612c577900f96f54d2080d3d69f149f")
!270 = !{!271, !276, !277}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !269, file: !2, baseType: !272, size: 32, align: 32, flags: DIFlagPublic)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "Span", scope: !247, file: !2, size: 32, align: 32, flags: DIFlagProtected, elements: !273, templateParams: !27, identifier: "6bb681e1b2f9d98eb7a39ba4f5af0030")
!273 = !{!274, !275}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !272, file: !2, baseType: !250, size: 32, align: 32, flags: DIFlagPrivate)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !272, file: !2, baseType: !259, align: 8, offset: 32, flags: DIFlagPrivate)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !269, file: !2, baseType: !272, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "entire", scope: !269, file: !2, baseType: !272, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!278 = !{!279}
!279 = !DITemplateTypeParameter(name: "Span", type: !272)
!280 = !{!281, !279}
!281 = !DITemplateTypeParameter(name: "TokenStream", type: !246)
!282 = !{!281, !279, !283}
!283 = !DITemplateTypeParameter(name: "Symbol", type: !284)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "Symbol", scope: !285, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !286, templateParams: !27, identifier: "707f5785afc3b9d79e4f06af449ba394")
!285 = !DINamespace(name: "symbol", scope: !225)
!286 = !{!287}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !284, file: !2, baseType: !250, size: 32, align: 32, flags: DIFlagPrivate)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "Punct", scope: !227, file: !2, baseType: !289, size: 160, align: 32, extraData: i128 4)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "Punct", scope: !224, file: !2, size: 160, align: 32, flags: DIFlagPublic, elements: !290, templateParams: !282, identifier: "703964e6023c4a276edec456badcb2af")
!290 = !{!291}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !289, file: !2, baseType: !292, size: 64, align: 32, flags: DIFlagPublic)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "Punct<proc_macro::bridge::client::Span>", scope: !225, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !293, templateParams: !278, identifier: "52f6d02f7e4c4c6c557a86ad410bf212")
!293 = !{!294, !295, !297}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !292, file: !2, baseType: !40, size: 8, align: 8, offset: 32, flags: DIFlagPublic)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "joint", scope: !292, file: !2, baseType: !296, size: 8, align: 8, offset: 40, flags: DIFlagPublic)
!296 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "span", scope: !292, file: !2, baseType: !272, size: 32, align: 32, flags: DIFlagPublic)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "Ident", scope: !227, file: !2, baseType: !299, size: 160, align: 32, extraData: i128 5)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ident", scope: !224, file: !2, size: 160, align: 32, flags: DIFlagPublic, elements: !300, templateParams: !282, identifier: "ecdbc7daf848a14e2c4afd584ae7cdd1")
!300 = !{!301}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !299, file: !2, baseType: !302, size: 96, align: 32, flags: DIFlagPublic)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ident<proc_macro::bridge::client::Span, proc_macro::bridge::symbol::Symbol>", scope: !225, file: !2, size: 96, align: 32, flags: DIFlagPublic, elements: !303, templateParams: !307, identifier: "f586741c04d8557e490ab12ffa87aeb0")
!303 = !{!304, !305, !306}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !302, file: !2, baseType: !284, size: 32, align: 32, flags: DIFlagPublic)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "is_raw", scope: !302, file: !2, baseType: !296, size: 8, align: 8, offset: 64, flags: DIFlagPublic)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "span", scope: !302, file: !2, baseType: !272, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!307 = !{!279, !283}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Literal", scope: !227, file: !2, baseType: !309, size: 160, align: 32, extraData: i128 6)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "Literal", scope: !224, file: !2, size: 160, align: 32, flags: DIFlagPublic, elements: !310, templateParams: !282, identifier: "fa6e3c55d0bb5d1ec0aaf492e8e1f0be")
!310 = !{!311}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !309, file: !2, baseType: !312, size: 128, align: 32, flags: DIFlagPublic)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "Literal<proc_macro::bridge::client::Span, proc_macro::bridge::symbol::Symbol>", scope: !225, file: !2, size: 128, align: 32, flags: DIFlagPublic, elements: !313, templateParams: !307, identifier: "5d82b598002b5c1e52c2ee0ef825905e")
!313 = !{!314, !348, !349, !363}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !312, file: !2, baseType: !315, size: 16, align: 8, offset: 96, flags: DIFlagPublic)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "LitKind", scope: !225, file: !2, size: 16, align: 8, flags: DIFlagPublic, elements: !316, templateParams: !27, identifier: "4e29c5c3a7543cc59a7cae988d0ce37")
!316 = !{!317}
!317 = !DICompositeType(tag: DW_TAG_variant_part, scope: !315, file: !2, size: 16, align: 8, elements: !318, templateParams: !27, identifier: "4408e4113ce2bf119ccf717fd0b373ab", discriminator: !347)
!318 = !{!319, !321, !323, !325, !327, !329, !333, !335, !339, !341, !345}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "Byte", scope: !317, file: !2, baseType: !320, size: 16, align: 8, extraData: i128 0)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "Byte", scope: !315, file: !2, size: 16, align: 8, flags: DIFlagPublic, elements: !27, identifier: "cae326f20f394cd18dccee130a93b920")
!321 = !DIDerivedType(tag: DW_TAG_member, name: "Char", scope: !317, file: !2, baseType: !322, size: 16, align: 8, extraData: i128 1)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "Char", scope: !315, file: !2, size: 16, align: 8, flags: DIFlagPublic, elements: !27, identifier: "6cab80dcddc4e09784232570f958421b")
!323 = !DIDerivedType(tag: DW_TAG_member, name: "Integer", scope: !317, file: !2, baseType: !324, size: 16, align: 8, extraData: i128 2)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "Integer", scope: !315, file: !2, size: 16, align: 8, flags: DIFlagPublic, elements: !27, identifier: "5b0529c9925c519e7311a684eb5092d4")
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Float", scope: !317, file: !2, baseType: !326, size: 16, align: 8, extraData: i128 3)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "Float", scope: !315, file: !2, size: 16, align: 8, flags: DIFlagPublic, elements: !27, identifier: "9f2b218b8d66742729ca7e0e3c71274e")
!327 = !DIDerivedType(tag: DW_TAG_member, name: "Str", scope: !317, file: !2, baseType: !328, size: 16, align: 8, extraData: i128 4)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "Str", scope: !315, file: !2, size: 16, align: 8, flags: DIFlagPublic, elements: !27, identifier: "745b5df8de41112fb9d96d2756056ac0")
!329 = !DIDerivedType(tag: DW_TAG_member, name: "StrRaw", scope: !317, file: !2, baseType: !330, size: 16, align: 8, extraData: i128 5)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "StrRaw", scope: !315, file: !2, size: 16, align: 8, flags: DIFlagPublic, elements: !331, templateParams: !27, identifier: "76b5cfd27bc72128e20b03f429514d2")
!331 = !{!332}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !330, file: !2, baseType: !40, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "ByteStr", scope: !317, file: !2, baseType: !334, size: 16, align: 8, extraData: i128 6)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteStr", scope: !315, file: !2, size: 16, align: 8, flags: DIFlagPublic, elements: !27, identifier: "f1287df3549a65db6899db0e334041b1")
!335 = !DIDerivedType(tag: DW_TAG_member, name: "ByteStrRaw", scope: !317, file: !2, baseType: !336, size: 16, align: 8, extraData: i128 7)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteStrRaw", scope: !315, file: !2, size: 16, align: 8, flags: DIFlagPublic, elements: !337, templateParams: !27, identifier: "479c1596e5105497efc88f6bc9aea1d9")
!337 = !{!338}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !336, file: !2, baseType: !40, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "CStr", scope: !317, file: !2, baseType: !340, size: 16, align: 8, extraData: i128 8)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "CStr", scope: !315, file: !2, size: 16, align: 8, flags: DIFlagPublic, elements: !27, identifier: "b582f15111424ad8d70aeb3bad9fd680")
!341 = !DIDerivedType(tag: DW_TAG_member, name: "CStrRaw", scope: !317, file: !2, baseType: !342, size: 16, align: 8, extraData: i128 9)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "CStrRaw", scope: !315, file: !2, size: 16, align: 8, flags: DIFlagPublic, elements: !343, templateParams: !27, identifier: "4c903b7956547343c3b6754c3b38f807")
!343 = !{!344}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !342, file: !2, baseType: !40, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "ErrWithGuar", scope: !317, file: !2, baseType: !346, size: 16, align: 8, extraData: i128 10)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "ErrWithGuar", scope: !315, file: !2, size: 16, align: 8, flags: DIFlagPublic, elements: !27, identifier: "25cfb10e82fe53b03d6524d6cdc6704f")
!347 = !DIDerivedType(tag: DW_TAG_member, scope: !315, file: !2, baseType: !40, size: 8, align: 8, flags: DIFlagArtificial)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "symbol", scope: !312, file: !2, baseType: !284, size: 32, align: 32, flags: DIFlagPublic)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "suffix", scope: !312, file: !2, baseType: !350, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<proc_macro::bridge::symbol::Symbol>", scope: !238, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !351, templateParams: !27, identifier: "d645fd80c02b6b12796ffce6041254c7")
!351 = !{!352}
!352 = !DICompositeType(tag: DW_TAG_variant_part, scope: !350, file: !2, size: 32, align: 32, elements: !353, templateParams: !27, identifier: "7c47efc67e286ff8bb8b48deea833368", discriminator: !362)
!353 = !{!354, !358}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !352, file: !2, baseType: !355, size: 32, align: 32, extraData: i128 0)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !350, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !27, templateParams: !356, identifier: "21a94646d30667f88baf435a6279fc97")
!356 = !{!357}
!357 = !DITemplateTypeParameter(name: "T", type: !284)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !352, file: !2, baseType: !359, size: 32, align: 32)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !350, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !360, templateParams: !356, identifier: "4580d06ae79e99bc6d7f77b6788ca269")
!360 = !{!361}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !359, file: !2, baseType: !284, size: 32, align: 32, flags: DIFlagPublic)
!362 = !DIDerivedType(tag: DW_TAG_member, scope: !350, file: !2, baseType: !255, size: 32, align: 32, flags: DIFlagArtificial)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "span", scope: !312, file: !2, baseType: !272, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!364 = !DIDerivedType(tag: DW_TAG_member, scope: !224, file: !2, baseType: !40, size: 8, align: 8, offset: 128, flags: DIFlagArtificial)
!365 = !{!366}
!366 = !DITemplateTypeParameter(name: "T", type: !224)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !215, file: !2, baseType: !368, align: 8, offset: 256, flags: DIFlagProtected)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<proc_macro::bridge::TokenTree<proc_macro::bridge::client::TokenStream, proc_macro::bridge::client::Span, proc_macro::bridge::symbol::Symbol>>", scope: !47, file: !2, align: 8, flags: DIFlagPublic, elements: !27, templateParams: !365, identifier: "b6f440587b762fabfe3425c55e9ee74c")
!369 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !215, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagProtected)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !215, file: !2, baseType: !371, align: 8, offset: 256, flags: DIFlagProtected)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<alloc::alloc::Global>", scope: !372, file: !2, align: 8, flags: DIFlagPublic, elements: !374, templateParams: !376, identifier: "f5640ebe7221fe8cd986f06cf47d98d")
!372 = !DINamespace(name: "manually_drop", scope: !373)
!373 = !DINamespace(name: "mem", scope: !48)
!374 = !{!375}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !371, file: !2, baseType: !83, align: 8, flags: DIFlagPrivate)
!376 = !{!377}
!377 = !DITemplateTypeParameter(name: "T", type: !83)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !215, file: !2, baseType: !220, size: 64, align: 64, offset: 64, flags: DIFlagProtected)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !215, file: !2, baseType: !223, size: 64, align: 64, offset: 192, flags: DIFlagProtected)
!380 = !{!366, !86}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "Fallback", scope: !205, file: !2, baseType: !382, size: 320, align: 64, extraData: i128 1)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "Fallback", scope: !203, file: !2, size: 320, align: 64, flags: DIFlagProtected, elements: !383, templateParams: !27, identifier: "4f647ac1cd8652e6c08568a1f37129b3")
!383 = !{!384}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !382, file: !2, baseType: !385, size: 256, align: 64, offset: 64, flags: DIFlagProtected)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "RcVecIntoIter<proc_macro2::TokenTree>", scope: !386, file: !2, size: 256, align: 64, flags: DIFlagProtected, elements: !387, templateParams: !457, identifier: "9cfe0786dd4d4bacd70e9979976cbb5e")
!386 = !DINamespace(name: "rcvec", scope: !13)
!387 = !{!388}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !385, file: !2, baseType: !389, size: 256, align: 64, flags: DIFlagPrivate)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "IntoIter<proc_macro2::TokenTree, alloc::alloc::Global>", scope: !216, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !390, templateParams: !464, identifier: "64d20323ec247b19edfb389fc711853c")
!390 = !{!391, !589, !590, !591, !592, !593}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !389, file: !2, baseType: !392, size: 64, align: 64, flags: DIFlagProtected)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<proc_macro2::TokenTree>", scope: !57, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !393, templateParams: !457, identifier: "49b5f7369c5261ccca4761a2a0a8d0d8")
!393 = !{!394}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !392, file: !2, baseType: !395, size: 64, align: 64, flags: DIFlagPrivate)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const proc_macro2::TokenTree", baseType: !396, size: 64, align: 64, dwarfAddressSpace: 0)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "TokenTree", scope: !13, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !397, templateParams: !27, identifier: "897ea190a1034e68e03d1c11d81fa292")
!397 = !{!398}
!398 = !DICompositeType(tag: DW_TAG_variant_part, scope: !396, file: !2, size: 256, align: 64, elements: !399, templateParams: !27, identifier: "559ffd9bbd2aa84e5797433415d023d0", discriminator: !588)
!399 = !{!400, !476, !530, !560}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "Group", scope: !398, file: !2, baseType: !401, size: 256, align: 64, extraData: i128 9223372036854775809)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", scope: !396, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !402, templateParams: !27, identifier: "f1d108001df2ccecf3df338d318dd8e")
!402 = !{!403}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !401, file: !2, baseType: !404, size: 192, align: 64, offset: 64, flags: DIFlagPublic)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", scope: !13, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !405, templateParams: !27, identifier: "4f33714a4219f6c3c60801b174051460")
!405 = !{!406}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !404, file: !2, baseType: !407, size: 192, align: 64, flags: DIFlagPrivate)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", scope: !17, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !408, templateParams: !27, identifier: "2a250350a494069db6a7ed4f54496d18")
!408 = !{!409}
!409 = !DICompositeType(tag: DW_TAG_variant_part, scope: !407, file: !2, size: 192, align: 64, elements: !410, templateParams: !27, identifier: "373aadcff67db75a1731b915490d96f2", discriminator: !475)
!410 = !{!411, !418}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "Compiler", scope: !409, file: !2, baseType: !412, size: 192, align: 64, extraData: i128 0)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "Compiler", scope: !407, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !413, templateParams: !27, identifier: "18bf2138fe0c31bbbb89b7ce9bb8f3b")
!413 = !{!414}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !412, file: !2, baseType: !415, size: 160, align: 32, offset: 32, flags: DIFlagProtected)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", scope: !26, file: !2, size: 160, align: 32, flags: DIFlagPublic, elements: !416, templateParams: !27, identifier: "972da214f7ba9eb1919e338de5f1c146")
!416 = !{!417}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !415, file: !2, baseType: !233, size: 160, align: 32, flags: DIFlagPrivate)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "Fallback", scope: !409, file: !2, baseType: !419, size: 192, align: 64, extraData: i128 1)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "Fallback", scope: !407, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !420, templateParams: !27, identifier: "b7f22d4a43cd9589488c03ed2b390939")
!420 = !{!421}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !419, file: !2, baseType: !422, size: 128, align: 64, offset: 64, flags: DIFlagProtected)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", scope: !33, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !423, templateParams: !27, identifier: "78b1e50b1d602cbf397d66e3a53d97b4")
!423 = !{!424, !425, !474}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "delimiter", scope: !422, file: !2, baseType: !100, size: 8, align: 8, offset: 64, flags: DIFlagPrivate)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !422, file: !2, baseType: !426, size: 64, align: 64, flags: DIFlagPrivate)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "TokenStream", scope: !33, file: !2, size: 64, align: 64, flags: DIFlagProtected, elements: !427, templateParams: !27, identifier: "6080bfd57726df39bce05204adaac60c")
!427 = !{!428}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !426, file: !2, baseType: !429, size: 64, align: 64, flags: DIFlagPrivate)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "RcVec<proc_macro2::TokenTree>", scope: !386, file: !2, size: 64, align: 64, flags: DIFlagProtected, elements: !430, templateParams: !457, identifier: "98a56c378aeb2cbf97d06033cd65aa91")
!430 = !{!431}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !429, file: !2, baseType: !432, size: 64, align: 64, flags: DIFlagPrivate)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rc<alloc::vec::Vec<proc_macro2::TokenTree, alloc::alloc::Global>, alloc::alloc::Global>", scope: !52, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !433, templateParams: !473, identifier: "c35ae4c8ec4b43ca16fbe20ccd26d57e")
!433 = !{!434, !470, !472}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !432, file: !2, baseType: !435, size: 64, align: 64, flags: DIFlagPrivate)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::rc::RcBox<alloc::vec::Vec<proc_macro2::TokenTree, alloc::alloc::Global>>>", scope: !57, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !436, templateParams: !468, identifier: "45942e7b643f6944c92222372f3d88f9")
!436 = !{!437}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !435, file: !2, baseType: !438, size: 64, align: 64, flags: DIFlagPrivate)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::rc::RcBox<alloc::vec::Vec<proc_macro2::TokenTree, alloc::alloc::Global>>", baseType: !439, size: 64, align: 64, dwarfAddressSpace: 0)
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "RcBox<alloc::vec::Vec<proc_macro2::TokenTree, alloc::alloc::Global>>", scope: !52, file: !2, size: 320, align: 64, flags: DIFlagPrivate, elements: !440, templateParams: !466, identifier: "10cf92e480bd97b51b7b9a64e85a96c5")
!440 = !{!441, !442, !443}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !439, file: !2, baseType: !65, size: 64, align: 64, flags: DIFlagPrivate)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !439, file: !2, baseType: !65, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !439, file: !2, baseType: !444, size: 192, align: 64, offset: 128, flags: DIFlagPrivate)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<proc_macro2::TokenTree, alloc::alloc::Global>", scope: !217, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !445, templateParams: !464, identifier: "8443d7e4ebb03f644b9696c79fe10019")
!445 = !{!446, !465}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !444, file: !2, baseType: !447, size: 128, align: 64, flags: DIFlagPrivate)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<proc_macro2::TokenTree, alloc::alloc::Global>", scope: !448, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !449, templateParams: !464, identifier: "978dcef0ab1675ad6c5527f4524b7396")
!448 = !DINamespace(name: "raw_vec", scope: !53)
!449 = !{!450, !459, !463}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !447, file: !2, baseType: !451, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<proc_macro2::TokenTree>", scope: !452, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !453, templateParams: !457, identifier: "5a94401a88ea65896176154c39fbdcfc")
!452 = !DINamespace(name: "unique", scope: !58)
!453 = !{!454, !455}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !451, file: !2, baseType: !392, size: 64, align: 64, flags: DIFlagPrivate)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !451, file: !2, baseType: !456, align: 8, offset: 64, flags: DIFlagPrivate)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<proc_macro2::TokenTree>", scope: !47, file: !2, align: 8, flags: DIFlagPublic, elements: !27, templateParams: !457, identifier: "9d58e88b7c4f95448a68c3675a24f664")
!457 = !{!458}
!458 = !DITemplateTypeParameter(name: "T", type: !396)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !447, file: !2, baseType: !460, size: 64, align: 64, flags: DIFlagPrivate)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cap", scope: !448, file: !2, size: 64, align: 64, flags: DIFlagPrivate, elements: !461, templateParams: !27, identifier: "f6e0172a239b20d5c4e40f5321e726d6")
!461 = !{!462}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !460, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !447, file: !2, baseType: !83, align: 8, offset: 128, flags: DIFlagPrivate)
!464 = !{!458, !86}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !444, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!466 = !{!467}
!467 = !DITemplateTypeParameter(name: "T", type: !444)
!468 = !{!469}
!469 = !DITemplateTypeParameter(name: "T", type: !439)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !432, file: !2, baseType: !471, align: 8, offset: 64, flags: DIFlagPrivate)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::rc::RcBox<alloc::vec::Vec<proc_macro2::TokenTree, alloc::alloc::Global>>>", scope: !47, file: !2, align: 8, flags: DIFlagPublic, elements: !27, templateParams: !468, identifier: "f1739edf39f66844bc2e808688a6c4fb")
!472 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !432, file: !2, baseType: !83, align: 8, offset: 64, flags: DIFlagPrivate)
!473 = !{!467, !86}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "span", scope: !422, file: !2, baseType: !36, align: 8, offset: 72, flags: DIFlagPrivate)
!475 = !DIDerivedType(tag: DW_TAG_member, scope: !407, file: !2, baseType: !255, size: 32, align: 32, flags: DIFlagArtificial)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "Ident", scope: !398, file: !2, baseType: !477, size: 256, align: 64)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ident", scope: !396, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !478, templateParams: !27, identifier: "8d57230a8de10fede46d45bdfcd7e91e")
!478 = !{!479}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !477, file: !2, baseType: !480, size: 256, align: 64, flags: DIFlagPublic)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ident", scope: !13, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !481, templateParams: !27, identifier: "2c4897a7ecb925aa69e1a58f975b3825")
!481 = !{!482, !529}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !480, file: !2, baseType: !483, size: 256, align: 64, flags: DIFlagPrivate)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ident", scope: !17, file: !2, size: 256, align: 64, flags: DIFlagProtected, elements: !484, templateParams: !27, identifier: "7a01f45d673ee088fcce5ea1d65d0a42")
!484 = !{!485}
!485 = !DICompositeType(tag: DW_TAG_variant_part, scope: !483, file: !2, size: 256, align: 64, elements: !486, templateParams: !27, identifier: "9c291055eeae511f74ebf43259d42be6", discriminator: !528)
!486 = !{!487, !494}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "Compiler", scope: !485, file: !2, baseType: !488, size: 256, align: 64, extraData: i128 9223372036854775808)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "Compiler", scope: !483, file: !2, size: 256, align: 64, flags: DIFlagProtected, elements: !489, templateParams: !27, identifier: "ee185ba764ffd1e44d8a4b5304943d38")
!489 = !{!490}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !488, file: !2, baseType: !491, size: 96, align: 32, offset: 64, flags: DIFlagProtected)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ident", scope: !26, file: !2, size: 96, align: 32, flags: DIFlagPublic, elements: !492, templateParams: !27, identifier: "d62cecdcfdd0324de6d8de847827abb")
!492 = !{!493}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !491, file: !2, baseType: !302, size: 96, align: 32, flags: DIFlagPrivate)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "Fallback", scope: !485, file: !2, baseType: !495, size: 256, align: 64)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "Fallback", scope: !483, file: !2, size: 256, align: 64, flags: DIFlagProtected, elements: !496, templateParams: !27, identifier: "869870cb3b8331c55de579df0779421c")
!496 = !{!497}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !495, file: !2, baseType: !498, size: 256, align: 64, flags: DIFlagProtected)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ident", scope: !33, file: !2, size: 256, align: 64, flags: DIFlagProtected, elements: !499, templateParams: !27, identifier: "643057a8fd161eb768abf93aa5e84b8")
!499 = !{!500, !526, !527}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !498, file: !2, baseType: !501, size: 192, align: 64, flags: DIFlagPrivate)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "String", scope: !502, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !503, templateParams: !27, identifier: "9e169d31e3164680bba9b95f8fb78383")
!502 = !DINamespace(name: "string", scope: !53)
!503 = !{!504}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !501, file: !2, baseType: !505, size: 192, align: 64, flags: DIFlagPrivate)
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !217, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !506, templateParams: !524, identifier: "75493663ebbb7ddde98b0972cfe88517")
!506 = !{!507, !525}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !505, file: !2, baseType: !508, size: 128, align: 64, flags: DIFlagPrivate)
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !448, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !509, templateParams: !524, identifier: "46cd84c18a5643544a9147019d5a6d93")
!509 = !{!510, !522, !523}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !508, file: !2, baseType: !511, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !452, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !512, templateParams: !518, identifier: "9b0a3349739844f85f1609423a392ced")
!512 = !{!513, !520}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !511, file: !2, baseType: !514, size: 64, align: 64, flags: DIFlagPrivate)
!514 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !57, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !515, templateParams: !518, identifier: "e5aae4d783c62ca19d6192838800021b")
!515 = !{!516}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !514, file: !2, baseType: !517, size: 64, align: 64, flags: DIFlagPrivate)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !40, size: 64, align: 64, dwarfAddressSpace: 0)
!518 = !{!519}
!519 = !DITemplateTypeParameter(name: "T", type: !40)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !511, file: !2, baseType: !521, align: 8, offset: 64, flags: DIFlagPrivate)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !47, file: !2, align: 8, flags: DIFlagPublic, elements: !27, templateParams: !518, identifier: "d374584ddc3e1e4bf64f7a4ecd03e9bd")
!522 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !508, file: !2, baseType: !460, size: 64, align: 64, flags: DIFlagPrivate)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !508, file: !2, baseType: !83, align: 8, offset: 128, flags: DIFlagPrivate)
!524 = !{!519, !86}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !505, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "span", scope: !498, file: !2, baseType: !36, align: 8, offset: 200, flags: DIFlagPrivate)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !498, file: !2, baseType: !296, size: 8, align: 8, offset: 192, flags: DIFlagPrivate)
!528 = !DIDerivedType(tag: DW_TAG_member, scope: !483, file: !2, baseType: !115, size: 64, align: 64, flags: DIFlagArtificial)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !480, file: !2, baseType: !42, align: 8, offset: 256, flags: DIFlagPrivate)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "Punct", scope: !398, file: !2, baseType: !531, size: 256, align: 64, extraData: i128 9223372036854775811)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "Punct", scope: !396, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !532, templateParams: !27, identifier: "4a4d985b89753a3438e08159420de50a")
!532 = !{!533}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !531, file: !2, baseType: !534, size: 96, align: 32, offset: 64, flags: DIFlagPublic)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "Punct", scope: !13, file: !2, size: 96, align: 32, flags: DIFlagPublic, elements: !535, templateParams: !27, identifier: "6e3bf4edd921fa0c327b949f8eadc44a")
!535 = !{!536, !538, !539}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !534, file: !2, baseType: !537, size: 32, align: 32, flags: DIFlagPrivate)
!537 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "spacing", scope: !534, file: !2, baseType: !101, size: 8, align: 8, offset: 64, flags: DIFlagPrivate)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "span", scope: !534, file: !2, baseType: !540, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "Span", scope: !13, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !541, templateParams: !27, identifier: "be3c01ca88b8d183fdf7539bccb13413")
!541 = !{!542, !559}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !540, file: !2, baseType: !543, size: 32, align: 32, flags: DIFlagPrivate)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "Span", scope: !17, file: !2, size: 32, align: 32, flags: DIFlagProtected, elements: !544, templateParams: !27, identifier: "7106a0268da6e63bf30e0d51bd18dc0b")
!544 = !{!545}
!545 = !DICompositeType(tag: DW_TAG_variant_part, scope: !543, file: !2, size: 32, align: 32, elements: !546, templateParams: !27, identifier: "45ae638d555c790b656b0fcfcadc1f1e", discriminator: !558)
!546 = !{!547, !554}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "Compiler", scope: !545, file: !2, baseType: !548, size: 32, align: 32)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "Compiler", scope: !543, file: !2, size: 32, align: 32, flags: DIFlagProtected, elements: !549, templateParams: !27, identifier: "eb9ca64e3e8fc68c69f2402400d833b6")
!549 = !{!550}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !548, file: !2, baseType: !551, size: 32, align: 32, flags: DIFlagProtected)
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "Span", scope: !26, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !552, templateParams: !27, identifier: "a17500e505f819bdb6f61915d2b29703")
!552 = !{!553}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !551, file: !2, baseType: !272, size: 32, align: 32, flags: DIFlagPrivate)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "Fallback", scope: !545, file: !2, baseType: !555, size: 32, align: 32, extraData: i128 0)
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "Fallback", scope: !543, file: !2, size: 32, align: 32, flags: DIFlagProtected, elements: !556, templateParams: !27, identifier: "8f781a151894f27e7d913aec8285b7ad")
!556 = !{!557}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !555, file: !2, baseType: !36, align: 8, flags: DIFlagProtected)
!558 = !DIDerivedType(tag: DW_TAG_member, scope: !543, file: !2, baseType: !255, size: 32, align: 32, flags: DIFlagArtificial)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !540, file: !2, baseType: !42, align: 8, offset: 32, flags: DIFlagPrivate)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "Literal", scope: !398, file: !2, baseType: !561, size: 256, align: 64, extraData: i128 9223372036854775812)
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "Literal", scope: !396, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !562, templateParams: !27, identifier: "b20e5f207112669667396af3a93d688a")
!562 = !{!563}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !561, file: !2, baseType: !564, size: 192, align: 64, offset: 64, flags: DIFlagPublic)
!564 = !DICompositeType(tag: DW_TAG_structure_type, name: "Literal", scope: !13, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !565, templateParams: !27, identifier: "cd2312d13192b61a80a8895c7737c05a")
!565 = !{!566, !587}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !564, file: !2, baseType: !567, size: 192, align: 64, flags: DIFlagPrivate)
!567 = !DICompositeType(tag: DW_TAG_structure_type, name: "Literal", scope: !17, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !568, templateParams: !27, identifier: "75343d90f10366bb92fe352fc20ec8ea")
!568 = !{!569}
!569 = !DICompositeType(tag: DW_TAG_variant_part, scope: !567, file: !2, size: 192, align: 64, elements: !570, templateParams: !27, identifier: "7b093c560d5ac6c1ac76fec44b8b0a5", discriminator: !586)
!570 = !{!571, !578}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "Compiler", scope: !569, file: !2, baseType: !572, size: 192, align: 64, extraData: i128 9223372036854775808)
!572 = !DICompositeType(tag: DW_TAG_structure_type, name: "Compiler", scope: !567, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !573, templateParams: !27, identifier: "cd9ce65e9745b2ffca0c9c1011c6a912")
!573 = !{!574}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !572, file: !2, baseType: !575, size: 128, align: 32, offset: 64, flags: DIFlagProtected)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "Literal", scope: !26, file: !2, size: 128, align: 32, flags: DIFlagPublic, elements: !576, templateParams: !27, identifier: "383d9d681fbca55f5b6ddbb495a46b12")
!576 = !{!577}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !575, file: !2, baseType: !312, size: 128, align: 32, flags: DIFlagPrivate)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "Fallback", scope: !569, file: !2, baseType: !579, size: 192, align: 64)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "Fallback", scope: !567, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !580, templateParams: !27, identifier: "b672b49359fb823092aac8938266e585")
!580 = !{!581}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !579, file: !2, baseType: !582, size: 192, align: 64, flags: DIFlagProtected)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "Literal", scope: !33, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !583, templateParams: !27, identifier: "2b8a68b4b0e6ee62c5c89e7b9c6bb8d8")
!583 = !{!584, !585}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !582, file: !2, baseType: !501, size: 192, align: 64, flags: DIFlagPrivate)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "span", scope: !582, file: !2, baseType: !36, align: 8, offset: 192, flags: DIFlagPrivate)
!586 = !DIDerivedType(tag: DW_TAG_member, scope: !567, file: !2, baseType: !115, size: 64, align: 64, flags: DIFlagArtificial)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !564, file: !2, baseType: !42, align: 8, offset: 192, flags: DIFlagPrivate)
!588 = !DIDerivedType(tag: DW_TAG_member, scope: !396, file: !2, baseType: !115, size: 64, align: 64, flags: DIFlagArtificial)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !389, file: !2, baseType: !456, align: 8, offset: 256, flags: DIFlagProtected)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !389, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagProtected)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !389, file: !2, baseType: !371, align: 8, offset: 256, flags: DIFlagProtected)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !389, file: !2, baseType: !392, size: 64, align: 64, offset: 64, flags: DIFlagProtected)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !389, file: !2, baseType: !395, size: 64, align: 64, offset: 192, flags: DIFlagProtected)
!594 = !DIDerivedType(tag: DW_TAG_member, scope: !203, file: !2, baseType: !115, size: 64, align: 64, flags: DIFlagArtificial)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !199, file: !2, baseType: !42, align: 8, offset: 320, flags: DIFlagPrivate)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !196, file: !2, baseType: !597, size: 64, align: 64, offset: 320, flags: DIFlagPrivate)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !598, file: !2, size: 64, align: 64, elements: !601, templateParams: !27, identifier: "afa3d80cf255706362f52acb31c94189")
!598 = !DINamespace(name: "respan_token_tree", scope: !599)
!599 = !DINamespace(name: "__private", scope: !600)
!600 = !DINamespace(name: "quote", scope: null)
!601 = !{!602}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__span", scope: !597, file: !2, baseType: !603, size: 64, align: 64)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&proc_macro2::Span", baseType: !540, size: 64, align: 64, dwarfAddressSpace: 0)
!604 = !{!605, !606}
!605 = !DITemplateTypeParameter(name: "I", type: !199)
!606 = !DITemplateTypeParameter(name: "F", type: !597)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<proc_macro2::TokenTree, proc_macro2::fallback::{impl#13}::extend::{closure_env#0}<core::iter::adapters::map::Map<proc_macro2::token_stream::IntoIter, quote::__private::respan_token_tree::{closure_env#0}>>>", scope: !608, file: !2, size: 64, align: 64, elements: !613, templateParams: !27, identifier: "4ceed492198800724548a6de19401f4c")
!608 = !DINamespace(name: "call", scope: !609)
!609 = !DINamespace(name: "for_each", scope: !610)
!610 = !DINamespace(name: "Iterator", scope: !611)
!611 = !DINamespace(name: "iterator", scope: !612)
!612 = !DINamespace(name: "traits", scope: !193)
!613 = !{!614}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !607, file: !2, baseType: !615, size: 64, align: 64)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<core::iter::adapters::map::Map<proc_macro2::token_stream::IntoIter, quote::__private::respan_token_tree::{closure_env#0}>>", scope: !616, file: !2, size: 64, align: 64, elements: !618, templateParams: !27, identifier: "8311b1875b0ada8c8d5bc336fecd7ddd")
!616 = !DINamespace(name: "extend", scope: !617)
!617 = !DINamespace(name: "{impl#13}", scope: !33)
!618 = !{!619}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__vec", scope: !615, file: !2, baseType: !620, size: 64, align: 64)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut proc_macro2::rcvec::RcVecMut<proc_macro2::TokenTree>", baseType: !621, size: 64, align: 64, dwarfAddressSpace: 0)
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: "RcVecMut<proc_macro2::TokenTree>", scope: !386, file: !2, size: 64, align: 64, flags: DIFlagProtected, elements: !622, templateParams: !457, identifier: "57023bfab837f8211c1ade0fd65d7a50")
!622 = !{!623}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !621, file: !2, baseType: !624, size: 64, align: 64, flags: DIFlagPrivate)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut alloc::vec::Vec<proc_macro2::TokenTree, alloc::alloc::Global>", baseType: !444, size: 64, align: 64, dwarfAddressSpace: 0)
!625 = !{!626, !627, !628}
!626 = !DILocalVariable(name: "self", arg: 1, scope: !188, file: !189, line: 125, type: !196)
!627 = !DILocalVariable(name: "init", arg: 2, scope: !188, file: !189, line: 125, type: !7)
!628 = !DILocalVariable(name: "g", arg: 3, scope: !188, file: !189, line: 125, type: !607)
!629 = !{!630, !605, !606, !631, !632}
!630 = !DITemplateTypeParameter(name: "B", type: !396)
!631 = !DITemplateTypeParameter(name: "Acc", type: !7)
!632 = !DITemplateTypeParameter(name: "G", type: !607)
!633 = !DILocation(line: 125, column: 21, scope: !188)
!634 = !DILocation(line: 125, column: 27, scope: !188)
!635 = !DILocation(line: 125, column: 38, scope: !188)
!636 = !DILocalVariable(name: "g", arg: 2, scope: !637, file: !189, line: 87, type: !607)
!637 = distinct !DILexicalBlock(scope: !638, file: !189, line: 85, column: 1)
!638 = distinct !DISubprogram(name: "map_fold<proc_macro2::TokenTree, proc_macro2::TokenTree, (), quote::__private::respan_token_tree::{closure_env#0}, core::iter::traits::iterator::Iterator::for_each::call::{closure_env#0}<proc_macro2::TokenTree, proc_macro2::fallback::{impl#13}::extend::{closure_env#0}<core::iter::adapters::map::Map<proc_macro2::token_stream::IntoIter, quote::__private::respan_token_tree::{closure_env#0}>>>>", linkageName: "_ZN4core4iter8adapters3map8map_fold17h759c79f4597ec9deE", scope: !191, file: !189, line: 85, type: !639, scopeLine: 85, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !91, templateParams: !648, retainedNodes: !646)
!639 = !DISubroutineType(types: !640)
!640 = !{!641, !597, !607}
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<proc_macro2::TokenTree, proc_macro2::TokenTree, (), quote::__private::respan_token_tree::{closure_env#0}, core::iter::traits::iterator::Iterator::for_each::call::{closure_env#0}<proc_macro2::TokenTree, proc_macro2::fallback::{impl#13}::extend::{closure_env#0}<core::iter::adapters::map::Map<proc_macro2::token_stream::IntoIter, quote::__private::respan_token_tree::{closure_env#0}>>>>", scope: !642, file: !2, size: 128, align: 64, elements: !643, templateParams: !27, identifier: "1dd98cef2db83456eefd1a2feeb56f88")
!642 = !DINamespace(name: "map_fold", scope: !191)
!643 = !{!644, !645}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !641, file: !2, baseType: !607, size: 64, align: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !641, file: !2, baseType: !597, size: 64, align: 64, offset: 64)
!646 = !{!647, !636}
!647 = !DILocalVariable(name: "f", arg: 1, scope: !637, file: !189, line: 86, type: !597)
!648 = !{!458, !630, !631, !649, !650}
!649 = !DITemplateTypeParameter(name: "impl FnMut(T) -> B", type: !597)
!650 = !DITemplateTypeParameter(name: "impl FnMut(Acc, B) -> Acc", type: !607)
!651 = !DILocation(line: 87, column: 5, scope: !637, inlinedAt: !652)
!652 = !DILocation(line: 129, column: 30, scope: !188)
!653 = !DILocation(line: 129, column: 9, scope: !188)
!654 = !DILocation(line: 129, column: 39, scope: !188)
!655 = !{i64 4}
!656 = !DILocation(line: 86, column: 5, scope: !637, inlinedAt: !652)
!657 = !DILocation(line: 89, column: 5, scope: !637, inlinedAt: !652)
!658 = !{i64 8}
!659 = !DILocation(line: 130, column: 6, scope: !188)
!660 = distinct !DISubprogram(name: "fold<proc_macro2::imp::TokenStream, core::iter::sources::once::Once<proc_macro2::TokenStream>, proc_macro2::{impl#7}::extend::{closure_env#0}<core::iter::sources::once::Once<proc_macro2::TokenStream>>, (), core::iter::adapters::map::map_fold::{closure_env#0}<proc_macro2::imp::TokenStream, proc_macro::TokenStream, (), fn(proc_macro2::imp::TokenStream) -> proc_macro::TokenStream, core::iter::traits::iterator::Iterator::for_each::call::{closure_env#0}<proc_macro::TokenStream, proc_macro::{impl#22}::extend::{closure_env#0}<core::iter::adapters::map::Map<core::iter::adapters::map::Map<core::iter::sources::once::Once<proc_macro2::TokenStream>, proc_macro2::{impl#7}::extend::{closure_env#0}<core::iter::sources::once::Once<proc_macro2::TokenStream>>>, fn(proc_macro2::imp::TokenStream) -> proc_macro::TokenStream>>>>>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4fold17h62c68dba7766851fE", scope: !190, file: !189, line: 125, type: !661, scopeLine: 125, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !91, templateParams: !810, retainedNodes: !806)
!661 = !DISubroutineType(types: !662)
!662 = !{null, !663, !7, !768}
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map<core::iter::sources::once::Once<proc_macro2::TokenStream>, proc_macro2::{impl#7}::extend::{closure_env#0}<core::iter::sources::once::Once<proc_macro2::TokenStream>>>", scope: !191, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !664, templateParams: !765, identifier: "69098fb2ba4a77963e5f2fa041978198")
!664 = !{!665, !761}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !663, file: !2, baseType: !666, size: 256, align: 64, flags: DIFlagProtected)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<proc_macro2::TokenStream>", scope: !667, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !669, templateParams: !683, identifier: "4b3e6139f37c59e3d7d6f98d50cf5d70")
!667 = !DINamespace(name: "once", scope: !668)
!668 = !DINamespace(name: "sources", scope: !193)
!669 = !{!670}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !666, file: !2, baseType: !671, size: 256, align: 64, flags: DIFlagPrivate)
!671 = !DICompositeType(tag: DW_TAG_structure_type, name: "IntoIter<proc_macro2::TokenStream>", scope: !238, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !672, templateParams: !759, identifier: "3590344082dfa9fd3b2571330ff1badb")
!672 = !{!673}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !671, file: !2, baseType: !674, size: 256, align: 64, flags: DIFlagPrivate)
!674 = !DICompositeType(tag: DW_TAG_structure_type, name: "Item<proc_macro2::TokenStream>", scope: !238, file: !2, size: 256, align: 64, flags: DIFlagPrivate, elements: !675, templateParams: !759, identifier: "9d3c77bf78584968f0cd16544285341f")
!675 = !{!676}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !674, file: !2, baseType: !677, size: 256, align: 64, flags: DIFlagPrivate)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<proc_macro2::TokenStream>", scope: !238, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !678, templateParams: !27, identifier: "ae2c7c1bf96f9944a9e60418388236b1")
!678 = !{!679}
!679 = !DICompositeType(tag: DW_TAG_variant_part, scope: !677, file: !2, size: 256, align: 64, elements: !680, templateParams: !27, identifier: "9379ec5f094b92f1e965228421765010", discriminator: !758)
!680 = !{!681, !754}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !679, file: !2, baseType: !682, size: 256, align: 64, extraData: i128 9223372036854775809)
!682 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !677, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !27, templateParams: !683, identifier: "d98f402345f6759834d5c43a84777393")
!683 = !{!684}
!684 = !DITemplateTypeParameter(name: "T", type: !685)
!685 = !DICompositeType(tag: DW_TAG_structure_type, name: "TokenStream", scope: !13, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !686, templateParams: !27, identifier: "8fb69c6c6026f7c5651aadb99dc11087")
!686 = !{!687, !753}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !685, file: !2, baseType: !688, size: 256, align: 64, flags: DIFlagPrivate)
!688 = !DICompositeType(tag: DW_TAG_structure_type, name: "TokenStream", scope: !17, file: !2, size: 256, align: 64, flags: DIFlagProtected, elements: !689, templateParams: !27, identifier: "e2bbaeadb97edc9c859fad4e6d6fd0")
!689 = !{!690}
!690 = !DICompositeType(tag: DW_TAG_variant_part, scope: !688, file: !2, size: 256, align: 64, elements: !691, templateParams: !27, identifier: "cdd233e1088f37147eff5365d3c0458c", discriminator: !752)
!691 = !{!692, !748}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "Compiler", scope: !690, file: !2, baseType: !693, size: 256, align: 64)
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "Compiler", scope: !688, file: !2, size: 256, align: 64, flags: DIFlagProtected, elements: !694, templateParams: !27, identifier: "da0f4b37dc675d0a842ea82ea772294")
!694 = !{!695}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !693, file: !2, baseType: !696, size: 256, align: 64, flags: DIFlagProtected)
!696 = !DICompositeType(tag: DW_TAG_structure_type, name: "DeferredTokenStream", scope: !17, file: !2, size: 256, align: 64, flags: DIFlagProtected, elements: !697, templateParams: !27, identifier: "4c42f759be46552d509d119b268da598")
!697 = !{!698, !702}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !696, file: !2, baseType: !699, size: 32, align: 32, offset: 192, flags: DIFlagPrivate)
!699 = !DICompositeType(tag: DW_TAG_structure_type, name: "TokenStream", scope: !26, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !700, templateParams: !27, identifier: "df8a234ca4a211a6be26ed22a9c81c7")
!700 = !{!701}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !699, file: !2, baseType: !237, size: 32, align: 32, flags: DIFlagPrivate)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !696, file: !2, baseType: !703, size: 192, align: 64, flags: DIFlagPrivate)
!703 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<proc_macro::TokenTree, alloc::alloc::Global>", scope: !217, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !704, templateParams: !746, identifier: "fc2b634166760198c15b090d229b70c3")
!704 = !{!705, !747}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !703, file: !2, baseType: !706, size: 128, align: 64, flags: DIFlagPrivate)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<proc_macro::TokenTree, alloc::alloc::Global>", scope: !448, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !707, templateParams: !746, identifier: "64d4b2cd379721208c7e9b194248b4ff")
!707 = !{!708, !744, !745}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !706, file: !2, baseType: !709, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!709 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<proc_macro::TokenTree>", scope: !452, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !710, templateParams: !740, identifier: "fdde364e73f12b927100da086606516c")
!710 = !{!711, !742}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !709, file: !2, baseType: !712, size: 64, align: 64, flags: DIFlagPrivate)
!712 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<proc_macro::TokenTree>", scope: !57, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !713, templateParams: !740, identifier: "ea2a45ff490367475a8abc61b03f1988")
!713 = !{!714}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !712, file: !2, baseType: !715, size: 64, align: 64, flags: DIFlagPrivate)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const proc_macro::TokenTree", baseType: !716, size: 64, align: 64, dwarfAddressSpace: 0)
!716 = !DICompositeType(tag: DW_TAG_structure_type, name: "TokenTree", scope: !26, file: !2, size: 160, align: 32, flags: DIFlagPublic, elements: !717, templateParams: !27, identifier: "442560c36775304df2d2c0d61235fedf")
!717 = !{!718}
!718 = !DICompositeType(tag: DW_TAG_variant_part, scope: !716, file: !2, size: 160, align: 32, elements: !719, templateParams: !27, identifier: "4de5819156dbb184824c39078417d3e1", discriminator: !739)
!719 = !{!720, !724, !728, !735}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "Group", scope: !718, file: !2, baseType: !721, size: 160, align: 32)
!721 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", scope: !716, file: !2, size: 160, align: 32, flags: DIFlagPublic, elements: !722, templateParams: !27, identifier: "d0a55eb96c31798fb1413958d1ef93a5")
!722 = !{!723}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !721, file: !2, baseType: !415, size: 160, align: 32, flags: DIFlagPublic)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "Ident", scope: !718, file: !2, baseType: !725, size: 160, align: 32, extraData: i128 4)
!725 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ident", scope: !716, file: !2, size: 160, align: 32, flags: DIFlagPublic, elements: !726, templateParams: !27, identifier: "6a40b359ad63f53ecdc2101f7c87ec66")
!726 = !{!727}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !725, file: !2, baseType: !491, size: 96, align: 32, flags: DIFlagPublic)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "Punct", scope: !718, file: !2, baseType: !729, size: 160, align: 32, extraData: i128 5)
!729 = !DICompositeType(tag: DW_TAG_structure_type, name: "Punct", scope: !716, file: !2, size: 160, align: 32, flags: DIFlagPublic, elements: !730, templateParams: !27, identifier: "74c615bca95ef2a7438d83f07b2f4d1b")
!730 = !{!731}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !729, file: !2, baseType: !732, size: 64, align: 32, flags: DIFlagPublic)
!732 = !DICompositeType(tag: DW_TAG_structure_type, name: "Punct", scope: !26, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !733, templateParams: !27, identifier: "13c4b00c0a1b32f92b3f19b287c7cd1d")
!733 = !{!734}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !732, file: !2, baseType: !292, size: 64, align: 32, flags: DIFlagPrivate)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "Literal", scope: !718, file: !2, baseType: !736, size: 160, align: 32, extraData: i128 6)
!736 = !DICompositeType(tag: DW_TAG_structure_type, name: "Literal", scope: !716, file: !2, size: 160, align: 32, flags: DIFlagPublic, elements: !737, templateParams: !27, identifier: "ecd74ccaa8a58c11d987f32a72344fe8")
!737 = !{!738}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !736, file: !2, baseType: !575, size: 128, align: 32, flags: DIFlagPublic)
!739 = !DIDerivedType(tag: DW_TAG_member, scope: !716, file: !2, baseType: !40, size: 8, align: 8, offset: 128, flags: DIFlagArtificial)
!740 = !{!741}
!741 = !DITemplateTypeParameter(name: "T", type: !716)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !709, file: !2, baseType: !743, align: 8, offset: 64, flags: DIFlagPrivate)
!743 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<proc_macro::TokenTree>", scope: !47, file: !2, align: 8, flags: DIFlagPublic, elements: !27, templateParams: !740, identifier: "cb0d4bb14cf19ea01763f03ed3e1c546")
!744 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !706, file: !2, baseType: !460, size: 64, align: 64, flags: DIFlagPrivate)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !706, file: !2, baseType: !83, align: 8, offset: 128, flags: DIFlagPrivate)
!746 = !{!741, !86}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !703, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "Fallback", scope: !690, file: !2, baseType: !749, size: 256, align: 64, extraData: i128 9223372036854775808)
!749 = !DICompositeType(tag: DW_TAG_structure_type, name: "Fallback", scope: !688, file: !2, size: 256, align: 64, flags: DIFlagProtected, elements: !750, templateParams: !27, identifier: "1e0d252a67a61bfe9ac63461880cb2a5")
!750 = !{!751}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !749, file: !2, baseType: !426, size: 64, align: 64, offset: 64, flags: DIFlagProtected)
!752 = !DIDerivedType(tag: DW_TAG_member, scope: !688, file: !2, baseType: !115, size: 64, align: 64, flags: DIFlagArtificial)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !685, file: !2, baseType: !42, align: 8, offset: 256, flags: DIFlagPrivate)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !679, file: !2, baseType: !755, size: 256, align: 64)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !677, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !756, templateParams: !683, identifier: "e9ab14d36159fab84b3b0894bf196611")
!756 = !{!757}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !755, file: !2, baseType: !685, size: 256, align: 64, flags: DIFlagPublic)
!758 = !DIDerivedType(tag: DW_TAG_member, scope: !677, file: !2, baseType: !115, size: 64, align: 64, flags: DIFlagArtificial)
!759 = !{!760}
!760 = !DITemplateTypeParameter(name: "A", type: !685)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !663, file: !2, baseType: !762, align: 8, offset: 256, flags: DIFlagPrivate)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<core::iter::sources::once::Once<proc_macro2::TokenStream>>", scope: !763, file: !2, align: 8, elements: !27, identifier: "89a8d69ac2ba62329710b301ec33ccbe")
!763 = !DINamespace(name: "extend", scope: !764)
!764 = !DINamespace(name: "{impl#7}", scope: !13)
!765 = !{!766, !767}
!766 = !DITemplateTypeParameter(name: "I", type: !666)
!767 = !DITemplateTypeParameter(name: "F", type: !762)
!768 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<proc_macro2::imp::TokenStream, proc_macro::TokenStream, (), fn(proc_macro2::imp::TokenStream) -> proc_macro::TokenStream, core::iter::traits::iterator::Iterator::for_each::call::{closure_env#0}<proc_macro::TokenStream, proc_macro::{impl#22}::extend::{closure_env#0}<core::iter::adapters::map::Map<core::iter::adapters::map::Map<core::iter::sources::once::Once<proc_macro2::TokenStream>, proc_macro2::{impl#7}::extend::{closure_env#0}<core::iter::sources::once::Once<proc_macro2::TokenStream>>>, fn(proc_macro2::imp::TokenStream) -> proc_macro::TokenStream>>>>", scope: !642, file: !2, size: 64, align: 64, elements: !769, templateParams: !27, identifier: "b8c1326a3600cecf64e25ae7e11d3ac9")
!769 = !{!770, !802}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !768, file: !2, baseType: !771, size: 64, align: 64)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<proc_macro::TokenStream, proc_macro::{impl#22}::extend::{closure_env#0}<core::iter::adapters::map::Map<core::iter::adapters::map::Map<core::iter::sources::once::Once<proc_macro2::TokenStream>, proc_macro2::{impl#7}::extend::{closure_env#0}<core::iter::sources::once::Once<proc_macro2::TokenStream>>>, fn(proc_macro2::imp::TokenStream) -> proc_macro::TokenStream>>>", scope: !608, file: !2, size: 64, align: 64, elements: !772, templateParams: !27, identifier: "884937c4bef5dc9e1e0d794bdd913253")
!772 = !{!773}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !771, file: !2, baseType: !774, size: 64, align: 64)
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<core::iter::adapters::map::Map<core::iter::adapters::map::Map<core::iter::sources::once::Once<proc_macro2::TokenStream>, proc_macro2::{impl#7}::extend::{closure_env#0}<core::iter::sources::once::Once<proc_macro2::TokenStream>>>, fn(proc_macro2::imp::TokenStream) -> proc_macro::TokenStream>>", scope: !775, file: !2, size: 64, align: 64, elements: !777, templateParams: !27, identifier: "84d83a98473b687083f38a334d2ee9d0")
!775 = !DINamespace(name: "extend", scope: !776)
!776 = !DINamespace(name: "{impl#22}", scope: !26)
!777 = !{!778}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__builder", scope: !774, file: !2, baseType: !779, size: 64, align: 64)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut proc_macro::ConcatStreamsHelper", baseType: !780, size: 64, align: 64, dwarfAddressSpace: 0)
!780 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConcatStreamsHelper", scope: !26, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !781, templateParams: !27, identifier: "bc17d28f04a4dc0ad3f5106ea99899b9")
!781 = !{!782}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !780, file: !2, baseType: !783, size: 192, align: 64, flags: DIFlagPrivate)
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<proc_macro::bridge::client::TokenStream, alloc::alloc::Global>", scope: !217, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !784, templateParams: !800, identifier: "45f114dab3ccadf1ad56e811310be705")
!784 = !{!785, !801}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !783, file: !2, baseType: !786, size: 128, align: 64, flags: DIFlagPrivate)
!786 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<proc_macro::bridge::client::TokenStream, alloc::alloc::Global>", scope: !448, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !787, templateParams: !800, identifier: "552ca5f5f691ddbb471ae818b2132b88")
!787 = !{!788, !798, !799}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !786, file: !2, baseType: !789, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!789 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<proc_macro::bridge::client::TokenStream>", scope: !452, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !790, templateParams: !244, identifier: "e1ddf235af8038f98f85a6ca06f24427")
!790 = !{!791, !796}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !789, file: !2, baseType: !792, size: 64, align: 64, flags: DIFlagPrivate)
!792 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<proc_macro::bridge::client::TokenStream>", scope: !57, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !793, templateParams: !244, identifier: "66db34572620f6c7ef703765a1fc7e2c")
!793 = !{!794}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !792, file: !2, baseType: !795, size: 64, align: 64, flags: DIFlagPrivate)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const proc_macro::bridge::client::TokenStream", baseType: !246, size: 64, align: 64, dwarfAddressSpace: 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !789, file: !2, baseType: !797, align: 8, offset: 64, flags: DIFlagPrivate)
!797 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<proc_macro::bridge::client::TokenStream>", scope: !47, file: !2, align: 8, flags: DIFlagPublic, elements: !27, templateParams: !244, identifier: "e9dbe04a4223b05a4b6bdef4da481469")
!798 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !786, file: !2, baseType: !460, size: 64, align: 64, flags: DIFlagPrivate)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !786, file: !2, baseType: !83, align: 8, offset: 128, flags: DIFlagPrivate)
!800 = !{!245, !86}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !783, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !768, file: !2, baseType: !803, align: 8, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(proc_macro2::imp::TokenStream) -> proc_macro::TokenStream", baseType: !804, align: 1, dwarfAddressSpace: 0)
!804 = !DISubroutineType(types: !805)
!805 = !{!699, !688}
!806 = !{!807, !808, !809}
!807 = !DILocalVariable(name: "self", arg: 1, scope: !660, file: !189, line: 125, type: !663)
!808 = !DILocalVariable(name: "init", arg: 2, scope: !660, file: !189, line: 125, type: !7)
!809 = !DILocalVariable(name: "g", arg: 3, scope: !660, file: !189, line: 125, type: !768)
!810 = !{!811, !766, !767, !631, !812}
!811 = !DITemplateTypeParameter(name: "B", type: !688)
!812 = !DITemplateTypeParameter(name: "G", type: !768)
!813 = !DILocation(line: 125, column: 21, scope: !660)
!814 = !DILocation(line: 125, column: 27, scope: !660)
!815 = !DILocation(line: 125, column: 38, scope: !660)
!816 = !DILocalVariable(name: "g", arg: 2, scope: !817, file: !189, line: 87, type: !768)
!817 = distinct !DILexicalBlock(scope: !818, file: !189, line: 85, column: 1)
!818 = distinct !DISubprogram(name: "map_fold<proc_macro2::TokenStream, proc_macro2::imp::TokenStream, (), proc_macro2::{impl#7}::extend::{closure_env#0}<core::iter::sources::once::Once<proc_macro2::TokenStream>>, core::iter::adapters::map::map_fold::{closure_env#0}<proc_macro2::imp::TokenStream, proc_macro::TokenStream, (), fn(proc_macro2::imp::TokenStream) -> proc_macro::TokenStream, core::iter::traits::iterator::Iterator::for_each::call::{closure_env#0}<proc_macro::TokenStream, proc_macro::{impl#22}::extend::{closure_env#0}<core::iter::adapters::map::Map<core::iter::adapters::map::Map<core::iter::sources::once::Once<proc_macro2::TokenStream>, proc_macro2::{impl#7}::extend::{closure_env#0}<core::iter::sources::once::Once<proc_macro2::TokenStream>>>, fn(proc_macro2::imp::TokenStream) -> proc_macro::TokenStream>>>>>", linkageName: "_ZN4core4iter8adapters3map8map_fold17he95402835413eb2bE", scope: !191, file: !189, line: 85, type: !819, scopeLine: 85, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !91, templateParams: !827, retainedNodes: !825)
!819 = !DISubroutineType(types: !820)
!820 = !{!821, !762, !768}
!821 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<proc_macro2::TokenStream, proc_macro2::imp::TokenStream, (), proc_macro2::{impl#7}::extend::{closure_env#0}<core::iter::sources::once::Once<proc_macro2::TokenStream>>, core::iter::adapters::map::map_fold::{closure_env#0}<proc_macro2::imp::TokenStream, proc_macro::TokenStream, (), fn(proc_macro2::imp::TokenStream) -> proc_macro::TokenStream, core::iter::traits::iterator::Iterator::for_each::call::{closure_env#0}<proc_macro::TokenStream, proc_macro::{impl#22}::extend::{closure_env#0}<core::iter::adapters::map::Map<core::iter::adapters::map::Map<core::iter::sources::once::Once<proc_macro2::TokenStream>, proc_macro2::{impl#7}::extend::{closure_env#0}<core::iter::sources::once::Once<proc_macro2::TokenStream>>>, fn(proc_macro2::imp::TokenStream) -> proc_macro::TokenStream>>>>>", scope: !642, file: !2, size: 64, align: 64, elements: !822, templateParams: !27, identifier: "c506a3cc7e79fd0b81a46f9a7f4dd506")
!822 = !{!823, !824}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !821, file: !2, baseType: !768, size: 64, align: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !821, file: !2, baseType: !762, align: 8, offset: 64)
!825 = !{!826, !816}
