; ModuleID = '24hyixok1tlryujd'
source_filename = "24hyixok1tlryujd"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128"
target triple = "arm64-apple-macosx11.0.0"

%"core::ops::control_flow::ControlFlow<(), core::convert::Infallible>::Break" = type { {} }
%"core::ptr::metadata::PtrRepr<[u32]>" = type { [2 x i64] }
%"core::ops::range::Range<usize>" = type { i64, i64 }
%"core::iter::adapters::zip::Zip<core::slice::iter::Iter<'_, u32>, core::slice::iter::Iter<'_, usize>>" = type { %"core::slice::iter::Iter<'_, u32>", %"core::slice::iter::Iter<'_, usize>", i64, i64, i64 }
%"core::slice::iter::Iter<'_, u32>" = type { ptr, ptr, %"core::marker::PhantomData<&u32>" }
%"core::marker::PhantomData<&u32>" = type {}
%"core::slice::iter::Iter<'_, usize>" = type { ptr, ptr, %"core::marker::PhantomData<&usize>" }
%"core::marker::PhantomData<&usize>" = type {}
%"core::iter::adapters::zip::Zip<core::slice::iter::Iter<'_, usize>, core::slice::iter::Iter<'_, u32>>" = type { %"core::slice::iter::Iter<'_, usize>", %"core::slice::iter::Iter<'_, u32>", i64, i64, i64 }
%"core::option::Option<(&usize, &u32)>" = type { ptr, [1 x i64] }
%"core::option::Option<(&u32, &usize)>" = type { ptr, [1 x i64] }
%"core::result::Result<rand_chacha::chacha::ChaCha12Core, rand_core::error::Error>" = type { i64, [6 x i64] }
%"rand_core::error::Error" = type { %"alloc::boxed::Box<dyn core::error::Error + core::marker::Send + core::marker::Sync>" }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<std::io::Write::write_fmt::Adapter<std::sys::pal::unix::stdio::Stderr> as core::fmt::Write>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::io::Write::write_fmt::Adapter<std::sys::pal::unix::stdio::Stderr> as core::fmt::Write>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !29, identifier: "751013c41c6a6f9ad9fc373adbd8ba67")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "Adapter<std::sys::pal::unix::stdio::Stderr>", scope: !15, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !19, templateParams: !162, identifier: "ca1aa644302b471146ef9e9ea84d28ef")
!15 = !DINamespace(name: "write_fmt", scope: !16)
!16 = !DINamespace(name: "Write", scope: !17)
!17 = !DINamespace(name: "io", scope: !18)
!18 = !DINamespace(name: "std", scope: null)
!19 = !{!20, !30}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !14, file: !2, baseType: !21, size: 64, align: 64, flags: DIFlagProtected)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut std::sys::pal::unix::stdio::Stderr", baseType: !22, size: 64, align: 64, dwarfAddressSpace: 0)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "Stderr", scope: !23, file: !2, align: 8, flags: DIFlagPublic, elements: !27, templateParams: !29, identifier: "640817ef1403441432ee17d79ce0ddde")
!23 = !DINamespace(name: "stdio", scope: !24)
!24 = !DINamespace(name: "unix", scope: !25)
!25 = !DINamespace(name: "pal", scope: !26)
!26 = !DINamespace(name: "sys", scope: !18)
!27 = !{!28}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !22, file: !2, baseType: !7, align: 8, flags: DIFlagPrivate)
!29 = !{}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !14, file: !2, baseType: !31, size: 64, align: 64, offset: 64, flags: DIFlagProtected)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), std::io::error::Error>", scope: !32, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !34, templateParams: !29, identifier: "1ff2fc656260d81d5578b8bfffdb6754")
!32 = !DINamespace(name: "result", scope: !33)
!33 = !DINamespace(name: "core", scope: null)
!34 = !{!35}
!35 = !DICompositeType(tag: DW_TAG_variant_part, scope: !31, file: !2, size: 64, align: 64, elements: !36, templateParams: !29, identifier: "974d2fad477ba072003ae180a81ecaa", discriminator: !160)
!36 = !{!37, !156}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !35, file: !2, baseType: !38, size: 64, align: 64, extraData: i128 0)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !31, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !39, templateParams: !41, identifier: "21d88b53cd693c16290a3deafc1d1ef8")
!39 = !{!40}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !38, file: !2, baseType: !7, align: 8, flags: DIFlagPublic)
!41 = !{!42, !43}
!42 = !DITemplateTypeParameter(name: "T", type: !7)
!43 = !DITemplateTypeParameter(name: "E", type: !44)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !45, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !46, templateParams: !29, identifier: "d8ae20be4094f16ba02978087c07581c")
!45 = !DINamespace(name: "error", scope: !17)
!46 = !{!47}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !44, file: !2, baseType: !48, size: 64, align: 64, flags: DIFlagPrivate)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "Repr", scope: !49, file: !2, size: 64, align: 64, flags: DIFlagProtected, elements: !50, templateParams: !29, identifier: "44d129975fdb9a743c435f5f9c7ec507")
!49 = !DINamespace(name: "repr_bitpacked", scope: !45)
!50 = !{!51, !58}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !48, file: !2, baseType: !52, size: 64, align: 64, flags: DIFlagPrivate)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<()>", scope: !53, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !55, templateParams: !57, identifier: "ba5be8a440755f141c33418a2b1e6012")
!53 = !DINamespace(name: "non_null", scope: !54)
!54 = !DINamespace(name: "ptr", scope: !33)
!55 = !{!56}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !52, file: !2, baseType: !6, size: 64, align: 64, flags: DIFlagPrivate)
!57 = !{!42}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !48, file: !2, baseType: !59, align: 8, offset: 64, flags: DIFlagPrivate)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<std::io::error::ErrorData<alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>>>", scope: !60, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !61, identifier: "b3285944529992474e3b7a18b2df7db1")
!60 = !DINamespace(name: "marker", scope: !33)
!61 = !{!62}
!62 = !DITemplateTypeParameter(name: "T", type: !63)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "ErrorData<alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>>", scope: !45, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !64, templateParams: !29, identifier: "ab8e7e5f499080e7cd6b3388be90f9e2")
!64 = !{!65}
!65 = !DICompositeType(tag: DW_TAG_variant_part, scope: !63, file: !2, size: 128, align: 64, elements: !66, templateParams: !29, identifier: "8808b40e9404344432609680224b3426", discriminator: !155)
!66 = !{!67, !133, !137, !151}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "Os", scope: !65, file: !2, baseType: !68, size: 128, align: 64, extraData: i128 0)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "Os", scope: !63, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !69, templateParams: !72, identifier: "50fac7bd4ac159ae16ad6a780bdfba82")
!69 = !{!70}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !68, file: !2, baseType: !71, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!71 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!72 = !{!73}
!73 = !DITemplateTypeParameter(name: "C", type: !74)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>", baseType: !75, size: 64, align: 64, dwarfAddressSpace: 0)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !45, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !76, templateParams: !29, identifier: "72070f3f8d2993645c62bf4fff2b6d39")
!76 = !{!77, !122}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !75, file: !2, baseType: !78, size: 8, align: 8, offset: 128, flags: DIFlagPrivate)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ErrorKind", scope: !45, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagEnumClass, elements: !80)
!79 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121}
!81 = !DIEnumerator(name: "NotFound", value: 0, isUnsigned: true)
!82 = !DIEnumerator(name: "PermissionDenied", value: 1, isUnsigned: true)
!83 = !DIEnumerator(name: "ConnectionRefused", value: 2, isUnsigned: true)
!84 = !DIEnumerator(name: "ConnectionReset", value: 3, isUnsigned: true)
!85 = !DIEnumerator(name: "HostUnreachable", value: 4, isUnsigned: true)
!86 = !DIEnumerator(name: "NetworkUnreachable", value: 5, isUnsigned: true)
!87 = !DIEnumerator(name: "ConnectionAborted", value: 6, isUnsigned: true)
!88 = !DIEnumerator(name: "NotConnected", value: 7, isUnsigned: true)
!89 = !DIEnumerator(name: "AddrInUse", value: 8, isUnsigned: true)
!90 = !DIEnumerator(name: "AddrNotAvailable", value: 9, isUnsigned: true)
!91 = !DIEnumerator(name: "NetworkDown", value: 10, isUnsigned: true)
!92 = !DIEnumerator(name: "BrokenPipe", value: 11, isUnsigned: true)
!93 = !DIEnumerator(name: "AlreadyExists", value: 12, isUnsigned: true)
!94 = !DIEnumerator(name: "WouldBlock", value: 13, isUnsigned: true)
!95 = !DIEnumerator(name: "NotADirectory", value: 14, isUnsigned: true)
!96 = !DIEnumerator(name: "IsADirectory", value: 15, isUnsigned: true)
!97 = !DIEnumerator(name: "DirectoryNotEmpty", value: 16, isUnsigned: true)
!98 = !DIEnumerator(name: "ReadOnlyFilesystem", value: 17, isUnsigned: true)
!99 = !DIEnumerator(name: "FilesystemLoop", value: 18, isUnsigned: true)
!100 = !DIEnumerator(name: "StaleNetworkFileHandle", value: 19, isUnsigned: true)
!101 = !DIEnumerator(name: "InvalidInput", value: 20, isUnsigned: true)
!102 = !DIEnumerator(name: "InvalidData", value: 21, isUnsigned: true)
!103 = !DIEnumerator(name: "TimedOut", value: 22, isUnsigned: true)
!104 = !DIEnumerator(name: "WriteZero", value: 23, isUnsigned: true)
!105 = !DIEnumerator(name: "StorageFull", value: 24, isUnsigned: true)
!106 = !DIEnumerator(name: "NotSeekable", value: 25, isUnsigned: true)
!107 = !DIEnumerator(name: "FilesystemQuotaExceeded", value: 26, isUnsigned: true)
!108 = !DIEnumerator(name: "FileTooLarge", value: 27, isUnsigned: true)
!109 = !DIEnumerator(name: "ResourceBusy", value: 28, isUnsigned: true)
!110 = !DIEnumerator(name: "ExecutableFileBusy", value: 29, isUnsigned: true)
!111 = !DIEnumerator(name: "Deadlock", value: 30, isUnsigned: true)
!112 = !DIEnumerator(name: "CrossesDevices", value: 31, isUnsigned: true)
!113 = !DIEnumerator(name: "TooManyLinks", value: 32, isUnsigned: true)
!114 = !DIEnumerator(name: "InvalidFilename", value: 33, isUnsigned: true)
!115 = !DIEnumerator(name: "ArgumentListTooLong", value: 34, isUnsigned: true)
!116 = !DIEnumerator(name: "Interrupted", value: 35, isUnsigned: true)
!117 = !DIEnumerator(name: "Unsupported", value: 36, isUnsigned: true)
!118 = !DIEnumerator(name: "UnexpectedEof", value: 37, isUnsigned: true)
!119 = !DIEnumerator(name: "OutOfMemory", value: 38, isUnsigned: true)
!120 = !DIEnumerator(name: "Other", value: 39, isUnsigned: true)
!121 = !DIEnumerator(name: "Uncategorized", value: 40, isUnsigned: true)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !75, file: !2, baseType: !123, size: 128, align: 64, flags: DIFlagPrivate)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<(dyn core::error::Error + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !124, templateParams: !29, identifier: "1860cfbaacaf458263d5cd138f814f64")
!124 = !{!125, !128}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !123, file: !2, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64, dwarfAddressSpace: 0)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::error::Error + core::marker::Send + core::marker::Sync)", file: !2, align: 8, elements: !29, identifier: "83bcac7472321d22af96ae7900df9e8c")
!128 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !123, file: !2, baseType: !129, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !130, size: 64, align: 64, dwarfAddressSpace: 0)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 3, lowerBound: 0)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Simple", scope: !65, file: !2, baseType: !134, size: 128, align: 64, extraData: i128 1)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "Simple", scope: !63, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !135, templateParams: !72, identifier: "294a8c7dd1826489e540eb53d1135dc6")
!135 = !{!136}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !134, file: !2, baseType: !78, size: 8, align: 8, offset: 8, flags: DIFlagPrivate)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "SimpleMessage", scope: !65, file: !2, baseType: !138, size: 128, align: 64, extraData: i128 2)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !63, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !139, templateParams: !72, identifier: "72eca73941ae82ebdfa89620845a2dc2")
!139 = !{!140}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !138, file: !2, baseType: !141, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::io::error::SimpleMessage", baseType: !142, size: 64, align: 64, dwarfAddressSpace: 0)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !45, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !143, templateParams: !29, identifier: "25a3aad179131f8af5cb6625372d6473")
!143 = !{!144, !145}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !142, file: !2, baseType: !78, size: 8, align: 8, offset: 128, flags: DIFlagPrivate)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !142, file: !2, baseType: !146, size: 128, align: 64, flags: DIFlagPrivate)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !147, templateParams: !29, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!147 = !{!148, !150}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !146, file: !2, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64, dwarfAddressSpace: 0)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !146, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "Custom", scope: !65, file: !2, baseType: !152, size: 128, align: 64, extraData: i128 3)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !63, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !153, templateParams: !72, identifier: "ffd89d829a4ba5c238aea53b68ef1db6")
!153 = !{!154}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !152, file: !2, baseType: !74, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!155 = !DIDerivedType(tag: DW_TAG_member, scope: !63, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagArtificial)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !35, file: !2, baseType: !157, size: 64, align: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !31, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !158, templateParams: !41, identifier: "89f5fca2044254ac9fcbde2099867ce1")
!158 = !{!159}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !157, file: !2, baseType: !44, size: 64, align: 64, flags: DIFlagPublic)
!160 = !DIDerivedType(tag: DW_TAG_member, scope: !31, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagArtificial)
!161 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!162 = !{!163}
!163 = !DITemplateTypeParameter(name: "T", type: !22)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "<std::sync::once::{impl#2}::call_once::{closure_env#0}<rand::rngs::adapter::reseeding::fork::register_fork_handler::{closure_env#0}> as core::ops::function::FnMut<(&std::sync::once::OnceState)>>::{vtable}", scope: null, file: !2, type: !166, isLocal: true, isDefinition: true)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::sync::once::{impl#2}::call_once::{closure_env#0}<rand::rngs::adapter::reseeding::fork::register_fork_handler::{closure_env#0}> as core::ops::function::FnMut<(&std::sync::once::OnceState)>>::{vtable_type}", file: !2, size: 320, align: 64, flags: DIFlagArtificial, elements: !167, vtableHolder: !173, templateParams: !29, identifier: "bfb28dfeaea326e441aee31a353e4fa")
!167 = !{!168, !169, !170, !171, !172}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !166, file: !2, baseType: !6, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !166, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !166, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !166, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !166, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<rand::rngs::adapter::reseeding::fork::register_fork_handler::{closure_env#0}>", scope: !174, file: !2, size: 64, align: 64, elements: !178, templateParams: !29, identifier: "1bcc19463e479d3c1fa7023990069cfe")
!174 = !DINamespace(name: "call_once", scope: !175)
!175 = !DINamespace(name: "{impl#2}", scope: !176)
!176 = !DINamespace(name: "once", scope: !177)
!177 = !DINamespace(name: "sync", scope: !18)
!178 = !{!179}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__f", scope: !173, file: !2, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::option::Option<rand::rngs::adapter::reseeding::fork::register_fork_handler::{closure_env#0}>", baseType: !181, size: 64, align: 64, dwarfAddressSpace: 0)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<rand::rngs::adapter::reseeding::fork::register_fork_handler::{closure_env#0}>", scope: !182, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !183, templateParams: !29, identifier: "d992c5914b7fd0476a3151f5e1e901e1")
!182 = !DINamespace(name: "option", scope: !33)
!183 = !{!184}
!184 = !DICompositeType(tag: DW_TAG_variant_part, scope: !181, file: !2, size: 8, align: 8, elements: !185, templateParams: !29, identifier: "5498ebcf17bec24bcd0f871348935957", discriminator: !201)
!185 = !{!186, !197}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !184, file: !2, baseType: !187, size: 8, align: 8, extraData: i128 0)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !181, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !188, identifier: "89fab86f15dfccbc1e5307dc8a16f2")
!188 = !{!189}
!189 = !DITemplateTypeParameter(name: "T", type: !190)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !191, file: !2, align: 8, elements: !29, identifier: "e183e82e2f90733e5236f79c9c088b6f")
!191 = !DINamespace(name: "register_fork_handler", scope: !192)
!192 = !DINamespace(name: "fork", scope: !193)
!193 = !DINamespace(name: "reseeding", scope: !194)
!194 = !DINamespace(name: "adapter", scope: !195)
!195 = !DINamespace(name: "rngs", scope: !196)
!196 = !DINamespace(name: "rand", scope: null)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !184, file: !2, baseType: !198, size: 8, align: 8, extraData: i128 1)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !181, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !199, templateParams: !188, identifier: "5da77978ce248147e11617ea3936e664")
!199 = !{!200}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !198, file: !2, baseType: !190, align: 8, offset: 8, flags: DIFlagPublic)
!201 = !DIDerivedType(tag: DW_TAG_member, scope: !181, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagArtificial)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "<std::thread::local::AccessError as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !204, isLocal: true, isDefinition: true)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::thread::local::AccessError as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !205, vtableHolder: !210, templateParams: !29, identifier: "ce6a5e32389a8fd83413f6bd6e59582e")
!205 = !{!206, !207, !208, !209}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !204, file: !2, baseType: !6, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !204, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !204, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !204, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "AccessError", scope: !211, file: !2, align: 8, flags: DIFlagPublic, elements: !29, identifier: "b01c46bcf568f453f8e2db6b79a8ee5f")
!211 = !DINamespace(name: "local", scope: !212)
!212 = !DINamespace(name: "thread", scope: !18)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "<std::io::error::Error as core::error::Error>::{vtable}", scope: null, file: !2, type: !215, isLocal: true, isDefinition: true)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::io::error::Error as core::error::Error>::{vtable_type}", file: !2, size: 704, align: 64, flags: DIFlagArtificial, elements: !216, vtableHolder: !44, templateParams: !29, identifier: "688b5dc715e21cbfa09681a6150756e3")
!216 = !{!217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !215, file: !2, baseType: !6, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !215, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !215, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !215, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !215, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__super_trait_ptr5", scope: !215, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "__method6", scope: !215, file: !2, baseType: !6, size: 64, align: 64, offset: 384)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__method7", scope: !215, file: !2, baseType: !6, size: 64, align: 64, offset: 448)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "__method8", scope: !215, file: !2, baseType: !6, size: 64, align: 64, offset: 512)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__method9", scope: !215, file: !2, baseType: !6, size: 64, align: 64, offset: 576)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__method10", scope: !215, file: !2, baseType: !6, size: 64, align: 64, offset: 640)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "RESEEDING_RNG_FORK_COUNTER", linkageName: "_ZN4rand4rngs7adapter9reseeding4fork26RESEEDING_RNG_FORK_COUNTER17hdd860eddd4b9070eE", scope: !192, file: !230, line: 304, type: !231, isLocal: true, isDefinition: true, align: 64)
!230 = !DIFile(filename: "src/rngs/adapter/reseeding.rs", directory: "/private/var/folders/m6/nyw0tbd5239gngtm06pzykr00000gn/T/.tmpPXbnuW/rand_chacha", checksumkind: CSK_MD5, checksum: "4cc949e197f115d92243eaf08c6cea7f")
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !232, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !234, templateParams: !29, identifier: "a5022691efbb6f34e79709ad64998936")
!232 = !DINamespace(name: "atomic", scope: !233)
!233 = !DINamespace(name: "sync", scope: !33)
!234 = !{!235}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !231, file: !2, baseType: !236, size: 64, align: 64, flags: DIFlagPrivate)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !237, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !238, templateParams: !240, identifier: "b9cc5c0458370c6defd001b9936cd7c")
!237 = !DINamespace(name: "cell", scope: !33)
!238 = !{!239}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !236, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!240 = !{!241}
!241 = !DITemplateTypeParameter(name: "T", type: !9)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "REGISTER", linkageName: "_ZN4rand4rngs7adapter9reseeding4fork21register_fork_handler8REGISTER17h174b4780081e75abE", scope: !191, file: !230, line: 317, type: !244, isLocal: true, isDefinition: true, align: 64)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once", scope: !176, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !245, templateParams: !29, identifier: "d04fc06debf815934281ccdf03994cbc")
!245 = !{!246}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !244, file: !2, baseType: !247, size: 64, align: 64, flags: DIFlagPrivate)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once", scope: !248, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !251, templateParams: !29, identifier: "960304fc35d7b9115fef9e38677af35")
!248 = !DINamespace(name: "queue", scope: !249)
!249 = !DINamespace(name: "once", scope: !250)
!250 = !DINamespace(name: "sys_common", scope: !18)
!251 = !{!252}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "state_and_queue", scope: !247, file: !2, baseType: !253, size: 64, align: 64, flags: DIFlagPrivate)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicPtr<()>", scope: !232, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !254, templateParams: !57, identifier: "cf65be55169ce6ab4502c61d7b6a135")
!254 = !{!255}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !253, file: !2, baseType: !256, size: 64, align: 64, flags: DIFlagPrivate)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<*mut ()>", scope: !237, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !257, templateParams: !260, identifier: "b9ff203e432ec33f3c59c1404a87e29b")
!257 = !{!258}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !256, file: !2, baseType: !259, size: 64, align: 64, flags: DIFlagPrivate)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!260 = !{!261}
!261 = !DITemplateTypeParameter(name: "T", type: !259)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "__KEY", linkageName: "_ZN4rand4rngs6thread14THREAD_RNG_KEY7__getit5__KEY17he478e96555c88f9cE", scope: !264, file: !267, line: 90, type: !268, isLocal: true, isDefinition: true, align: 64)
!264 = !DINamespace(name: "__getit", scope: !265)
!265 = !DINamespace(name: "THREAD_RNG_KEY", scope: !266)
!266 = !DINamespace(name: "thread", scope: !195)
!267 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/std/src/sys/thread_local/fast_local.rs", directory: "", checksumkind: CSK_MD5, checksum: "6b8e7c40bf1f768099888f046dfb63b7")
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "Key<alloc::rc::Rc<core::cell::UnsafeCell<rand::rngs::adapter::reseeding::ReseedingRng<rand_chacha::chacha::ChaCha12Core, rand_core::os::OsRng>>, alloc::alloc::Global>>", scope: !269, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !271, templateParams: !286, identifier: "ba6abfb3cbe7a0f591fde8d5736441e8")
!269 = !DINamespace(name: "fast_local", scope: !270)
!270 = !DINamespace(name: "thread_local", scope: !26)
!271 = !{!272, !385}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !268, file: !2, baseType: !273, size: 64, align: 64, flags: DIFlagPrivate)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "LazyKeyInner<alloc::rc::Rc<core::cell::UnsafeCell<rand::rngs::adapter::reseeding::ReseedingRng<rand_chacha::chacha::ChaCha12Core, rand_core::os::OsRng>>, alloc::alloc::Global>>", scope: !274, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !275, templateParams: !286, identifier: "998d6aa83559fa8bc76fc6dbdf6648b8")
!274 = !DINamespace(name: "lazy", scope: !270)
!275 = !{!276}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !273, file: !2, baseType: !277, size: 64, align: 64, flags: DIFlagPrivate)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<alloc::rc::Rc<core::cell::UnsafeCell<rand::rngs::adapter::reseeding::ReseedingRng<rand_chacha::chacha::ChaCha12Core, rand_core::os::OsRng>>, alloc::alloc::Global>>>", scope: !237, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !278, templateParams: !383, identifier: "2584f8b1d7033bf1d76cf16e8e155be7")
!278 = !{!279}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !277, file: !2, baseType: !280, size: 64, align: 64, flags: DIFlagPrivate)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::rc::Rc<core::cell::UnsafeCell<rand::rngs::adapter::reseeding::ReseedingRng<rand_chacha::chacha::ChaCha12Core, rand_core::os::OsRng>>, alloc::alloc::Global>>", scope: !182, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !281, templateParams: !29, identifier: "427c9c0367fb2845a1df69ccbc31d86b")
!281 = !{!282}
!282 = !DICompositeType(tag: DW_TAG_variant_part, scope: !280, file: !2, size: 64, align: 64, elements: !283, templateParams: !29, identifier: "c8304ccd5439cda8b205d42a5e3516c4", discriminator: !382)
!283 = !{!284, !378}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !282, file: !2, baseType: !285, size: 64, align: 64, extraData: i128 0)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !280, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !286, identifier: "dad6e329e48574081b4f9efc384caac4")
!286 = !{!287}
!287 = !DITemplateTypeParameter(name: "T", type: !288)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rc<core::cell::UnsafeCell<rand::rngs::adapter::reseeding::ReseedingRng<rand_chacha::chacha::ChaCha12Core, rand_core::os::OsRng>>, alloc::alloc::Global>", scope: !289, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !291, templateParams: !376, identifier: "561c1c2ccbb69773da3d6f23dc440f84")
!289 = !DINamespace(name: "rc", scope: !290)
!290 = !DINamespace(name: "alloc", scope: null)
!291 = !{!292, !371, !373}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !288, file: !2, baseType: !293, size: 64, align: 64, flags: DIFlagPrivate)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::rc::RcBox<core::cell::UnsafeCell<rand::rngs::adapter::reseeding::ReseedingRng<rand_chacha::chacha::ChaCha12Core, rand_core::os::OsRng>>>>", scope: !53, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !294, templateParams: !369, identifier: "df0e9468f290e7d19ab553730fb5bf8a")
!294 = !{!295}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !293, file: !2, baseType: !296, size: 64, align: 64, flags: DIFlagPrivate)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::rc::RcBox<core::cell::UnsafeCell<rand::rngs::adapter::reseeding::ReseedingRng<rand_chacha::chacha::ChaCha12Core, rand_core::os::OsRng>>>", baseType: !297, size: 64, align: 64, dwarfAddressSpace: 0)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "RcBox<core::cell::UnsafeCell<rand::rngs::adapter::reseeding::ReseedingRng<rand_chacha::chacha::ChaCha12Core, rand_core::os::OsRng>>>", scope: !289, file: !2, size: 2816, align: 64, flags: DIFlagPrivate, elements: !298, templateParams: !367, identifier: "80b81cbc522b5fba78c2821609599172")
!298 = !{!299, !303, !304}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !297, file: !2, baseType: !300, size: 64, align: 64, flags: DIFlagPrivate)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<usize>", scope: !237, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !301, templateParams: !240, identifier: "f4ce6b172bbab0a95f26028a66e0e0")
!301 = !{!302}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !300, file: !2, baseType: !236, size: 64, align: 64, flags: DIFlagPrivate)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !297, file: !2, baseType: !300, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !297, file: !2, baseType: !305, size: 2688, align: 64, offset: 128, flags: DIFlagPrivate)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<rand::rngs::adapter::reseeding::ReseedingRng<rand_chacha::chacha::ChaCha12Core, rand_core::os::OsRng>>", scope: !237, file: !2, size: 2688, align: 64, flags: DIFlagPublic, elements: !306, templateParams: !365, identifier: "6a932ecfb2d721e13be00c4b95f13248")
!306 = !{!307}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !305, file: !2, baseType: !308, size: 2688, align: 64, flags: DIFlagPrivate)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReseedingRng<rand_chacha::chacha::ChaCha12Core, rand_core::os::OsRng>", scope: !193, file: !2, size: 2688, align: 64, flags: DIFlagPublic, elements: !309, templateParams: !360, identifier: "d8c0cc8821abccf5d38392468e65100")
!309 = !{!310}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !308, file: !2, baseType: !311, size: 2688, align: 64, flags: DIFlagPrivate)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "BlockRng<rand::rngs::adapter::reseeding::ReseedingCore<rand_chacha::chacha::ChaCha12Core, rand_core::os::OsRng>>", scope: !312, file: !2, size: 2688, align: 64, flags: DIFlagPublic, elements: !314, templateParams: !363, identifier: "b2c555cc6a8579f1279ccff681df67cf")
!312 = !DINamespace(name: "block", scope: !313)
!313 = !DINamespace(name: "rand_core", scope: null)
!314 = !{!315, !327, !328}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !311, file: !2, baseType: !316, size: 2048, align: 32, flags: DIFlagPrivate)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "Array64<u32>", scope: !317, file: !2, size: 2048, align: 32, flags: DIFlagPublic, elements: !319, templateParams: !325, identifier: "fb6f2e1a7322e4675d3e356ce4b0f77")
!317 = !DINamespace(name: "chacha", scope: !318)
!318 = !DINamespace(name: "rand_chacha", scope: null)
!319 = !{!320}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !316, file: !2, baseType: !321, size: 2048, align: 32, flags: DIFlagPrivate)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 2048, align: 32, elements: !323)
!322 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!323 = !{!324}
!324 = !DISubrange(count: 64, lowerBound: 0)
!325 = !{!326}
!326 = !DITemplateTypeParameter(name: "T", type: !322)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !311, file: !2, baseType: !9, size: 64, align: 64, offset: 2048, flags: DIFlagPrivate)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "core", scope: !311, file: !2, baseType: !329, size: 576, align: 64, offset: 2112, flags: DIFlagPublic)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReseedingCore<rand_chacha::chacha::ChaCha12Core, rand_core::os::OsRng>", scope: !193, file: !2, size: 576, align: 64, flags: DIFlagPrivate, elements: !330, templateParams: !360, identifier: "80dc80f2dc80784b5fbfaa9056f23edd")
!330 = !{!331, !353, !356, !358, !359}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !329, file: !2, baseType: !332, size: 384, align: 64, flags: DIFlagPrivate)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "ChaCha12Core", scope: !317, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !333, templateParams: !29, identifier: "cd70e08b0e8f5e8c3248035044e3c3b3")
!333 = !{!334}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !332, file: !2, baseType: !335, size: 384, align: 64, flags: DIFlagPrivate)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "ChaCha", scope: !336, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !337, templateParams: !29, identifier: "5812cf8ce4cc6ea02879c4d0b5a9ea85")
!336 = !DINamespace(name: "guts", scope: !318)
!337 = !{!338, !351, !352}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !335, file: !2, baseType: !339, size: 128, align: 64, flags: DIFlagProtected)
!339 = !DICompositeType(tag: DW_TAG_union_type, name: "vec128_storage", scope: !340, file: !2, size: 128, align: 64, elements: !342, templateParams: !29, identifier: "98914e13289bcfaeb960605859a799c8")
!340 = !DINamespace(name: "generic", scope: !341)
!341 = !DINamespace(name: "ppv_lite86", scope: null)
!342 = !{!343, !347}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !339, file: !2, baseType: !344, size: 128, align: 32)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 128, align: 32, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 4, lowerBound: 0)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !339, file: !2, baseType: !348, size: 128, align: 64)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 128, align: 64, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 2, lowerBound: 0)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !335, file: !2, baseType: !339, size: 128, align: 64, offset: 128, flags: DIFlagProtected)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !335, file: !2, baseType: !339, size: 128, align: 64, offset: 256, flags: DIFlagProtected)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "reseeder", scope: !329, file: !2, baseType: !354, align: 8, offset: 576, flags: DIFlagPrivate)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "OsRng", scope: !355, file: !2, align: 8, flags: DIFlagPublic, elements: !29, identifier: "7a575e55370eea5520d2fb55683cd889")
!355 = !DINamespace(name: "os", scope: !313)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !329, file: !2, baseType: !357, size: 64, align: 64, offset: 384, flags: DIFlagPrivate)
!357 = !DIBasicType(name: "i64", size: 64, encoding: DW_ATE_signed)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_until_reseed", scope: !329, file: !2, baseType: !357, size: 64, align: 64, offset: 448, flags: DIFlagPrivate)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "fork_counter", scope: !329, file: !2, baseType: !9, size: 64, align: 64, offset: 512, flags: DIFlagPrivate)
!360 = !{!361, !362}
!361 = !DITemplateTypeParameter(name: "R", type: !332)
!362 = !DITemplateTypeParameter(name: "Rsdr", type: !354)
!363 = !{!364}
!364 = !DITemplateTypeParameter(name: "R", type: !329)
!365 = !{!366}
!366 = !DITemplateTypeParameter(name: "T", type: !308)
!367 = !{!368}
!368 = !DITemplateTypeParameter(name: "T", type: !305)
!369 = !{!370}
!370 = !DITemplateTypeParameter(name: "T", type: !297)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !288, file: !2, baseType: !372, align: 8, offset: 64, flags: DIFlagPrivate)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::rc::RcBox<core::cell::UnsafeCell<rand::rngs::adapter::reseeding::ReseedingRng<rand_chacha::chacha::ChaCha12Core, rand_core::os::OsRng>>>>", scope: !60, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !369, identifier: "bc3e6ca00951007046a3057bb69df06f")
!373 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !288, file: !2, baseType: !374, align: 8, offset: 64, flags: DIFlagPrivate)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !375, file: !2, align: 8, flags: DIFlagPublic, elements: !29, identifier: "565e9af856f873ca6c6565cfe9042298")
!375 = !DINamespace(name: "alloc", scope: !290)
!376 = !{!368, !377}
!377 = !DITemplateTypeParameter(name: "A", type: !374)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !282, file: !2, baseType: !379, size: 64, align: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !280, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !380, templateParams: !286, identifier: "def7d53f9ba450b6a0e51f246521ba94")
!380 = !{!381}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !379, file: !2, baseType: !288, size: 64, align: 64, flags: DIFlagPublic)
!382 = !DIDerivedType(tag: DW_TAG_member, scope: !280, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagArtificial)
!383 = !{!384}
!384 = !DITemplateTypeParameter(name: "T", type: !280)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "dtor_state", scope: !268, file: !2, baseType: !386, size: 8, align: 8, offset: 64, flags: DIFlagPrivate)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<std::sys::thread_local::fast_local::DtorState>", scope: !237, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !387, templateParams: !397, identifier: "5a1caae92998afedbd9e6d919b74ab75")
!387 = !{!388}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !386, file: !2, baseType: !389, size: 8, align: 8, flags: DIFlagPrivate)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<std::sys::thread_local::fast_local::DtorState>", scope: !237, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !390, templateParams: !397, identifier: "cb48552828f8d975ab96be55f4b597ea")
!390 = !{!391}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !389, file: !2, baseType: !392, size: 8, align: 8, flags: DIFlagPrivate)
!392 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DtorState", scope: !269, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagEnumClass, elements: !393)
!393 = !{!394, !395, !396}
!394 = !DIEnumerator(name: "Unregistered", value: 0, isUnsigned: true)
!395 = !DIEnumerator(name: "Registered", value: 1, isUnsigned: true)
!396 = !DIEnumerator(name: "RunningOrHasRun", value: 2, isUnsigned: true)
!397 = !{!398}
!398 = !DITemplateTypeParameter(name: "T", type: !392)
!399 = !{i32 8, !"PIC Level", i32 2}
!400 = !{i32 2, !"Dwarf Version", i32 4}
!401 = !{i32 2, !"Debug Info Version", i32 3}
!402 = !{!"rustc version 1.78.0-nightly (46b180ec2 2024-03-08)"}
!403 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !404, producer: "clang LLVM (rustc version 1.78.0-nightly (46b180ec2 2024-03-08))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !405, globals: !507, splitDebugInlining: false, nameTableKind: None)
!404 = !DIFile(filename: "src/lib.rs/@/24hyixok1tlryujd", directory: "/private/var/folders/m6/nyw0tbd5239gngtm06pzykr00000gn/T/.tmpPXbnuW/rand_chacha")
!405 = !{!392, !78, !406, !414, !421, !488, !494, !502}
!406 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !407, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagEnumClass, elements: !409)
!407 = !DINamespace(name: "rt", scope: !408)
!408 = !DINamespace(name: "fmt", scope: !33)
!409 = !{!410, !411, !412, !413}
!410 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!411 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!412 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!413 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!414 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !232, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagEnumClass, elements: !415)
!415 = !{!416, !417, !418, !419, !420}
!416 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!417 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!418 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!419 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!420 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!421 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AlignmentEnum", scope: !422, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagEnumClass, elements: !423)
!422 = !DINamespace(name: "alignment", scope: !54)
!423 = !{!424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487}
!424 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!425 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!426 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!427 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!428 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!429 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!430 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!431 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!432 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!433 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!434 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!435 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!436 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!437 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!438 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!439 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!440 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!441 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!442 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!443 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!444 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!445 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!446 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!447 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!448 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!449 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!450 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!451 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!452 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!453 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!454 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!455 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!456 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!457 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!458 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!459 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!460 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!461 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!462 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!463 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!464 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!465 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!466 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!467 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!468 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!469 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!470 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!471 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!472 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!473 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!474 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!475 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!476 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!477 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!478 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!479 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!480 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!481 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!482 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!483 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!484 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!485 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!486 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!487 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!488 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !489, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagEnumClass, elements: !490)
!489 = !DINamespace(name: "panicking", scope: !33)
!490 = !{!491, !492, !493}
!491 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!492 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!493 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!494 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "WeightError", scope: !495, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagEnumClass, elements: !497)
!495 = !DINamespace(name: "weighted_index", scope: !496)
!496 = !DINamespace(name: "distributions", scope: !196)
!497 = !{!498, !499, !500, !501}
!498 = !DIEnumerator(name: "InvalidInput", value: 0, isUnsigned: true)
!499 = !DIEnumerator(name: "InvalidWeight", value: 1, isUnsigned: true)
!500 = !DIEnumerator(name: "InsufficientNonZero", value: 2, isUnsigned: true)
!501 = !DIEnumerator(name: "Overflow", value: 3, isUnsigned: true)
!502 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Error", scope: !503, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagEnumClass, elements: !504)
!503 = !DINamespace(name: "uniform", scope: !496)
!504 = !{!505, !506}
!505 = !DIEnumerator(name: "EmptyRange", value: 0, isUnsigned: true)
!506 = !DIEnumerator(name: "NonFinite", value: 1, isUnsigned: true)
!507 = !{!0, !164, !202, !213, !228, !242, !262}
!508 = distinct !DISubprogram(name: "next<core::slice::iter::Iter<usize>, core::slice::iter::Iter<u32>>", linkageName: "_ZN102_$LT$core..iter..adapters..zip..Zip$LT$A$C$B$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17h1f9a90d869210e28E", scope: !510, file: !509, line: 84, type: !514, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !403, templateParams: !569, retainedNodes: !572)
!509 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/iter/adapters/zip.rs", directory: "", checksumkind: CSK_MD5, checksum: "5f8b8a28107112a91c08913e65df832a")
!510 = !DINamespace(name: "{impl#1}", scope: !511)
!511 = !DINamespace(name: "zip", scope: !512)
!512 = !DINamespace(name: "adapters", scope: !513)
!513 = !DINamespace(name: "iter", scope: !33)
!514 = !DISubroutineType(types: !515)
!515 = !{!516, !535}
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<(&usize, &u32)>", scope: !182, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !517, templateParams: !29, identifier: "cd4385b2c608fd27d22aed4c004e2ef4")
!517 = !{!518}
!518 = !DICompositeType(tag: DW_TAG_variant_part, scope: !516, file: !2, size: 128, align: 64, elements: !519, templateParams: !29, identifier: "6eec4f33c9c34028a6cecfd229b60e0", discriminator: !534)
!519 = !{!520, !530}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !518, file: !2, baseType: !521, size: 128, align: 64, extraData: i128 0)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !516, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !522, identifier: "1907c2b46f5ae41dd487a8c3f9694dce")
!522 = !{!523}
!523 = !DITemplateTypeParameter(name: "T", type: !524)
!524 = !DICompositeType(tag: DW_TAG_structure_type, name: "(&usize, &u32)", file: !2, size: 128, align: 64, elements: !525, templateParams: !29, identifier: "85af1f694a30ad696ff1c78bfdefc306")
!525 = !{!526, !528}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !524, file: !2, baseType: !527, size: 64, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !524, file: !2, baseType: !529, size: 64, align: 64, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u32", baseType: !322, size: 64, align: 64, dwarfAddressSpace: 0)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !518, file: !2, baseType: !531, size: 128, align: 64)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !516, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !532, templateParams: !522, identifier: "36de7120a2b1c167b1ca70c726e8bcb7")
!532 = !{!533}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !531, file: !2, baseType: !524, size: 128, align: 64, flags: DIFlagPublic)
!534 = !DIDerivedType(tag: DW_TAG_member, scope: !516, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagArtificial)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::zip::Zip<core::slice::iter::Iter<usize>, core::slice::iter::Iter<u32>>", baseType: !536, size: 64, align: 64, dwarfAddressSpace: 0)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "Zip<core::slice::iter::Iter<usize>, core::slice::iter::Iter<u32>>", scope: !511, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !537, templateParams: !569, identifier: "4c70c428a82b966df09f50adf66e18df")
!537 = !{!538, !553, !566, !567, !568}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !536, file: !2, baseType: !539, size: 128, align: 64, flags: DIFlagPrivate)
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<usize>", scope: !540, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !542, templateParams: !240, identifier: "6062b3be7becfca9a498b5b44e068d7b")
!540 = !DINamespace(name: "iter", scope: !541)
!541 = !DINamespace(name: "slice", scope: !33)
!542 = !{!543, !548, !549}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !539, file: !2, baseType: !544, size: 64, align: 64, flags: DIFlagPrivate)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<usize>", scope: !53, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !545, templateParams: !240, identifier: "2591833ff7e7bc7db73ce1736a9ef43")
!545 = !{!546}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !544, file: !2, baseType: !547, size: 64, align: 64, flags: DIFlagPrivate)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "end_or_len", scope: !539, file: !2, baseType: !547, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !539, file: !2, baseType: !550, align: 8, offset: 128, flags: DIFlagPrivate)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&usize>", scope: !60, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !551, identifier: "781c08f668432fa1ef8de534b65e3751")
!551 = !{!552}
!552 = !DITemplateTypeParameter(name: "T", type: !527)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !536, file: !2, baseType: !554, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<u32>", scope: !540, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !555, templateParams: !325, identifier: "84dfd8651c2e4ad180a615ebb55b5672")
!555 = !{!556, !561, !562}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !554, file: !2, baseType: !557, size: 64, align: 64, flags: DIFlagPrivate)
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u32>", scope: !53, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !558, templateParams: !325, identifier: "ff280f26ad9054388557f3044329e8d")
!558 = !{!559}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !557, file: !2, baseType: !560, size: 64, align: 64, flags: DIFlagPrivate)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u32", baseType: !322, size: 64, align: 64, dwarfAddressSpace: 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "end_or_len", scope: !554, file: !2, baseType: !560, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !554, file: !2, baseType: !563, align: 8, offset: 128, flags: DIFlagPrivate)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&u32>", scope: !60, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !564, identifier: "53caf83c2518a8ce91b0e507f1f766f")
!564 = !{!565}
!565 = !DITemplateTypeParameter(name: "T", type: !529)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !536, file: !2, baseType: !9, size: 64, align: 64, offset: 256, flags: DIFlagPrivate)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !536, file: !2, baseType: !9, size: 64, align: 64, offset: 320, flags: DIFlagPrivate)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "a_len", scope: !536, file: !2, baseType: !9, size: 64, align: 64, offset: 384, flags: DIFlagPrivate)
!569 = !{!570, !571}
!570 = !DITemplateTypeParameter(name: "A", type: !539)
!571 = !DITemplateTypeParameter(name: "B", type: !554)
!572 = !{!573}
!573 = !DILocalVariable(name: "self", arg: 1, scope: !508, file: !509, line: 84, type: !535)
!574 = !DILocation(line: 84, column: 13, scope: !508)
!575 = !DILocation(line: 85, column: 9, scope: !508)
!576 = !DILocation(line: 86, column: 6, scope: !508)
!577 = distinct !DISubprogram(name: "next<core::slice::iter::Iter<u32>, core::slice::iter::Iter<usize>>", linkageName: "_ZN102_$LT$core..iter..adapters..zip..Zip$LT$A$C$B$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17h99d41ff2fd9549b1E", scope: !510, file: !509, line: 84, type: !578, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !403, templateParams: !605, retainedNodes: !608)
!578 = !DISubroutineType(types: !579)
!579 = !{!580, !597}
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<(&u32, &usize)>", scope: !182, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !581, templateParams: !29, identifier: "161cd03510ecd1222d24785db14f2f53")
!581 = !{!582}
!582 = !DICompositeType(tag: DW_TAG_variant_part, scope: !580, file: !2, size: 128, align: 64, elements: !583, templateParams: !29, identifier: "1eb90c8cfeb96712bd688056f3ac8de", discriminator: !596)
!583 = !{!584, !592}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !582, file: !2, baseType: !585, size: 128, align: 64, extraData: i128 0)
!585 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !580, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !586, identifier: "a3bcf3c6c017a8c02cf4ea395b6df5a6")
!586 = !{!587}
!587 = !DITemplateTypeParameter(name: "T", type: !588)
!588 = !DICompositeType(tag: DW_TAG_structure_type, name: "(&u32, &usize)", file: !2, size: 128, align: 64, elements: !589, templateParams: !29, identifier: "133a1270c78386f322abe463d358c9ef")
!589 = !{!590, !591}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !588, file: !2, baseType: !529, size: 64, align: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !588, file: !2, baseType: !527, size: 64, align: 64, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !582, file: !2, baseType: !593, size: 128, align: 64)
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !580, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !594, templateParams: !586, identifier: "515f9a13252c3923227659ea3232409")
!594 = !{!595}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !593, file: !2, baseType: !588, size: 128, align: 64, flags: DIFlagPublic)
!596 = !DIDerivedType(tag: DW_TAG_member, scope: !580, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagArtificial)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::zip::Zip<core::slice::iter::Iter<u32>, core::slice::iter::Iter<usize>>", baseType: !598, size: 64, align: 64, dwarfAddressSpace: 0)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "Zip<core::slice::iter::Iter<u32>, core::slice::iter::Iter<usize>>", scope: !511, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !599, templateParams: !605, identifier: "2606317dce18b439e9c3b6fb098eda02")
!599 = !{!600, !601, !602, !603, !604}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !598, file: !2, baseType: !554, size: 128, align: 64, flags: DIFlagPrivate)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !598, file: !2, baseType: !539, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !598, file: !2, baseType: !9, size: 64, align: 64, offset: 256, flags: DIFlagPrivate)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !598, file: !2, baseType: !9, size: 64, align: 64, offset: 320, flags: DIFlagPrivate)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "a_len", scope: !598, file: !2, baseType: !9, size: 64, align: 64, offset: 384, flags: DIFlagPrivate)
!605 = !{!606, !607}
!606 = !DITemplateTypeParameter(name: "A", type: !554)
!607 = !DITemplateTypeParameter(name: "B", type: !539)
!608 = !{!609}
!609 = !DILocalVariable(name: "self", arg: 1, scope: !577, file: !509, line: 84, type: !597)
!610 = !DILocation(line: 84, column: 13, scope: !577)
!611 = !DILocation(line: 85, column: 9, scope: !577)
!612 = !DILocation(line: 86, column: 6, scope: !577)
!613 = distinct !DISubprogram(name: "from_residual<(), ()>", linkageName: "_ZN104_$LT$core..ops..control_flow..ControlFlow$LT$B$C$C$GT$$u20$as$u20$core..ops..try_trait..FromResidual$GT$13from_residual17h82826b242fb677a7E", scope: !615, file: !614, line: 121, type: !618, scopeLine: 121, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !403, templateParams: !628, retainedNodes: !654)
!614 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/ops/control_flow.rs", directory: "", checksumkind: CSK_MD5, checksum: "3c00595f3fc02f6a911e33c3b35d9063")
!615 = !DINamespace(name: "{impl#1}", scope: !616)
!616 = !DINamespace(name: "control_flow", scope: !617)
!617 = !DINamespace(name: "ops", scope: !33)
!618 = !DISubroutineType(types: !619)
!619 = !{!620, !636}
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "ControlFlow<(), ()>", scope: !616, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !621, templateParams: !29, identifier: "6c6428ee6d5531f9994f31fd543cfad8")
!621 = !{!622}
!622 = !DICompositeType(tag: DW_TAG_variant_part, scope: !620, file: !2, size: 8, align: 8, elements: !623, templateParams: !29, identifier: "e5bd22aa25ac50b44d4e55eef17d7da8", discriminator: !635)
!623 = !{!624, !631}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "Continue", scope: !622, file: !2, baseType: !625, size: 8, align: 8, extraData: i128 0)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "Continue", scope: !620, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !626, templateParams: !628, identifier: "2c2315c73b5dba96fbde32e57aea3649")
!626 = !{!627}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !625, file: !2, baseType: !7, align: 8, offset: 8, flags: DIFlagPublic)
!628 = !{!629, !630}
!629 = !DITemplateTypeParameter(name: "B", type: !7)
!630 = !DITemplateTypeParameter(name: "C", type: !7)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "Break", scope: !622, file: !2, baseType: !632, size: 8, align: 8, extraData: i128 1)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "Break", scope: !620, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !633, templateParams: !628, identifier: "b1417a7f80bfa02212dedfaa47fb646e")
!633 = !{!634}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !632, file: !2, baseType: !7, align: 8, offset: 8, flags: DIFlagPublic)
!635 = !DIDerivedType(tag: DW_TAG_member, scope: !620, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagArtificial)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "ControlFlow<(), core::convert::Infallible>", scope: !616, file: !2, align: 8, flags: DIFlagPublic, elements: !637, templateParams: !29, identifier: "1a2f9a7da5d20234332b250f66990fe8")
!637 = !{!638}
!638 = !DICompositeType(tag: DW_TAG_variant_part, scope: !636, file: !2, align: 8, elements: !639, templateParams: !29, identifier: "78d8f7b93d172c29f58ea322596dcb28")
!639 = !{!640, !650}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "Continue", scope: !638, file: !2, baseType: !641, align: 8)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "Continue", scope: !636, file: !2, align: 8, flags: DIFlagPublic, elements: !642, templateParams: !648, identifier: "4e085d1ca0dcf96f2736ab4a465db7be")
!642 = !{!643}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !641, file: !2, baseType: !644, align: 8, flags: DIFlagPublic)
!644 = !DICompositeType(tag: DW_TAG_structure_type, name: "Infallible", scope: !645, file: !2, align: 8, flags: DIFlagPublic, elements: !646, templateParams: !29, identifier: "fa13d0b7c38db284bf843fd30710797a")
!645 = !DINamespace(name: "convert", scope: !33)
!646 = !{!647}
!647 = !DICompositeType(tag: DW_TAG_variant_part, scope: !644, file: !2, align: 8, elements: !29, identifier: "5ade76f3e3c84d3f8835c5b79b9ad8")
!648 = !{!629, !649}
!649 = !DITemplateTypeParameter(name: "C", type: !644)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "Break", scope: !638, file: !2, baseType: !651, align: 8)
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "Break", scope: !636, file: !2, align: 8, flags: DIFlagPublic, elements: !652, templateParams: !648, identifier: "304e6d685304a36fbbcf9a44c2da2b14")
!652 = !{!653}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !651, file: !2, baseType: !7, align: 8, flags: DIFlagPublic)
!654 = !{!655, !656}
!655 = !DILocalVariable(name: "residual", arg: 1, scope: !613, file: !614, line: 121, type: !636)
!656 = !DILocalVariable(name: "b", scope: !657, file: !614, line: 123, type: !7, align: 1)
!657 = distinct !DILexicalBlock(scope: !613, file: !614, line: 123, column: 13)
!658 = !DILocation(line: 121, column: 22, scope: !613)
!659 = !DILocation(line: 123, column: 32, scope: !657)
!660 = !DILocation(line: 123, column: 38, scope: !657)
!661 = !DILocation(line: 125, column: 6, scope: !613)
!662 = !{i8 0, i8 2}
!663 = distinct !DISubprogram(name: "index_mut<u32>", linkageName: "_ZN110_$LT$core..ops..range..RangeFrom$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17h258054f67cc86ac9E", scope: !665, file: !664, line: 496, type: !667, scopeLine: 496, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !403, templateParams: !325, retainedNodes: !688)
!664 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/slice/index.rs", directory: "", checksumkind: CSK_MD5, checksum: "64a8de5498ea10af39073650ed20d9c4")
!665 = !DINamespace(name: "{impl#6}", scope: !666)
!666 = !DINamespace(name: "index", scope: !541)
!667 = !DISubroutineType(types: !668)
!668 = !{!669, !674, !669, !680}
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [u32]", file: !2, size: 128, align: 64, elements: !670, templateParams: !29, identifier: "d20e2cab925e08d22c37f135b2780722")
!670 = !{!671, !673}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !669, file: !2, baseType: !672, size: 64, align: 64)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64, dwarfAddressSpace: 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !669, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!674 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeFrom<usize>", scope: !675, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !676, templateParams: !678, identifier: "5cfbe8662883bff5c59eb4fe7450c76b")
!675 = !DINamespace(name: "range", scope: !617)
!676 = !{!677}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !674, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPublic)
!678 = !{!679}
!679 = !DITemplateTypeParameter(name: "Idx", type: !9)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !681, size: 64, align: 64, dwarfAddressSpace: 0)
!681 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !682, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !684, templateParams: !29, identifier: "6ab6d19db24f176957abb2edb6f58a8b")
!682 = !DINamespace(name: "location", scope: !683)
!683 = !DINamespace(name: "panic", scope: !33)
!684 = !{!685, !686, !687}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !681, file: !2, baseType: !146, size: 128, align: 64, flags: DIFlagPrivate)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !681, file: !2, baseType: !322, size: 32, align: 32, offset: 128, flags: DIFlagPrivate)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !681, file: !2, baseType: !322, size: 32, align: 32, offset: 160, flags: DIFlagPrivate)
!688 = !{!689, !690}
!689 = !DILocalVariable(name: "self", arg: 1, scope: !663, file: !664, line: 496, type: !674)
!690 = !DILocalVariable(name: "slice", arg: 2, scope: !663, file: !664, line: 496, type: !669)
!691 = !DILocation(line: 496, column: 18, scope: !663)
!692 = !DILocation(line: 496, column: 24, scope: !663)
!693 = !DILocation(line: 497, column: 12, scope: !663)
!694 = !DILocalVariable(name: "self", scope: !695, file: !664, line: 481, type: !674, align: 8)
!695 = distinct !DILexicalBlock(scope: !696, file: !664, line: 481, column: 5)
!696 = distinct !DISubprogram(name: "get_unchecked_mut<u32>", linkageName: "_ZN110_$LT$core..ops..range..RangeFrom$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$17get_unchecked_mut17h4fc83a743a9efec7E", scope: !665, file: !664, line: 481, type: !697, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !403, templateParams: !325, retainedNodes: !703)
!697 = !DISubroutineType(types: !698)
!698 = !{!699, !674, !699}
!699 = !DICompositeType(tag: DW_TAG_structure_type, name: "*mut [u32]", file: !2, size: 128, align: 64, elements: !700, templateParams: !29, identifier: "8f5e3a97070cd6296f2037d7624842c8")
!700 = !{!701, !702}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !699, file: !2, baseType: !672, size: 64, align: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !699, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!703 = !{!694, !704}
!704 = !DILocalVariable(name: "slice", arg: 2, scope: !695, file: !664, line: 481, type: !699)
!705 = !DILocation(line: 481, column: 33, scope: !695, inlinedAt: !706)
!706 = !DILocation(line: 501, column: 29, scope: !663)
!707 = !DILocation(line: 501, column: 47, scope: !663)
!708 = !DILocation(line: 481, column: 39, scope: !695, inlinedAt: !706)
!709 = !DILocalVariable(name: "self", arg: 1, scope: !710, file: !711, line: 1937, type: !699)
!710 = distinct !DILexicalBlock(scope: !712, file: !711, line: 1937, column: 5)
!711 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/ptr/mut_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "1660eb21212d739b6367ea84c0f4f627")
!712 = distinct !DISubprogram(name: "len<u32>", linkageName: "_ZN4core3ptr7mut_ptr41_$LT$impl$u20$$BP$mut$u20$$u5b$T$u5d$$GT$3len17h6596323b15823c12E", scope: !713, file: !711, line: 1937, type: !715, scopeLine: 1937, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !403, templateParams: !325, retainedNodes: !717)
!713 = !DINamespace(name: "{impl#1}", scope: !714)
!714 = !DINamespace(name: "mut_ptr", scope: !54)
!715 = !DISubroutineType(types: !716)
!716 = !{!9, !699}
!717 = !{!709}
!718 = !DILocation(line: 1937, column: 22, scope: !710, inlinedAt: !719)
!719 = !DILocation(line: 483, column: 37, scope: !695, inlinedAt: !706)
!720 = !DILocation(line: 1938, column: 18, scope: !710, inlinedAt: !719)
!721 = !DILocalVariable(name: "ptr", arg: 1, scope: !722, file: !723, line: 94, type: !728)
!722 = distinct !DILexicalBlock(scope: !724, file: !723, line: 94, column: 1)
!723 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/ptr/metadata.rs", directory: "", checksumkind: CSK_MD5, checksum: "3e5f46ed28de51d38cc460b6ffb611d6")
!724 = distinct !DISubprogram(name: "metadata<[u32]>", linkageName: "_ZN4core3ptr8metadata8metadata17h3cde38055493bda0E", scope: !725, file: !723, line: 94, type: !726, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !403, templateParams: !325, retainedNodes: !732)
!725 = !DINamespace(name: "metadata", scope: !54)
!726 = !DISubroutineType(types: !727)
!727 = !{!9, !728}
!728 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const [u32]", file: !2, size: 128, align: 64, elements: !729, templateParams: !29, identifier: "8f6ec26f1cc1804c19c4adecd5f78144")
!729 = !{!730, !731}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !728, file: !2, baseType: !672, size: 64, align: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !728, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!732 = !{!721}
!733 = !DILocation(line: 94, column: 34, scope: !722, inlinedAt: !734)
!734 = !DILocation(line: 1938, column: 9, scope: !710, inlinedAt: !719)
!735 = !DILocation(line: 98, column: 14, scope: !722, inlinedAt: !734)
!736 = !DILocation(line: 483, column: 18, scope: !695, inlinedAt: !706)
!737 = !DILocation(line: 502, column: 6, scope: !663)
!738 = !DILocation(line: 498, column: 13, scope: !663)
!739 = distinct !DISubprogram(name: "new<core::slice::iter::Iter<u32>, core::slice::iter::Iter<usize>>", linkageName: "_ZN111_$LT$core..iter..adapters..zip..Zip$LT$A$C$B$GT$$u20$as$u20$core..iter..adapters..zip..ZipImpl$LT$A$C$B$GT$$GT$3new17h2bcac1f44f9d4395E", scope: !740, file: !509, line: 300, type: !741, scopeLine: 300, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !403, templateParams: !605, retainedNodes: !743)
!740 = !DINamespace(name: "{impl#5}", scope: !511)
!741 = !DISubroutineType(types: !742)
!742 = !{!598, !554, !539}
!743 = !{!744, !745, !746, !748}
!744 = !DILocalVariable(name: "a", arg: 1, scope: !739, file: !509, line: 300, type: !554)
!745 = !DILocalVariable(name: "b", arg: 2, scope: !739, file: !509, line: 300, type: !539)
!746 = !DILocalVariable(name: "a_len", scope: !747, file: !509, line: 301, type: !9, align: 8)
!747 = distinct !DILexicalBlock(scope: !739, file: !509, line: 301, column: 9)
!748 = !DILocalVariable(name: "len", scope: !749, file: !509, line: 302, type: !9, align: 8)
!749 = distinct !DILexicalBlock(scope: !747, file: !509, line: 302, column: 9)
!750 = !DILocation(line: 300, column: 12, scope: !739)
!751 = !DILocation(line: 300, column: 18, scope: !739)
!752 = !DILocation(line: 301, column: 21, scope: !739)
!753 = !DILocation(line: 300, column: 5, scope: !739)
!754 = !DILocation(line: 301, column: 13, scope: !747)
!755 = !DILocalVariable(name: "v1", arg: 1, scope: !756, file: !757, line: 1253, type: !9)
!756 = distinct !DILexicalBlock(scope: !758, file: !757, line: 1253, column: 1)
!757 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/cmp.rs", directory: "", checksumkind: CSK_MD5, checksum: "a92d0ff535cd882f49f92c6340fed1e4")
!758 = distinct !DISubprogram(name: "min<usize>", linkageName: "_ZN4core3cmp3min17hac00c3dd030500f0E", scope: !759, file: !757, line: 1253, type: !760, scopeLine: 1253, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !403, templateParams: !240, retainedNodes: !762)
!759 = !DINamespace(name: "cmp", scope: !33)
!760 = !DISubroutineType(types: !761)
!761 = !{!9, !9, !9}
!762 = !{!755, !763}
!763 = !DILocalVariable(name: "v2", arg: 2, scope: !756, file: !757, line: 1253, type: !9)
!764 = !DILocation(line: 1253, column: 20, scope: !756, inlinedAt: !765)
!765 = !DILocation(line: 302, column: 19, scope: !747)
!766 = !DILocalVariable(name: "self", arg: 1, scope: !767, file: !757, line: 871, type: !9)
!767 = distinct !DILexicalBlock(scope: !768, file: !757, line: 871, column: 5)
!768 = distinct !DISubprogram(name: "min<usize>", linkageName: "_ZN4core3cmp3Ord3min17h63549935687ba88dE", scope: !769, file: !757, line: 871, type: !760, scopeLine: 871, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !403, templateParams: !772, retainedNodes: !770)
!769 = !DINamespace(name: "Ord", scope: !759)
!770 = !{!766, !771}
!771 = !DILocalVariable(name: "other", arg: 2, scope: !767, file: !757, line: 871, type: !9)
!772 = !{!773}
!773 = !DITemplateTypeParameter(name: "Self", type: !9)
!774 = !DILocation(line: 871, column: 12, scope: !767, inlinedAt: !775)
!775 = !DILocation(line: 1254, column: 8, scope: !756, inlinedAt: !765)
!776 = !DILocation(line: 302, column: 35, scope: !747)
!777 = !DILocation(line: 1253, column: 27, scope: !756, inlinedAt: !765)
!778 = !DILocation(line: 871, column: 18, scope: !767, inlinedAt: !775)
!779 = !DILocation(line: 875, column: 9, scope: !767, inlinedAt: !775)
!780 = !DILocation(line: 302, column: 13, scope: !749)
!781 = !DILocation(line: 303, column: 15, scope: !749)
!782 = !DILocation(line: 303, column: 18, scope: !749)
!783 = !DILocation(line: 303, column: 9, scope: !749)
!784 = !DILocation(line: 304, column: 6, scope: !739)
!785 = distinct !DISubprogram(name: "new<core::slice::iter::Iter<usize>, core::slice::iter::Iter<u32>>", linkageName: "_ZN111_$LT$core..iter..adapters..zip..Zip$LT$A$C$B$GT$$u20$as$u20$core..iter..adapters..zip..ZipImpl$LT$A$C$B$GT$$GT$3new17hc6e85ace1a8b0a87E", scope: !740, file: !509, line: 300, type: !786, scopeLine: 300, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !403, templateParams: !569, retainedNodes: !788)
!786 = !DISubroutineType(types: !787)
!787 = !{!536, !539, !554}
!788 = !{!789, !790, !791, !793}
!789 = !DILocalVariable(name: "a", arg: 1, scope: !785, file: !509, line: 300, type: !539)
!790 = !DILocalVariable(name: "b", arg: 2, scope: !785, file: !509, line: 300, type: !554)
!791 = !DILocalVariable(name: "a_len", scope: !792, file: !509, line: 301, type: !9, align: 8)
!792 = distinct !DILexicalBlock(scope: !785, file: !509, line: 301, column: 9)
!793 = !DILocalVariable(name: "len", scope: !794, file: !509, line: 302, type: !9, align: 8)
!794 = distinct !DILexicalBlock(scope: !792, file: !509, line: 302, column: 9)
!795 = !DILocation(line: 300, column: 12, scope: !785)
!796 = !DILocation(line: 300, column: 18, scope: !785)
!797 = !DILocation(line: 301, column: 21, scope: !785)
!798 = !DILocation(line: 300, column: 5, scope: !785)
!799 = !DILocation(line: 301, column: 13, scope: !792)
!800 = !DILocalVariable(name: "v1", arg: 1, scope: !801, file: !757, line: 1253, type: !9)
!801 = distinct !DILexicalBlock(scope: !802, file: !757, line: 1253, column: 1)
!802 = distinct !DISubprogram(name: "min<usize>", linkageName: "_ZN4core3cmp3min17hac00c3dd030500f0E", scope: !759, file: !757, line: 1253, type: !760, scopeLine: 1253, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !403, templateParams: !240, retainedNodes: !803)
!803 = !{!800, !804}
!804 = !DILocalVariable(name: "v2", arg: 2, scope: !801, file: !757, line: 1253, type: !9)
!805 = !DILocation(line: 1253, column: 20, scope: !801, inlinedAt: !806)
!806 = !DILocation(line: 302, column: 19, scope: !792)
!807 = !DILocalVariable(name: "self", arg: 1, scope: !808, file: !757, line: 871, type: !9)
!808 = distinct !DILexicalBlock(scope: !809, file: !757, line: 871, column: 5)
!809 = distinct !DISubprogram(name: "min<usize>", linkageName: "_ZN4core3cmp3Ord3min17h63549935687ba88dE", scope: !769, file: !757, line: 871, type: !760, scopeLine: 871, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !403, templateParams: !772, retainedNodes: !810)
!810 = !{!807, !811}
!811 = !DILocalVariable(name: "other", arg: 2, scope: !808, file: !757, line: 871, type: !9)
!812 = !DILocation(line: 871, column: 12, scope: !808, inlinedAt: !813)
!813 = !DILocation(line: 1254, column: 8, scope: !801, inlinedAt: !806)
!814 = !DILocation(line: 302, column: 35, scope: !792)
!815 = !DILocation(line: 1253, column: 27, scope: !801, inlinedAt: !806)
!816 = !DILocation(line: 871, column: 18, scope: !808, inlinedAt: !813)
!817 = !DILocation(line: 875, column: 9, scope: !808, inlinedAt: !813)
!818 = !DILocation(line: 302, column: 13, scope: !794)
!819 = !DILocation(line: 303, column: 15, scope: !794)
!820 = !DILocation(line: 303, column: 18, scope: !794)
!821 = !DILocation(line: 303, column: 9, scope: !794)
!822 = !DILocation(line: 304, column: 6, scope: !785)
!823 = distinct !DISubprogram(name: "next<core::slice::iter::Iter<usize>, core::slice::iter::Iter<u32>>", linkageName: "_ZN111_$LT$core..iter..adapters..zip..Zip$LT$A$C$B$GT$$u20$as$u20$core..iter..adapters..zip..ZipImpl$LT$A$C$B$GT$$GT$4next17h5fd6ad2c49cf7928E", scope: !740, file: !509, line: 307, type: !514, scopeLine: 307, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !403, templateParams: !569, retainedNodes: !824)
!824 = !{!825, !826, !828}
!825 = !DILocalVariable(name: "self", arg: 1, scope: !823, file: !509, line: 307, type: !535)
!826 = !DILocalVariable(name: "i", scope: !827, file: !509, line: 309, type: !9, align: 8)
!827 = distinct !DILexicalBlock(scope: !823, file: !509, line: 309, column: 13)
!828 = !DILocalVariable(name: "i", scope: !829, file: !509, line: 318, type: !9, align: 8)
!829 = distinct !DILexicalBlock(scope: !823, file: !509, line: 318, column: 13)
!830 = !DILocation(line: 307, column: 13, scope: !823)
!831 = !DILocation(line: 308, column: 12, scope: !823)
!832 = !DILocation(line: 308, column: 25, scope: !823)
!833 = !DILocation(line: 317, column: 19, scope: !823)
!834 = !DILocation(line: 309, column: 21, scope: !823)
!835 = !DILocation(line: 309, column: 17, scope: !827)
!836 = !DILocation(line: 312, column: 13, scope: !827)
!837 = !DILocation(line: 315, column: 23, scope: !827)
!838 = !DILocation(line: 315, column: 59, scope: !827)
!839 = !DILocation(line: 329, column: 13, scope: !823)
!840 = !DILocation(line: 317, column: 16, scope: !823)
!841 = !DILocation(line: 317, column: 46, scope: !823)
!842 = !DILocation(line: 317, column: 59, scope: !823)
!843 = !DILocation(line: 1, column: 1, scope: !844)
!844 = !DILexicalBlockFile(scope: !823, file: !845, discriminator: 0)
!845 = !DIFile(filename: "src/lib.rs", directory: "/private/var/folders/m6/nyw0tbd5239gngtm06pzykr00000gn/T/.tmpPXbnuW/rand_chacha", checksumkind: CSK_MD5, checksum: "a1e24a2519fac60ee2b396217d04235d")
!846 = !DILocation(line: 318, column: 21, scope: !823)
!847 = !DILocation(line: 318, column: 17, scope: !829)
!848 = !DILocation(line: 320, column: 13, scope: !829)
!849 = !DILocation(line: 321, column: 13, scope: !829)
!850 = !DILocation(line: 325, column: 17, scope: !829)
!851 = !DILocation(line: 327, column: 13, scope: !829)
!852 = !DILocation(line: 308, column: 9, scope: !823)
!853 = !DILocation(line: 331, column: 6, scope: !823)
!854 = !{i64 8}
!855 = !DILocation(line: 307, column: 5, scope: !823)
!856 = !DILocation(line: 315, column: 22, scope: !827)
!857 = !DILocation(line: 315, column: 17, scope: !827)
!858 = !{i64 4}
!859 = distinct !DISubprogram(name: "next<core::slice::iter::Iter<u32>, core::slice::iter::Iter<usize>>", linkageName: "_ZN111_$LT$core..iter..adapters..zip..Zip$LT$A$C$B$GT$$u20$as$u20$core..iter..adapters..zip..ZipImpl$LT$A$C$B$GT$$GT$4next17h87e59f8765831377E", scope: !740, file: !509, line: 307, type: !578, scopeLine: 307, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !403, templateParams: !605, retainedNodes: !860)
!860 = !{!861, !862, !864}
!861 = !DILocalVariable(name: "self", arg: 1, scope: !859, file: !509, line: 307, type: !597)
!862 = !DILocalVariable(name: "i", scope: !863, file: !509, line: 309, type: !9, align: 8)
!863 = distinct !DILexicalBlock(scope: !859, file: !509, line: 309, column: 13)
!864 = !DILocalVariable(name: "i", scope: !865, file: !509, line: 318, type: !9, align: 8)
!865 = distinct !DILexicalBlock(scope: !859, file: !509, line: 318, column: 13)
!866 = !DILocation(line: 307, column: 13, scope: !859)
!867 = !DILocation(line: 308, column: 12, scope: !859)
!868 = !DILocation(line: 308, column: 25, scope: !859)
!869 = !DILocation(line: 317, column: 19, scope: !859)
!870 = !DILocation(line: 309, column: 21, scope: !859)
!871 = !DILocation(line: 309, column: 17, scope: !863)
!872 = !DILocation(line: 312, column: 13, scope: !863)
!873 = !DILocation(line: 315, column: 23, scope: !863)
!874 = !DILocation(line: 315, column: 59, scope: !863)
!875 = !DILocation(line: 329, column: 13, scope: !859)
!876 = !DILocation(line: 317, column: 16, scope: !859)
!877 = !DILocation(line: 317, column: 46, scope: !859)
!878 = !DILocation(line: 317, column: 59, scope: !859)
!879 = !DILocation(line: 1, column: 1, scope: !880)
!880 = !DILexicalBlockFile(scope: !859, file: !845, discriminator: 0)
!881 = !DILocation(line: 318, column: 21, scope: !859)
!882 = !DILocation(line: 318, column: 17, scope: !865)
!883 = !DILocation(line: 320, column: 13, scope: !865)
!884 = !DILocation(line: 321, column: 13, scope: !865)
!885 = !DILocation(line: 325, column: 17, scope: !865)
!886 = !DILocation(line: 327, column: 13, scope: !865)
!887 = !DILocation(line: 308, column: 9, scope: !859)
!888 = !DILocation(line: 331, column: 6, scope: !859)
!889 = !DILocation(line: 307, column: 5, scope: !859)
!890 = !DILocation(line: 315, column: 22, scope: !863)
!891 = !DILocation(line: 315, column: 17, scope: !863)
!892 = distinct !DISubprogram(name: "call_once<(), std::sys::thread_local::fast_local::destroy_value::{closure_env#0}<alloc::rc::Rc<core::cell::UnsafeCell<rand::rngs::adapter::reseeding::ReseedingRng<rand_chacha::chacha::ChaCha12Core, rand_core::os::OsRng>>, alloc::alloc::Global>>>", linkageName: "_ZN115_$LT$core..panic..unwind_safe..AssertUnwindSafe$LT$F$GT$$u20$as$u20$core..ops..function..FnOnce$LT$$LP$$RP$$GT$$GT$9call_once17h2db972e9c159fbe4E", scope: !894, file: !893, line: 271, type: !896, scopeLine: 271, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !403, templateParams: !913, retainedNodes: !909)
!893 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/panic/unwind_safe.rs", directory: "", checksumkind: CSK_MD5, checksum: "3aeae5e206c350fd6397a6ba1631e091")
!894 = !DINamespace(name: "{impl#25}", scope: !895)
!895 = !DINamespace(name: "unwind_safe", scope: !683)
!896 = !DISubroutineType(types: !897)
!897 = !{null, !898}
!898 = !DICompositeType(tag: DW_TAG_structure_type, name: "AssertUnwindSafe<std::sys::thread_local::fast_local::destroy_value::{closure_env#0}<alloc::rc::Rc<core::cell::UnsafeCell<rand::rngs::adapter::reseeding::ReseedingRng<rand_chacha::chacha::ChaCha12Core, rand_core::os::OsRng>>, alloc::alloc::Global>>>", scope: !895, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !899, templateParams: !907, identifier: "7fe58b8eb395383c59b2b908dc2f5006")
!899 = !{!900}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !898, file: !2, baseType: !901, size: 64, align: 64, flags: DIFlagPublic)
!901 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<alloc::rc::Rc<core::cell::UnsafeCell<rand::rngs::adapter::reseeding::ReseedingRng<rand_chacha::chacha::ChaCha12Core, rand_core::os::OsRng>>, alloc::alloc::Global>>", scope: !902, file: !2, size: 64, align: 64, elements: !903, templateParams: !29, identifier: "9105b88da84f37ebbb5c939b36ec5012")
!902 = !DINamespace(name: "destroy_value", scope: !269)
!903 = !{!904}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__ptr", scope: !901, file: !2, baseType: !905, size: 64, align: 64)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&*mut std::sys::thread_local::fast_local::Key<alloc::rc::Rc<core::cell::UnsafeCell<rand::rngs::adapter::reseeding::ReseedingRng<rand_chacha::chacha::ChaCha12Core, rand_core::os::OsRng>>, alloc::alloc::Global>>", baseType: !906, size: 64, align: 64, dwarfAddressSpace: 0)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut std::sys::thread_local::fast_local::Key<alloc::rc::Rc<core::cell::UnsafeCell<rand::rngs::adapter::reseeding::ReseedingRng<rand_chacha::chacha::ChaCha12Core, rand_core::os::OsRng>>, alloc::alloc::Global>>", baseType: !268, size: 64, align: 64, dwarfAddressSpace: 0)
!907 = !{!908}
!908 = !DITemplateTypeParameter(name: "T", type: !901)
!909 = !{!910, !911, !912}
!910 = !DILocalVariable(name: "self", arg: 1, scope: !892, file: !893, line: 271, type: !898)
!911 = !DILocalVariable(name: "_args", scope: !892, file: !893, line: 271, type: !7, align: 1)
!912 = !DILocalVariable(arg: 2, scope: !892, file: !893, line: 271, type: !7)
!913 = !{!914, !915}
!914 = !DITemplateTypeParameter(name: "R", type: !7)
!915 = !DITemplateTypeParameter(name: "F", type: !901)
!916 = !DILocation(line: 271, column: 43, scope: !892)
!917 = !DILocation(line: 271, column: 37, scope: !892)
!918 = !DILocation(line: 272, column: 9, scope: !892)
!919 = !DILocation(line: 273, column: 6, scope: !892)
!920 = distinct !DISubprogram(name: "from_residual<rand_chacha::chacha::ChaCha12Core, rand_core::error::Error, rand_core::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17hbd0103c1579bb8d3E", scope: !922, file: !921, line: 1962, type: !923, scopeLine: 1962, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !403, templateParams: !963, retainedNodes: !959)
!921 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/result.rs", directory: "", checksumkind: CSK_MD5, checksum: "96c793a7caa821b2d8ecbbb7303607a6")
!922 = !DINamespace(name: "{impl#27}", scope: !32)
!923 = !DISubroutineType(types: !924)
!924 = !{!925, !945, !680}
!925 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<rand_chacha::chacha::ChaCha12Core, rand_core::error::Error>", scope: !32, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !926, templateParams: !29, identifier: "20f9dacd0b6f6deb953e5ec041a2b58e")
!926 = !{!927}
!927 = !DICompositeType(tag: DW_TAG_variant_part, scope: !925, file: !2, size: 448, align: 64, elements: !928, templateParams: !29, identifier: "b70ed9ff3a5fd90fe029622ef0e6ec1d", discriminator: !944)
!928 = !{!929, !940}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !927, file: !2, baseType: !930, size: 448, align: 64, extraData: i128 0)
!930 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !925, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !931, templateParams: !933, identifier: "678dc093d4c9c6a45276eee7a79f6afe")
!931 = !{!932}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !930, file: !2, baseType: !332, size: 384, align: 64, offset: 64, flags: DIFlagPublic)
!933 = !{!934, !935}
!934 = !DITemplateTypeParameter(name: "T", type: !332)
!935 = !DITemplateTypeParameter(name: "E", type: !936)
!936 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !937, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !938, templateParams: !29, identifier: "947de11bdf4c680ac2bc58e38623c1ab")
!937 = !DINamespace(name: "error", scope: !313)
!938 = !{!939}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !936, file: !2, baseType: !123, size: 128, align: 64, flags: DIFlagPrivate)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !927, file: !2, baseType: !941, size: 448, align: 64, extraData: i128 1)
!941 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !925, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !942, templateParams: !933, identifier: "d9b17742e7c7afba7e65ecfcc294b6e8")
!942 = !{!943}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !941, file: !2, baseType: !936, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!944 = !DIDerivedType(tag: DW_TAG_member, scope: !925, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagArtificial)
!945 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<core::convert::Infallible, rand_core::error::Error>", scope: !32, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !946, templateParams: !29, identifier: "add36dca1819a336d2b3fb1dfe3030bb")
!946 = !{!947}
!947 = !DICompositeType(tag: DW_TAG_variant_part, scope: !945, file: !2, size: 128, align: 64, elements: !948, templateParams: !29, identifier: "5cfa9ef2d1724f804d6e962ed6e2a395")
!948 = !{!949, !955}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !947, file: !2, baseType: !950, size: 128, align: 64)
!950 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !945, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !951, templateParams: !953, identifier: "f5efdd6a438c4baa981500cad163dc88")
!951 = !{!952}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !950, file: !2, baseType: !644, align: 8, flags: DIFlagPublic)
!953 = !{!954, !935}
!954 = !DITemplateTypeParameter(name: "T", type: !644)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !947, file: !2, baseType: !956, size: 128, align: 64)
!956 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !945, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !957, templateParams: !953, identifier: "4df8c003e9d40c196111af7a97cae3de")
!957 = !{!958}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !956, file: !2, baseType: !936, size: 128, align: 64, flags: DIFlagPublic)
!959 = !{!960, !961}
!960 = !DILocalVariable(name: "residual", arg: 1, scope: !920, file: !921, line: 1962, type: !945)
!961 = !DILocalVariable(name: "e", scope: !962, file: !921, line: 1964, type: !936, align: 8)
!962 = distinct !DILexicalBlock(scope: !920, file: !921, line: 1964, column: 13)
!963 = !{!934, !935, !964}
!964 = !DITemplateTypeParameter(name: "F", type: !936)
!965 = !DILocation(line: 1962, column: 22, scope: !920)
!966 = !DILocation(line: 1964, column: 17, scope: !920)
!967 = !{i64 1}
!968 = !DILocation(line: 1964, column: 17, scope: !962)
!969 = !DILocalVariable(name: "t", arg: 1, scope: !970, file: !971, line: 768, type: !936)
!970 = distinct !DISubprogram(name: "from<rand_core::error::Error>", linkageName: "_ZN50_$LT$T$u20$as$u20$core..convert..From$LT$T$GT$$GT$4from17ha093819166001c7eE", scope: !972, file: !971, line: 768, type: !973, scopeLine: 768, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !403, templateParams: !976, retainedNodes: !975)
!971 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/convert/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "c9b89024c4b3608225f6d01d745ad8ef")
!972 = !DINamespace(name: "{impl#4}", scope: !645)
!973 = !DISubroutineType(types: !974)
!974 = !{!936, !936}
!975 = !{!969}
!976 = !{!977}
!977 = !DITemplateTypeParameter(name: "T", type: !936)
!978 = !DILocation(line: 768, column: 13, scope: !970, inlinedAt: !979)
!979 = distinct !DILocation(line: 1964, column: 27, scope: !962)
!980 = !DILocation(line: 770, column: 6, scope: !970, inlinedAt: !979)
!981 = !DILocation(line: 1964, column: 27, scope: !962)
