; ModuleID = '11yfthea48squq3o'
source_filename = "11yfthea48squq3o"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128"
target triple = "arm64-apple-macosx11.0.0"

%"core::ops::control_flow::ControlFlow<(), core::convert::Infallible>::Break" = type { {} }
%"core::ops::range::Range<usize>" = type { i64, i64 }
%"core::ptr::metadata::PtrComponents<[u8]>" = type { ptr, i64 }
%"core::ptr::metadata::PtrRepr<[u8]>" = type { [2 x i64] }
%"core::option::Option<&[u8]>" = type { ptr, [1 x i64] }
%"core::option::Option<(usize, &Comparator)>" = type { [1 x i64], ptr }
%"core::option::Option<core::convert::Infallible>::None" = type {}
%"core::result::Result<VersionReq, parse::Error>" = type { i64, [2 x i64] }
%"parse::Error" = type { %"error::ErrorKind" }
%"error::ErrorKind" = type { i8, [7 x i8] }
%"core::result::Result<core::convert::Infallible, parse::Error>::Err" = type { %"parse::Error" }
%"core::result::Result<Prerelease, parse::Error>" = type { i32, [3 x i32] }
%"core::result::Result<(Prerelease, &str), parse::Error>" = type { ptr, [2 x i64] }
%"core::result::Result<usize, parse::Error>" = type { i32, [3 x i32] }
%"core::result::Result<(BuildMetadata, &str), parse::Error>" = type { ptr, [2 x i64] }
%"core::result::Result<(Comparator, error::Position, &str), parse::Error>" = type { i64, [9 x i64] }
%"core::result::Result<Version, parse::Error>" = type { ptr, [4 x i64] }
%"core::result::Result<Comparator, parse::Error>" = type { i64, [6 x i64] }
%"core::fmt::Error" = type {}

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<core::num::error::TryFromIntError as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::num::error::TryFromIntError as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !18, identifier: "4f456492dc965983c30f25c28865868f")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "TryFromIntError", scope: !13, file: !2, align: 8, flags: DIFlagPublic, elements: !16, templateParams: !18, identifier: "fb4710b97ea6f023592d3043b5f6528b")
!13 = !DINamespace(name: "error", scope: !14)
!14 = !DINamespace(name: "num", scope: !15)
!15 = !DINamespace(name: "core", scope: null)
!16 = !{!17}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !12, file: !2, baseType: !7, align: 8, flags: DIFlagProtected)
!18 = !{}
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "<&() as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !21, isLocal: true, isDefinition: true)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&() as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !22, vtableHolder: !27, templateParams: !18, identifier: "5f5f8a8bf9e0d198a0202032c4ac8672")
!22 = !{!23, !24, !25, !26}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !21, file: !2, baseType: !6, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !21, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !21, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !21, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "<u64 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !30, isLocal: true, isDefinition: true)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u64 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !31, vtableHolder: !36, templateParams: !18, identifier: "69c1808bb289e1aede86b823cd462e12")
!31 = !{!32, !33, !34, !35}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !30, file: !2, baseType: !6, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !30, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !30, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !30, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!36 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "<semver::Prerelease as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !39, isLocal: true, isDefinition: true)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "<semver::Prerelease as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !40, vtableHolder: !45, templateParams: !18, identifier: "7fef3ccc06c173bdf938789896a54c4e")
!40 = !{!41, !42, !43, !44}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !39, file: !2, baseType: !6, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !39, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !39, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !39, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "Prerelease", scope: !46, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !47, templateParams: !18, identifier: "d1f7ab95904a4801d98325df1f57ad5e")
!46 = !DINamespace(name: "semver", scope: null)
!47 = !{!48}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !45, file: !2, baseType: !49, size: 64, align: 64, flags: DIFlagPrivate)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "Identifier", scope: !50, file: !2, size: 64, align: 64, flags: DIFlagProtected, elements: !51, templateParams: !18, identifier: "339db308175c040a95fb6bb5fabf3b11")
!50 = !DINamespace(name: "identifier", scope: !46)
!51 = !{!52, !62}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !49, file: !2, baseType: !53, size: 64, align: 64, flags: DIFlagPrivate)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !54, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !56, templateParams: !60, identifier: "e5aae4d783c62ca19d6192838800021b")
!54 = !DINamespace(name: "non_null", scope: !55)
!55 = !DINamespace(name: "ptr", scope: !15)
!56 = !{!57}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !53, file: !2, baseType: !58, size: 64, align: 64, flags: DIFlagPrivate)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !59, size: 64, align: 64, dwarfAddressSpace: 0)
!59 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!60 = !{!61}
!61 = !DITemplateTypeParameter(name: "T", type: !59)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !49, file: !2, baseType: !63, align: 8, offset: 64, flags: DIFlagPrivate)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, align: 8, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 0, lowerBound: 0)
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "<semver::BuildMetadata as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !68, isLocal: true, isDefinition: true)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "<semver::BuildMetadata as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !69, vtableHolder: !74, templateParams: !18, identifier: "4327b850a08b91e3f81f87d8e560a2b5")
!69 = !{!70, !71, !72, !73}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !68, file: !2, baseType: !6, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !68, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !68, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !68, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuildMetadata", scope: !46, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !75, templateParams: !18, identifier: "2cec4d251342f4ff928ddf8d34a1205b")
!75 = !{!76}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !74, file: !2, baseType: !49, size: 64, align: 64, flags: DIFlagPrivate)
!77 = !{i32 8, !"PIC Level", i32 2}
!78 = !{i32 2, !"Dwarf Version", i32 4}
!79 = !{i32 2, !"Debug Info Version", i32 3}
!80 = !{!"rustc version 1.78.0-nightly (46b180ec2 2024-03-08)"}
!81 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !82, producer: "clang LLVM (rustc version 1.78.0-nightly (46b180ec2 2024-03-08))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !83, globals: !192, splitDebugInlining: false, nameTableKind: None)
!82 = !DIFile(filename: "src/lib.rs/@/11yfthea48squq3o", directory: "/private/var/folders/m6/nyw0tbd5239gngtm06pzykr00000gn/T/.tmpPXbnuW/semver")
!83 = !{!84, !94, !102, !110, !117, !119, !186}
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Op", scope: !46, file: !2, baseType: !59, size: 8, align: 8, flags: DIFlagEnumClass, elements: !85)
!85 = !{!86, !87, !88, !89, !90, !91, !92, !93}
!86 = !DIEnumerator(name: "Exact", value: 0, isUnsigned: true)
!87 = !DIEnumerator(name: "Greater", value: 1, isUnsigned: true)
!88 = !DIEnumerator(name: "GreaterEq", value: 2, isUnsigned: true)
!89 = !DIEnumerator(name: "Less", value: 3, isUnsigned: true)
!90 = !DIEnumerator(name: "LessEq", value: 4, isUnsigned: true)
!91 = !DIEnumerator(name: "Tilde", value: 5, isUnsigned: true)
!92 = !DIEnumerator(name: "Caret", value: 6, isUnsigned: true)
!93 = !DIEnumerator(name: "Wildcard", value: 7, isUnsigned: true)
!94 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Position", scope: !95, file: !2, baseType: !59, size: 8, align: 8, flags: DIFlagEnumClass, elements: !96)
!95 = !DINamespace(name: "error", scope: !46)
!96 = !{!97, !98, !99, !100, !101}
!97 = !DIEnumerator(name: "Major", value: 0, isUnsigned: true)
!98 = !DIEnumerator(name: "Minor", value: 1, isUnsigned: true)
!99 = !DIEnumerator(name: "Patch", value: 2, isUnsigned: true)
!100 = !DIEnumerator(name: "Pre", value: 3, isUnsigned: true)
!101 = !DIEnumerator(name: "Build", value: 4, isUnsigned: true)
!102 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !103, file: !2, baseType: !59, size: 8, align: 8, flags: DIFlagEnumClass, elements: !105)
!103 = !DINamespace(name: "rt", scope: !104)
!104 = !DINamespace(name: "fmt", scope: !15)
!105 = !{!106, !107, !108, !109}
!106 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!107 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!108 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!109 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!110 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !111, file: !2, baseType: !112, size: 8, align: 8, flags: DIFlagEnumClass, elements: !113)
!111 = !DINamespace(name: "cmp", scope: !15)
!112 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!113 = !{!114, !115, !116}
!114 = !DIEnumerator(name: "Less", value: -1)
!115 = !DIEnumerator(name: "Equal", value: 0)
!116 = !DIEnumerator(name: "Greater", value: 1)
!117 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !104, file: !2, baseType: !59, size: 8, align: 8, flags: DIFlagEnumClass, elements: !118)
!118 = !{!106, !107, !108}
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AlignmentEnum", scope: !120, file: !2, baseType: !36, size: 64, align: 64, flags: DIFlagEnumClass, elements: !121)
!120 = !DINamespace(name: "alignment", scope: !55)
!121 = !{!122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185}
!122 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!123 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!124 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!125 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!126 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!127 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!128 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!129 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!130 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!131 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!132 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!133 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!134 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!135 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!136 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!137 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!138 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!139 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!140 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!141 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!142 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!143 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!144 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!145 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!146 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!147 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!148 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!149 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!150 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!151 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!152 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!153 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!154 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!155 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!156 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!157 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!158 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!159 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!160 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!161 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!162 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!163 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!164 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!165 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!166 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!167 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!168 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!169 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!170 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!171 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!172 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!173 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!174 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!175 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!176 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!177 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!178 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!179 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!180 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!181 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!182 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!183 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!184 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!185 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!186 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !187, file: !2, baseType: !59, size: 8, align: 8, flags: DIFlagEnumClass, elements: !188)
!187 = !DINamespace(name: "panicking", scope: !15)
!188 = !{!189, !190, !191}
!189 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!190 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!191 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!192 = !{!0, !19, !28, !37, !66}
!193 = distinct !DISubprogram(name: "from_residual<(), ()>", linkageName: "_ZN104_$LT$core..ops..control_flow..ControlFlow$LT$B$C$C$GT$$u20$as$u20$core..ops..try_trait..FromResidual$GT$13from_residual17hd0a2349df31771beE", scope: !195, file: !194, line: 121, type: !198, scopeLine: 121, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !81, templateParams: !208, retainedNodes: !234)
!194 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/ops/control_flow.rs", directory: "", checksumkind: CSK_MD5, checksum: "3c00595f3fc02f6a911e33c3b35d9063")
!195 = !DINamespace(name: "{impl#1}", scope: !196)
!196 = !DINamespace(name: "control_flow", scope: !197)
!197 = !DINamespace(name: "ops", scope: !15)
!198 = !DISubroutineType(types: !199)
!199 = !{!200, !216}
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "ControlFlow<(), ()>", scope: !196, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !201, templateParams: !18, identifier: "6c6428ee6d5531f9994f31fd543cfad8")
!201 = !{!202}
!202 = !DICompositeType(tag: DW_TAG_variant_part, scope: !200, file: !2, size: 8, align: 8, elements: !203, templateParams: !18, identifier: "e5bd22aa25ac50b44d4e55eef17d7da8", discriminator: !215)
!203 = !{!204, !211}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Continue", scope: !202, file: !2, baseType: !205, size: 8, align: 8, extraData: i128 0)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "Continue", scope: !200, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !206, templateParams: !208, identifier: "2c2315c73b5dba96fbde32e57aea3649")
!206 = !{!207}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !205, file: !2, baseType: !7, align: 8, offset: 8, flags: DIFlagPublic)
!208 = !{!209, !210}
!209 = !DITemplateTypeParameter(name: "B", type: !7)
!210 = !DITemplateTypeParameter(name: "C", type: !7)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "Break", scope: !202, file: !2, baseType: !212, size: 8, align: 8, extraData: i128 1)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "Break", scope: !200, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !213, templateParams: !208, identifier: "b1417a7f80bfa02212dedfaa47fb646e")
!213 = !{!214}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !212, file: !2, baseType: !7, align: 8, offset: 8, flags: DIFlagPublic)
!215 = !DIDerivedType(tag: DW_TAG_member, scope: !200, file: !2, baseType: !59, size: 8, align: 8, flags: DIFlagArtificial)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "ControlFlow<(), core::convert::Infallible>", scope: !196, file: !2, align: 8, flags: DIFlagPublic, elements: !217, templateParams: !18, identifier: "1a2f9a7da5d20234332b250f66990fe8")
!217 = !{!218}
!218 = !DICompositeType(tag: DW_TAG_variant_part, scope: !216, file: !2, align: 8, elements: !219, templateParams: !18, identifier: "78d8f7b93d172c29f58ea322596dcb28")
!219 = !{!220, !230}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "Continue", scope: !218, file: !2, baseType: !221, align: 8)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "Continue", scope: !216, file: !2, align: 8, flags: DIFlagPublic, elements: !222, templateParams: !228, identifier: "4e085d1ca0dcf96f2736ab4a465db7be")
!222 = !{!223}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !221, file: !2, baseType: !224, align: 8, flags: DIFlagPublic)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "Infallible", scope: !225, file: !2, align: 8, flags: DIFlagPublic, elements: !226, templateParams: !18, identifier: "fa13d0b7c38db284bf843fd30710797a")
!225 = !DINamespace(name: "convert", scope: !15)
!226 = !{!227}
!227 = !DICompositeType(tag: DW_TAG_variant_part, scope: !224, file: !2, align: 8, elements: !18, identifier: "5ade76f3e3c84d3f8835c5b79b9ad8")
!228 = !{!209, !229}
!229 = !DITemplateTypeParameter(name: "C", type: !224)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "Break", scope: !218, file: !2, baseType: !231, align: 8)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "Break", scope: !216, file: !2, align: 8, flags: DIFlagPublic, elements: !232, templateParams: !228, identifier: "304e6d685304a36fbbcf9a44c2da2b14")
!232 = !{!233}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !231, file: !2, baseType: !7, align: 8, flags: DIFlagPublic)
!234 = !{!235, !236}
!235 = !DILocalVariable(name: "residual", arg: 1, scope: !193, file: !194, line: 121, type: !216)
!236 = !DILocalVariable(name: "b", scope: !237, file: !194, line: 123, type: !7, align: 1)
!237 = distinct !DILexicalBlock(scope: !193, file: !194, line: 123, column: 13)
!238 = !DILocation(line: 121, column: 22, scope: !193)
!239 = !DILocation(line: 123, column: 32, scope: !237)
!240 = !DILocation(line: 123, column: 38, scope: !237)
!241 = !DILocation(line: 125, column: 6, scope: !193)
!242 = !{i8 0, i8 2}
!243 = distinct !DISubprogram(name: "get_unchecked<u8>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$13get_unchecked17h19bd0d05e5968e6fE", scope: !245, file: !244, line: 369, type: !248, scopeLine: 369, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !81, templateParams: !60, retainedNodes: !262)
!244 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/slice/index.rs", directory: "", checksumkind: CSK_MD5, checksum: "64a8de5498ea10af39073650ed20d9c4")
!245 = !DINamespace(name: "{impl#4}", scope: !246)
!246 = !DINamespace(name: "index", scope: !247)
!247 = !DINamespace(name: "slice", scope: !15)
!248 = !DISubroutineType(types: !249)
!249 = !{!250, !255, !250}
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const [u8]", file: !2, size: 128, align: 64, elements: !251, templateParams: !18, identifier: "a329dffc2f36de2e98a77091932cf429")
!251 = !{!252, !254}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !250, file: !2, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64, dwarfAddressSpace: 0)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !250, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "Range<usize>", scope: !256, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !257, templateParams: !260, identifier: "f65b1cf4d4964ccf292dc65f489dea85")
!256 = !DINamespace(name: "range", scope: !197)
!257 = !{!258, !259}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !255, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPublic)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !255, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!260 = !{!261}
!261 = !DITemplateTypeParameter(name: "Idx", type: !9)
!262 = !{!263, !264, !265}
!263 = !DILocalVariable(name: "self", arg: 1, scope: !243, file: !244, line: 369, type: !255)
!264 = !DILocalVariable(name: "slice", arg: 2, scope: !243, file: !244, line: 369, type: !250)
!265 = !DILocalVariable(name: "new_len", scope: !266, file: !244, line: 380, type: !9, align: 8)
!266 = distinct !DILexicalBlock(scope: !243, file: !244, line: 380, column: 13)
!267 = !DILocation(line: 369, column: 29, scope: !243)
!268 = !DILocation(line: 369, column: 35, scope: !243)
!269 = !DILocalVariable(name: "self", arg: 1, scope: !270, file: !271, line: 1666, type: !250)
!270 = distinct !DILexicalBlock(scope: !272, file: !271, line: 1666, column: 5)
!271 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/ptr/const_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "497dd18e023476b8914a8083d081a04c")
!272 = distinct !DISubprogram(name: "len<u8>", linkageName: "_ZN4core3ptr9const_ptr43_$LT$impl$u20$$BP$const$u20$$u5b$T$u5d$$GT$3len17he51b78bc33cc5b0fE", scope: !273, file: !271, line: 1666, type: !275, scopeLine: 1666, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !81, templateParams: !60, retainedNodes: !277)
!273 = !DINamespace(name: "{impl#1}", scope: !274)
!274 = !DINamespace(name: "const_ptr", scope: !55)
!275 = !DISubroutineType(types: !276)
!276 = !{!9, !250}
!277 = !{!269}
!278 = !DILocation(line: 1666, column: 22, scope: !270, inlinedAt: !279)
!279 = !DILocation(line: 371, column: 57, scope: !243)
!280 = !DILocalVariable(name: "ptr", arg: 1, scope: !281, file: !282, line: 94, type: !250)
!281 = distinct !DILexicalBlock(scope: !283, file: !282, line: 94, column: 1)
!282 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/ptr/metadata.rs", directory: "", checksumkind: CSK_MD5, checksum: "3e5f46ed28de51d38cc460b6ffb611d6")
!283 = distinct !DISubprogram(name: "metadata<[u8]>", linkageName: "_ZN4core3ptr8metadata8metadata17h6bcb8cbb1e2c59ccE", scope: !284, file: !282, line: 94, type: !275, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !81, templateParams: !60, retainedNodes: !285)
!284 = !DINamespace(name: "metadata", scope: !55)
!285 = !{!280}
!286 = !DILocation(line: 94, column: 34, scope: !281, inlinedAt: !287)
!287 = !DILocation(line: 1667, column: 9, scope: !270, inlinedAt: !279)
!288 = !DILocalVariable(name: "self", arg: 1, scope: !289, file: !271, line: 1704, type: !250)
!289 = distinct !DILexicalBlock(scope: !290, file: !271, line: 1704, column: 5)
!290 = distinct !DISubprogram(name: "as_ptr<u8>", linkageName: "_ZN4core3ptr9const_ptr43_$LT$impl$u20$$BP$const$u20$$u5b$T$u5d$$GT$6as_ptr17h550e7ffdf7ca4b88E", scope: !273, file: !271, line: 1704, type: !291, scopeLine: 1704, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !81, templateParams: !60, retainedNodes: !293)
!291 = !DISubroutineType(types: !292)
!292 = !{!58, !250}
!293 = !{!288}
!294 = !DILocation(line: 1704, column: 25, scope: !289, inlinedAt: !295)
!295 = !DILocation(line: 381, column: 45, scope: !266)
!296 = !DILocation(line: 370, column: 9, scope: !243)
!297 = !DILocation(line: 371, column: 13, scope: !243)
!298 = !DILocation(line: 1, column: 1, scope: !299)
!299 = !DILexicalBlockFile(scope: !243, file: !300, discriminator: 0)
!300 = !DIFile(filename: "src/lib.rs", directory: "/private/var/folders/m6/nyw0tbd5239gngtm06pzykr00000gn/T/.tmpPXbnuW/semver", checksumkind: CSK_MD5, checksum: "4853a8b32fb428740e84cdd2f2547e02")
!301 = !DILocation(line: 98, column: 14, scope: !281, inlinedAt: !287)
!302 = !DILocation(line: 371, column: 39, scope: !243)
!303 = !DILocation(line: 380, column: 51, scope: !243)
!304 = !DILocalVariable(name: "count", arg: 2, scope: !305, file: !271, line: 945, type: !9)
!305 = distinct !DILexicalBlock(scope: !306, file: !271, line: 945, column: 5)
!306 = distinct !DISubprogram(name: "add<u8>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$3add17hff736329ab886ef5E", scope: !307, file: !271, line: 945, type: !308, scopeLine: 945, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !81, templateParams: !60, retainedNodes: !310)
!307 = !DINamespace(name: "{impl#0}", scope: !274)
!308 = !DISubroutineType(types: !309)
!309 = !{!58, !58, !9}
!310 = !{!311, !304}
!311 = !DILocalVariable(name: "self", arg: 1, scope: !305, file: !271, line: 945, type: !58)
!312 = !DILocation(line: 945, column: 35, scope: !305, inlinedAt: !313)
!313 = !DILocation(line: 381, column: 54, scope: !266)
!314 = !DILocation(line: 380, column: 27, scope: !243)
!315 = !DILocation(line: 380, column: 17, scope: !266)
!316 = !DILocalVariable(name: "len", arg: 2, scope: !317, file: !318, line: 815, type: !9)
!317 = distinct !DILexicalBlock(scope: !319, file: !318, line: 815, column: 1)
!318 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "319662a8f09a06c38fa9ed06f53befd5")
!319 = distinct !DISubprogram(name: "slice_from_raw_parts<u8>", linkageName: "_ZN4core3ptr20slice_from_raw_parts17h8f700dd585f22acaE", scope: !55, file: !318, line: 815, type: !320, scopeLine: 815, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !81, templateParams: !60, retainedNodes: !322)
!320 = !DISubroutineType(types: !321)
!321 = !{!250, !58, !9}
!322 = !{!323, !316}
!323 = !DILocalVariable(name: "data", arg: 1, scope: !317, file: !318, line: 815, type: !58)
!324 = !DILocation(line: 815, column: 54, scope: !317, inlinedAt: !325)
!325 = !DILocation(line: 381, column: 13, scope: !266)
!326 = !DILocalVariable(name: "metadata", arg: 2, scope: !327, file: !282, line: 113, type: !9)
!327 = distinct !DILexicalBlock(scope: !328, file: !282, line: 111, column: 1)
!328 = distinct !DISubprogram(name: "from_raw_parts<[u8]>", linkageName: "_ZN4core3ptr8metadata14from_raw_parts17h3e324b2e522b41f4E", scope: !284, file: !282, line: 111, type: !329, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !81, templateParams: !60, retainedNodes: !331)
!329 = !DISubroutineType(types: !330)
!330 = !{!250, !6, !9}
!331 = !{!332, !326}
!332 = !DILocalVariable(name: "data_pointer", arg: 1, scope: !327, file: !282, line: 112, type: !6)
!333 = !DILocation(line: 113, column: 5, scope: !327, inlinedAt: !334)
!334 = !DILocation(line: 816, column: 5, scope: !317, inlinedAt: !325)
!335 = !DILocation(line: 1705, column: 9, scope: !289, inlinedAt: !295)
!336 = !DILocation(line: 945, column: 29, scope: !305, inlinedAt: !313)
!337 = !DILocation(line: 950, column: 18, scope: !305, inlinedAt: !313)
!338 = !DILocation(line: 815, column: 38, scope: !317, inlinedAt: !325)
!339 = !DILocalVariable(name: "self", arg: 1, scope: !340, file: !271, line: 63, type: !58)
!340 = distinct !DILexicalBlock(scope: !341, file: !271, line: 63, column: 5)
!341 = distinct !DISubprogram(name: "cast<u8, ()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17hb23f8f5fd771a088E", scope: !307, file: !271, line: 63, type: !342, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !81, templateParams: !345, retainedNodes: !344)
!342 = !DISubroutineType(types: !343)
!343 = !{!6, !58}
!344 = !{!339}
!345 = !{!61, !346}
!346 = !DITemplateTypeParameter(name: "U", type: !7)
!347 = !DILocation(line: 63, column: 26, scope: !340, inlinedAt: !348)
!348 = !DILocation(line: 816, column: 25, scope: !317, inlinedAt: !325)
!349 = !DILocation(line: 64, column: 9, scope: !340, inlinedAt: !348)
!350 = !DILocation(line: 112, column: 5, scope: !327, inlinedAt: !334)
!351 = !DILocation(line: 118, column: 36, scope: !327, inlinedAt: !334)
!352 = !DILocation(line: 118, column: 14, scope: !327, inlinedAt: !334)
!353 = !DILocation(line: 383, column: 6, scope: !243)
!354 = distinct !DISubprogram(name: "get_unchecked_mut<u8>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$17get_unchecked_mut17hc9a060efe1d79c1fE", scope: !245, file: !244, line: 386, type: !355, scopeLine: 386, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !81, templateParams: !60, retainedNodes: !361)
!355 = !DISubroutineType(types: !356)
!356 = !{!357, !255, !357}
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "*mut [u8]", file: !2, size: 128, align: 64, elements: !358, templateParams: !18, identifier: "bd558e033735f213c244d7572860f8f0")
!358 = !{!359, !360}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !357, file: !2, baseType: !253, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !357, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!361 = !{!362, !363, !364}
!362 = !DILocalVariable(name: "self", arg: 1, scope: !354, file: !244, line: 386, type: !255)
!363 = !DILocalVariable(name: "slice", arg: 2, scope: !354, file: !244, line: 386, type: !357)
!364 = !DILocalVariable(name: "new_len", scope: !365, file: !244, line: 393, type: !9, align: 8)
!365 = distinct !DILexicalBlock(scope: !354, file: !244, line: 393, column: 13)
!366 = !DILocation(line: 386, column: 33, scope: !354)
!367 = !DILocation(line: 386, column: 39, scope: !354)
!368 = !DILocalVariable(name: "self", arg: 1, scope: !369, file: !370, line: 1937, type: !357)
!369 = distinct !DILexicalBlock(scope: !371, file: !370, line: 1937, column: 5)
!370 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/ptr/mut_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "1660eb21212d739b6367ea84c0f4f627")
!371 = distinct !DISubprogram(name: "len<u8>", linkageName: "_ZN4core3ptr7mut_ptr41_$LT$impl$u20$$BP$mut$u20$$u5b$T$u5d$$GT$3len17h34ef8224fe395e1cE", scope: !372, file: !370, line: 1937, type: !374, scopeLine: 1937, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !81, templateParams: !60, retainedNodes: !376)
!372 = !DINamespace(name: "{impl#1}", scope: !373)
!373 = !DINamespace(name: "mut_ptr", scope: !55)
!374 = !DISubroutineType(types: !375)
!375 = !{!9, !357}
!376 = !{!368}
!377 = !DILocation(line: 1937, column: 22, scope: !369, inlinedAt: !378)
!378 = !DILocation(line: 388, column: 57, scope: !354)
!379 = !DILocalVariable(name: "self", arg: 1, scope: !380, file: !370, line: 2073, type: !357)
!380 = distinct !DILexicalBlock(scope: !381, file: !370, line: 2073, column: 5)
!381 = distinct !DISubprogram(name: "as_mut_ptr<u8>", linkageName: "_ZN4core3ptr7mut_ptr41_$LT$impl$u20$$BP$mut$u20$$u5b$T$u5d$$GT$10as_mut_ptr17h29ea5cf8392f5291E", scope: !372, file: !370, line: 2073, type: !382, scopeLine: 2073, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !81, templateParams: !60, retainedNodes: !385)
!382 = !DISubroutineType(types: !383)
!383 = !{!384, !357}
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !59, size: 64, align: 64, dwarfAddressSpace: 0)
!385 = !{!379}
!386 = !DILocation(line: 2073, column: 29, scope: !380, inlinedAt: !387)
!387 = !DILocation(line: 394, column: 49, scope: !365)
!388 = !DILocation(line: 387, column: 9, scope: !354)
!389 = !DILocation(line: 388, column: 13, scope: !354)
!390 = !DILocation(line: 1, column: 1, scope: !391)
!391 = !DILexicalBlockFile(scope: !354, file: !300, discriminator: 0)
!392 = !DILocation(line: 1938, column: 18, scope: !369, inlinedAt: !378)
!393 = !DILocalVariable(name: "ptr", arg: 1, scope: !394, file: !282, line: 94, type: !250)
!394 = distinct !DILexicalBlock(scope: !395, file: !282, line: 94, column: 1)
!395 = distinct !DISubprogram(name: "metadata<[u8]>", linkageName: "_ZN4core3ptr8metadata8metadata17h6bcb8cbb1e2c59ccE", scope: !284, file: !282, line: 94, type: !275, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !81, templateParams: !60, retainedNodes: !396)
!396 = !{!393}
!397 = !DILocation(line: 94, column: 34, scope: !394, inlinedAt: !398)
!398 = !DILocation(line: 1938, column: 9, scope: !369, inlinedAt: !378)
!399 = !DILocation(line: 98, column: 14, scope: !394, inlinedAt: !398)
!400 = !DILocation(line: 388, column: 39, scope: !354)
!401 = !DILocation(line: 393, column: 51, scope: !354)
!402 = !DILocalVariable(name: "count", arg: 2, scope: !403, file: !370, line: 1044, type: !9)
!403 = distinct !DILexicalBlock(scope: !404, file: !370, line: 1044, column: 5)
!404 = distinct !DISubprogram(name: "add<u8>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$3add17hf65f4a10253a7180E", scope: !405, file: !370, line: 1044, type: !406, scopeLine: 1044, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !81, templateParams: !60, retainedNodes: !408)
!405 = !DINamespace(name: "{impl#0}", scope: !373)
!406 = !DISubroutineType(types: !407)
!407 = !{!384, !384, !9}
!408 = !{!409, !402}
!409 = !DILocalVariable(name: "self", arg: 1, scope: !403, file: !370, line: 1044, type: !384)
!410 = !DILocation(line: 1044, column: 35, scope: !403, inlinedAt: !411)
!411 = !DILocation(line: 394, column: 62, scope: !365)
!412 = !DILocation(line: 393, column: 27, scope: !354)
!413 = !DILocation(line: 393, column: 17, scope: !365)
!414 = !DILocalVariable(name: "len", arg: 2, scope: !415, file: !318, line: 861, type: !9)
!415 = distinct !DILexicalBlock(scope: !416, file: !318, line: 861, column: 1)
!416 = distinct !DISubprogram(name: "slice_from_raw_parts_mut<u8>", linkageName: "_ZN4core3ptr24slice_from_raw_parts_mut17hec1b420fff990bbbE", scope: !55, file: !318, line: 861, type: !417, scopeLine: 861, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !81, templateParams: !60, retainedNodes: !419)
!417 = !DISubroutineType(types: !418)
!418 = !{!357, !384, !9}
!419 = !{!420, !414}
!420 = !DILocalVariable(name: "data", arg: 1, scope: !415, file: !318, line: 861, type: !384)
!421 = !DILocation(line: 861, column: 56, scope: !415, inlinedAt: !422)
!422 = !DILocation(line: 394, column: 13, scope: !365)
!423 = !DILocalVariable(name: "metadata", arg: 2, scope: !424, file: !282, line: 130, type: !9)
!424 = distinct !DILexicalBlock(scope: !425, file: !282, line: 128, column: 1)
!425 = distinct !DISubprogram(name: "from_raw_parts_mut<[u8]>", linkageName: "_ZN4core3ptr8metadata18from_raw_parts_mut17h9d83cda9553f34fbE", scope: !284, file: !282, line: 128, type: !426, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !81, templateParams: !60, retainedNodes: !429)
!426 = !DISubroutineType(types: !427)
!427 = !{!357, !428, !9}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!429 = !{!430, !423}
!430 = !DILocalVariable(name: "data_pointer", arg: 1, scope: !424, file: !282, line: 129, type: !428)
!431 = !DILocation(line: 130, column: 5, scope: !424, inlinedAt: !432)
!432 = !DILocation(line: 862, column: 5, scope: !415, inlinedAt: !422)
!433 = !DILocation(line: 2074, column: 9, scope: !380, inlinedAt: !387)
!434 = !DILocation(line: 1044, column: 29, scope: !403, inlinedAt: !411)
!435 = !DILocation(line: 1049, column: 18, scope: !403, inlinedAt: !411)
!436 = !DILocation(line: 861, column: 42, scope: !415, inlinedAt: !422)
!437 = !DILocalVariable(name: "self", arg: 1, scope: !438, file: !370, line: 63, type: !384)
!438 = distinct !DILexicalBlock(scope: !439, file: !370, line: 63, column: 5)
!439 = distinct !DISubprogram(name: "cast<u8, ()>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$4cast17h9dd1d347cd3a4f10E", scope: !405, file: !370, line: 63, type: !440, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !81, templateParams: !345, retainedNodes: !442)
!440 = !DISubroutineType(types: !441)
!441 = !{!428, !384}
!442 = !{!437}
!443 = !DILocation(line: 63, column: 26, scope: !438, inlinedAt: !444)
!444 = !DILocation(line: 862, column: 29, scope: !415, inlinedAt: !422)
!445 = !DILocation(line: 64, column: 9, scope: !438, inlinedAt: !444)
!446 = !DILocation(line: 129, column: 5, scope: !424, inlinedAt: !432)
!447 = !DILocation(line: 135, column: 36, scope: !424, inlinedAt: !432)
!448 = !DILocation(line: 135, column: 14, scope: !424, inlinedAt: !432)
!449 = !DILocation(line: 396, column: 6, scope: !354)
!450 = distinct !DISubprogram(name: "get<u8>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$3get17h6b42bed6da158d5bE", scope: !245, file: !244, line: 349, type: !451, scopeLine: 349, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !81, templateParams: !60, retainedNodes: !471)
!451 = !DISubroutineType(types: !452)
!452 = !{!453, !255, !462}
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[u8]>", scope: !454, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !455, templateParams: !18, identifier: "9d3a9f91fc036c58b88ad4d19fde23e")
!454 = !DINamespace(name: "option", scope: !15)
!455 = !{!456}
!456 = !DICompositeType(tag: DW_TAG_variant_part, scope: !453, file: !2, size: 128, align: 64, elements: !457, templateParams: !18, identifier: "5852abaa943f06795a24cc8ae7af1cad", discriminator: !470)
!457 = !{!458, !466}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !456, file: !2, baseType: !459, size: 128, align: 64, extraData: i128 0)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !453, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !18, templateParams: !460, identifier: "180de805395bccc339d95e7705df1f4d")
!460 = !{!461}
!461 = !DITemplateTypeParameter(name: "T", type: !462)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u8]", file: !2, size: 128, align: 64, elements: !463, templateParams: !18, identifier: "4f7d759e2003ffb713a77bd933fd0146")
!463 = !{!464, !465}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !462, file: !2, baseType: !253, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !462, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !456, file: !2, baseType: !467, size: 128, align: 64)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !453, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !468, templateParams: !460, identifier: "35bbc0179a3ae211304b7e033a0ee8db")
!468 = !{!469}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !467, file: !2, baseType: !462, size: 128, align: 64, flags: DIFlagPublic)
!470 = !DIDerivedType(tag: DW_TAG_member, scope: !453, file: !2, baseType: !36, size: 64, align: 64, flags: DIFlagArtificial)
!471 = !{!472, !473}
!472 = !DILocalVariable(name: "self", arg: 1, scope: !450, file: !244, line: 349, type: !255)
!473 = !DILocalVariable(name: "slice", arg: 2, scope: !450, file: !244, line: 349, type: !462)
!474 = !DILocation(line: 349, column: 12, scope: !450)
!475 = !DILocation(line: 349, column: 18, scope: !450)
!476 = !DILocation(line: 350, column: 12, scope: !450)
!477 = !DILocation(line: 350, column: 37, scope: !450)
!478 = !DILocation(line: 350, column: 60, scope: !450)
!479 = !DILocation(line: 354, column: 29, scope: !450)
!480 = !DILocation(line: 354, column: 22, scope: !450)
!481 = !DILocation(line: 350, column: 9, scope: !450)
!482 = !DILocation(line: 356, column: 6, scope: !450)
!483 = !{i64 1}
!484 = !DILocation(line: 351, column: 13, scope: !450)
!485 = distinct !DISubprogram(name: "index_mut<u8>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17h003299564a7182e5E", scope: !245, file: !244, line: 410, type: !486, scopeLine: 410, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !81, templateParams: !60, retainedNodes: !505)
!486 = !DISubroutineType(types: !487)
!487 = !{!488, !255, !488, !492}
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [u8]", file: !2, size: 128, align: 64, elements: !489, templateParams: !18, identifier: "5acbf15c847666982b641ea58cf98317")
!489 = !{!490, !491}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !488, file: !2, baseType: !253, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !488, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !493, size: 64, align: 64, dwarfAddressSpace: 0)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !494, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !496, templateParams: !18, identifier: "6ab6d19db24f176957abb2edb6f58a8b")
!494 = !DINamespace(name: "location", scope: !495)
!495 = !DINamespace(name: "panic", scope: !15)
!496 = !{!497, !502, !504}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !493, file: !2, baseType: !498, size: 128, align: 64, flags: DIFlagPrivate)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !499, templateParams: !18, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!499 = !{!500, !501}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !498, file: !2, baseType: !253, size: 64, align: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !498, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !493, file: !2, baseType: !503, size: 32, align: 32, offset: 128, flags: DIFlagPrivate)
!503 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !493, file: !2, baseType: !503, size: 32, align: 32, offset: 160, flags: DIFlagPrivate)
!505 = !{!506, !507}
!506 = !DILocalVariable(name: "self", arg: 1, scope: !485, file: !244, line: 410, type: !255)
!507 = !DILocalVariable(name: "slice", arg: 2, scope: !485, file: !244, line: 410, type: !488)
!508 = !DILocation(line: 410, column: 18, scope: !485)
!509 = !DILocation(line: 410, column: 24, scope: !485)
!510 = !DILocation(line: 411, column: 12, scope: !485)
!511 = !DILocation(line: 413, column: 19, scope: !485)
!512 = !DILocation(line: 412, column: 13, scope: !485)
!513 = !DILocation(line: 417, column: 24, scope: !485)
!514 = !DILocation(line: 418, column: 6, scope: !485)
!515 = !DILocation(line: 414, column: 13, scope: !485)
!516 = distinct !DISubprogram(name: "next<core::slice::iter::Iter<semver::Comparator>>", linkageName: "_ZN110_$LT$core..iter..adapters..enumerate..Enumerate$LT$I$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17hed479c6340a80065E", scope: !518, file: !517, line: 46, type: !522, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !81, templateParams: !583, retainedNodes: !585)
!517 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/iter/adapters/enumerate.rs", directory: "", checksumkind: CSK_MD5, checksum: "254bdb66cb6ebf32adae5f675fdd9614")
!518 = !DINamespace(name: "{impl#1}", scope: !519)
!519 = !DINamespace(name: "enumerate", scope: !520)
!520 = !DINamespace(name: "adapters", scope: !521)
!521 = !DINamespace(name: "iter", scope: !15)
!522 = !DISubroutineType(types: !523)
!523 = !{!524, !562}
!524 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<(usize, &semver::Comparator)>", scope: !454, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !525, templateParams: !18, identifier: "80335e0391eb168b2a70410ee69a5e72")
!525 = !{!526}
!526 = !DICompositeType(tag: DW_TAG_variant_part, scope: !524, file: !2, size: 128, align: 64, elements: !527, templateParams: !18, identifier: "bb5d407319f1c7bac63164e9f6054d4", discriminator: !561)
!527 = !{!528, !557}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !526, file: !2, baseType: !529, size: 128, align: 64, extraData: i128 0)
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !524, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !18, templateParams: !530, identifier: "60fe7bfb0c08d7e238f1869a431c0598")
!530 = !{!531}
!531 = !DITemplateTypeParameter(name: "T", type: !532)
!532 = !DICompositeType(tag: DW_TAG_structure_type, name: "(usize, &semver::Comparator)", file: !2, size: 128, align: 64, elements: !533, templateParams: !18, identifier: "27b4919158b45025f903c6cbcf0ce53f")
!533 = !{!534, !535}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !532, file: !2, baseType: !9, size: 64, align: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !532, file: !2, baseType: !536, size: 64, align: 64, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&semver::Comparator", baseType: !537, size: 64, align: 64, dwarfAddressSpace: 0)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "Comparator", scope: !46, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !538, templateParams: !18, identifier: "bbb9d7f7b64e86fee1e8be556c24fbc6")
!538 = !{!539, !540, !541, !555, !556}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !537, file: !2, baseType: !84, size: 8, align: 8, offset: 384, flags: DIFlagPublic)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !537, file: !2, baseType: !36, size: 64, align: 64, offset: 320, flags: DIFlagPublic)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !537, file: !2, baseType: !542, size: 128, align: 64, flags: DIFlagPublic)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u64>", scope: !454, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !543, templateParams: !18, identifier: "fa634b92bb0788406c3558e5683aa673")
!543 = !{!544}
!544 = !DICompositeType(tag: DW_TAG_variant_part, scope: !542, file: !2, size: 128, align: 64, elements: !545, templateParams: !18, identifier: "33b370e0b559aef58e7fad66a328d8bb", discriminator: !554)
!545 = !{!546, !550}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !544, file: !2, baseType: !547, size: 128, align: 64, extraData: i128 0)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !542, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !18, templateParams: !548, identifier: "a43ed43ae37f1c1b8e83ae408eae44d2")
!548 = !{!549}
!549 = !DITemplateTypeParameter(name: "T", type: !36)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !544, file: !2, baseType: !551, size: 128, align: 64, extraData: i128 1)
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !542, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !552, templateParams: !548, identifier: "ecff64396721e05b2b899397223ee42c")
!552 = !{!553}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !551, file: !2, baseType: !36, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!554 = !DIDerivedType(tag: DW_TAG_member, scope: !542, file: !2, baseType: !36, size: 64, align: 64, flags: DIFlagArtificial)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "patch", scope: !537, file: !2, baseType: !542, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "pre", scope: !537, file: !2, baseType: !45, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !526, file: !2, baseType: !558, size: 128, align: 64)
!558 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !524, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !559, templateParams: !530, identifier: "d3aaa9beeb47c05f5d2921c069292df")
!559 = !{!560}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !558, file: !2, baseType: !532, size: 128, align: 64, flags: DIFlagPublic)
!561 = !DIDerivedType(tag: DW_TAG_member, scope: !524, file: !2, baseType: !36, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::enumerate::Enumerate<core::slice::iter::Iter<semver::Comparator>>", baseType: !563, size: 64, align: 64, dwarfAddressSpace: 0)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "Enumerate<core::slice::iter::Iter<semver::Comparator>>", scope: !519, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !564, templateParams: !583, identifier: "49d8b15634fe305ec1bf608383844f20")
!564 = !{!565, !582}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !563, file: !2, baseType: !566, size: 128, align: 64, flags: DIFlagPrivate)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<semver::Comparator>", scope: !567, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !568, templateParams: !574, identifier: "cc9fab96ce84569ac670b593b59c537c")
!567 = !DINamespace(name: "iter", scope: !247)
!568 = !{!569, !576, !577}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !566, file: !2, baseType: !570, size: 64, align: 64, flags: DIFlagPrivate)
!570 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<semver::Comparator>", scope: !54, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !571, templateParams: !574, identifier: "ba9edd8eb76bb5746bc5bf41b52b66ee")
!571 = !{!572}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !570, file: !2, baseType: !573, size: 64, align: 64, flags: DIFlagPrivate)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const semver::Comparator", baseType: !537, size: 64, align: 64, dwarfAddressSpace: 0)
!574 = !{!575}
!575 = !DITemplateTypeParameter(name: "T", type: !537)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "end_or_len", scope: !566, file: !2, baseType: !573, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !566, file: !2, baseType: !578, align: 8, offset: 128, flags: DIFlagPrivate)
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&semver::Comparator>", scope: !579, file: !2, align: 8, flags: DIFlagPublic, elements: !18, templateParams: !580, identifier: "2e8a85ddb5430fb0fd7e5ce073519f65")
!579 = !DINamespace(name: "marker", scope: !15)
!580 = !{!581}
!581 = !DITemplateTypeParameter(name: "T", type: !536)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !563, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!583 = !{!584}
!584 = !DITemplateTypeParameter(name: "I", type: !566)
!585 = !{!586, !587, !589, !603, !605}
!586 = !DILocalVariable(name: "self", arg: 1, scope: !516, file: !517, line: 46, type: !562)
!587 = !DILocalVariable(name: "a", scope: !588, file: !517, line: 47, type: !536, align: 8)
!588 = distinct !DILexicalBlock(scope: !516, file: !517, line: 47, column: 9)
!589 = !DILocalVariable(name: "residual", scope: !590, file: !517, line: 47, type: !591, align: 1)
!590 = distinct !DILexicalBlock(scope: !516, file: !517, line: 47, column: 33)
!591 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::convert::Infallible>", scope: !454, file: !2, align: 8, flags: DIFlagPublic, elements: !592, templateParams: !18, identifier: "85ed36b4594dc27a3c9c28e51a2b403")
!592 = !{!593}
!593 = !DICompositeType(tag: DW_TAG_variant_part, scope: !591, file: !2, align: 8, elements: !594, templateParams: !18, identifier: "e77bfd5d6237cf22dbb8fac8af90b86f")
!594 = !{!595, !599}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !593, file: !2, baseType: !596, align: 8)
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !591, file: !2, align: 8, flags: DIFlagPublic, elements: !18, templateParams: !597, identifier: "43ded5b9f7a80cfe9656c14752e82df6")
!597 = !{!598}
!598 = !DITemplateTypeParameter(name: "T", type: !224)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !593, file: !2, baseType: !600, align: 8)
!600 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !591, file: !2, align: 8, flags: DIFlagPublic, elements: !601, templateParams: !597, identifier: "c60c02c892c6fe5c5ea94a854fef9f6e")
!601 = !{!602}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !600, file: !2, baseType: !224, align: 8, flags: DIFlagPublic)
!603 = !DILocalVariable(name: "val", scope: !604, file: !517, line: 47, type: !536, align: 8)
!604 = distinct !DILexicalBlock(scope: !516, file: !517, line: 47, column: 17)
!605 = !DILocalVariable(name: "i", scope: !606, file: !517, line: 48, type: !9, align: 8)
!606 = distinct !DILexicalBlock(scope: !588, file: !517, line: 48, column: 9)
!607 = !DILocation(line: 47, column: 33, scope: !590)
!608 = !DILocalVariable(name: "residual", scope: !609, file: !610, line: 2496, type: !591, align: 1)
!609 = distinct !DILexicalBlock(scope: !611, file: !610, line: 2496, column: 5)
!610 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/option.rs", directory: "", checksumkind: CSK_MD5, checksum: "290dd9078744531e3e1c26de62cd5c06")
!611 = distinct !DISubprogram(name: "from_residual<(usize, &semver::Comparator)>", linkageName: "_ZN84_$LT$core..option..Option$LT$T$GT$$u20$as$u20$core..ops..try_trait..FromResidual$GT$13from_residual17hd4502b17c456d7ffE", scope: !612, file: !610, line: 2496, type: !613, scopeLine: 2496, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !81, templateParams: !530, retainedNodes: !615)
!612 = !DINamespace(name: "{impl#41}", scope: !454)
!613 = !DISubroutineType(types: !614)
!614 = !{!524, !591}
!615 = !{!608}
!616 = !DILocation(line: 2496, column: 22, scope: !609, inlinedAt: !617)
!617 = !DILocation(line: 47, column: 17, scope: !590)
!618 = !DILocation(line: 46, column: 13, scope: !516)
!619 = !DILocalVariable(name: "self", arg: 1, scope: !620, file: !610, line: 2485, type: !641)
!620 = distinct !DILexicalBlock(scope: !621, file: !610, line: 2485, column: 5)
!621 = distinct !DISubprogram(name: "branch<&semver::Comparator>", linkageName: "_ZN75_$LT$core..option..Option$LT$T$GT$$u20$as$u20$core..ops..try_trait..Try$GT$6branch17hb74c6595366c2312E", scope: !622, file: !610, line: 2485, type: !623, scopeLine: 2485, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !81, templateParams: !580, retainedNodes: !652)
!622 = !DINamespace(name: "{impl#40}", scope: !454)
!623 = !DISubroutineType(types: !624)
!624 = !{!625, !641}
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "ControlFlow<core::option::Option<core::convert::Infallible>, &semver::Comparator>", scope: !196, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !626, templateParams: !18, identifier: "1229ce2d9733e8f787183add761f9bb5")
!626 = !{!627}
!627 = !DICompositeType(tag: DW_TAG_variant_part, scope: !625, file: !2, size: 64, align: 64, elements: !628, templateParams: !18, identifier: "1b94921729b33f98fa39f003408842cf", discriminator: !640)
!628 = !{!629, !636}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "Continue", scope: !627, file: !2, baseType: !630, size: 64, align: 64)
!630 = !DICompositeType(tag: DW_TAG_structure_type, name: "Continue", scope: !625, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !631, templateParams: !633, identifier: "a59bc186aa9e985ddd6534f7ecfe5c64")
!631 = !{!632}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !630, file: !2, baseType: !536, size: 64, align: 64, flags: DIFlagPublic)
!633 = !{!634, !635}
!634 = !DITemplateTypeParameter(name: "B", type: !591)
!635 = !DITemplateTypeParameter(name: "C", type: !536)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "Break", scope: !627, file: !2, baseType: !637, size: 64, align: 64, extraData: i128 0)
!637 = !DICompositeType(tag: DW_TAG_structure_type, name: "Break", scope: !625, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !638, templateParams: !633, identifier: "30766a0595bd995e1fb04014897cdb72")
!638 = !{!639}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !637, file: !2, baseType: !591, align: 8, flags: DIFlagPublic)
!640 = !DIDerivedType(tag: DW_TAG_member, scope: !625, file: !2, baseType: !36, size: 64, align: 64, flags: DIFlagArtificial)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&semver::Comparator>", scope: !454, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !642, templateParams: !18, identifier: "64fec7a5e60c391efcea5e2b505a961")
!642 = !{!643}
!643 = !DICompositeType(tag: DW_TAG_variant_part, scope: !641, file: !2, size: 64, align: 64, elements: !644, templateParams: !18, identifier: "78d6ee8babce11b493843cd8a0b1a4c0", discriminator: !651)
!644 = !{!645, !647}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !643, file: !2, baseType: !646, size: 64, align: 64, extraData: i128 0)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !641, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !18, templateParams: !580, identifier: "cac8c5eb9db565a333a58ad71625be8")
!647 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !643, file: !2, baseType: !648, size: 64, align: 64)
!648 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !641, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !649, templateParams: !580, identifier: "7fa37fc76733b8ef91d0953ae478178")
!649 = !{!650}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !648, file: !2, baseType: !536, size: 64, align: 64, flags: DIFlagPublic)
!651 = !DIDerivedType(tag: DW_TAG_member, scope: !641, file: !2, baseType: !36, size: 64, align: 64, flags: DIFlagArtificial)
!652 = !{!619, !653}
!653 = !DILocalVariable(name: "v", scope: !654, file: !610, line: 2487, type: !536, align: 8)
!654 = distinct !DILexicalBlock(scope: !620, file: !610, line: 2487, column: 13)
!655 = !DILocation(line: 2485, column: 15, scope: !620, inlinedAt: !656)
!656 = !DILocation(line: 47, column: 17, scope: !516)
!657 = !DILocation(line: 2486, column: 15, scope: !620, inlinedAt: !656)
!658 = !DILocation(line: 2486, column: 9, scope: !620, inlinedAt: !656)
!659 = !DILocation(line: 2498, column: 21, scope: !609, inlinedAt: !617)
!660 = !DILocation(line: 51, column: 6, scope: !516)
!661 = !DILocation(line: 2487, column: 18, scope: !620, inlinedAt: !656)
!662 = !{i64 8}
!663 = !DILocation(line: 2487, column: 18, scope: !654, inlinedAt: !656)
!664 = !DILocation(line: 2487, column: 24, scope: !654, inlinedAt: !656)
!665 = !DILocation(line: 47, column: 17, scope: !604)
!666 = !DILocation(line: 47, column: 13, scope: !588)
!667 = !DILocation(line: 48, column: 17, scope: !588)
!668 = !DILocation(line: 48, column: 13, scope: !606)
!669 = !DILocation(line: 49, column: 9, scope: !606)
!670 = !DILocation(line: 50, column: 14, scope: !606)
!671 = !DILocation(line: 50, column: 9, scope: !606)
!672 = !DILocation(line: 46, column: 5, scope: !516)
!673 = distinct !DISubprogram(name: "from_residual<semver::VersionReq, semver::parse::Error, semver::parse::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h0b41f08d0a1b1ba7E", scope: !675, file: !674, line: 1962, type: !677, scopeLine: 1962, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !81, templateParams: !795, retainedNodes: !791)
!674 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/result.rs", directory: "", checksumkind: CSK_MD5, checksum: "96c793a7caa821b2d8ecbbb7303607a6")
!675 = !DINamespace(name: "{impl#27}", scope: !676)
!676 = !DINamespace(name: "result", scope: !15)
!677 = !DISubroutineType(types: !678)
!678 = !{!679, !778, !492}
!679 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<semver::VersionReq, semver::parse::Error>", scope: !676, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !680, templateParams: !18, identifier: "f74e01d8adce13f6f137e7391432b32b")
!680 = !{!681}
!681 = !DICompositeType(tag: DW_TAG_variant_part, scope: !679, file: !2, size: 192, align: 64, elements: !682, templateParams: !18, identifier: "c05a5205c426d86781652604685cd486", discriminator: !777)
!682 = !{!683, !773}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !681, file: !2, baseType: !684, size: 192, align: 64)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !679, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !685, templateParams: !715, identifier: "aea6d140cda8ed81546a5279f1a056c6")
!685 = !{!686}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !684, file: !2, baseType: !687, size: 192, align: 64, flags: DIFlagPublic)
!687 = !DICompositeType(tag: DW_TAG_structure_type, name: "VersionReq", scope: !46, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !688, templateParams: !18, identifier: "7fc84f2fbaa2aea7cb8889e03515b539")
!688 = !{!689}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "comparators", scope: !687, file: !2, baseType: !690, size: 192, align: 64, flags: DIFlagPublic)
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<semver::Comparator, alloc::alloc::Global>", scope: !691, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !693, templateParams: !712, identifier: "8dce85d42c02abf3d6f96c41e9e80c82")
!691 = !DINamespace(name: "vec", scope: !692)
!692 = !DINamespace(name: "alloc", scope: null)
!693 = !{!694, !714}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !690, file: !2, baseType: !695, size: 128, align: 64, flags: DIFlagPrivate)
!695 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<semver::Comparator, alloc::alloc::Global>", scope: !696, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !697, templateParams: !712, identifier: "8cd61e3477d666791aade357125170cb")
!696 = !DINamespace(name: "raw_vec", scope: !692)
!697 = !{!698, !705, !709}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !695, file: !2, baseType: !699, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!699 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<semver::Comparator>", scope: !700, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !701, templateParams: !574, identifier: "bd2700555127de71752a6acbf170bc81")
!700 = !DINamespace(name: "unique", scope: !55)
!701 = !{!702, !703}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !699, file: !2, baseType: !570, size: 64, align: 64, flags: DIFlagPrivate)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !699, file: !2, baseType: !704, align: 8, offset: 64, flags: DIFlagPrivate)
!704 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<semver::Comparator>", scope: !579, file: !2, align: 8, flags: DIFlagPublic, elements: !18, templateParams: !574, identifier: "5b831335081b1c3dffe12699025f7b3e")
!705 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !695, file: !2, baseType: !706, size: 64, align: 64, flags: DIFlagPrivate)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cap", scope: !696, file: !2, size: 64, align: 64, flags: DIFlagPrivate, elements: !707, templateParams: !18, identifier: "f6e0172a239b20d5c4e40f5321e726d6")
!707 = !{!708}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !706, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !695, file: !2, baseType: !710, align: 8, offset: 128, flags: DIFlagPrivate)
!710 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !711, file: !2, align: 8, flags: DIFlagPublic, elements: !18, identifier: "565e9af856f873ca6c6565cfe9042298")
!711 = !DINamespace(name: "alloc", scope: !692)
!712 = !{!575, !713}
!713 = !DITemplateTypeParameter(name: "A", type: !710)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !690, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!715 = !{!716, !717}
!716 = !DITemplateTypeParameter(name: "T", type: !687)
!717 = !DITemplateTypeParameter(name: "E", type: !718)
!718 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !719, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !720, templateParams: !18, identifier: "948ad8b75a9516e6cf67e99eb62a2530")
!719 = !DINamespace(name: "parse", scope: !46)
!720 = !{!721}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !718, file: !2, baseType: !722, size: 64, align: 32, flags: DIFlagProtected)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "ErrorKind", scope: !95, file: !2, size: 64, align: 32, flags: DIFlagProtected, elements: !723, templateParams: !18, identifier: "b4f3806ad70b3a4cd9d0c53c992ca1a8")
!723 = !{!724}
!724 = !DICompositeType(tag: DW_TAG_variant_part, scope: !722, file: !2, size: 64, align: 32, elements: !725, templateParams: !18, identifier: "8922aa3a40b58e04d69a8fd9b7262a0", discriminator: !772)
!725 = !{!726, !728, !732, !738, !743, !748, !752, !756, !760, !764, !768, !770}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "Empty", scope: !724, file: !2, baseType: !727, size: 64, align: 32, extraData: i128 0)
!727 = !DICompositeType(tag: DW_TAG_structure_type, name: "Empty", scope: !722, file: !2, size: 64, align: 32, flags: DIFlagProtected, elements: !18, identifier: "e89bb29da2b86231a23cb8337c205ea5")
!728 = !DIDerivedType(tag: DW_TAG_member, name: "UnexpectedEnd", scope: !724, file: !2, baseType: !729, size: 64, align: 32, extraData: i128 1)
!729 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnexpectedEnd", scope: !722, file: !2, size: 64, align: 32, flags: DIFlagProtected, elements: !730, templateParams: !18, identifier: "bea429fb73a23fd5982d49464bfc3983")
!730 = !{!731}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !729, file: !2, baseType: !94, size: 8, align: 8, offset: 8, flags: DIFlagProtected)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "UnexpectedChar", scope: !724, file: !2, baseType: !733, size: 64, align: 32, extraData: i128 2)
!733 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnexpectedChar", scope: !722, file: !2, size: 64, align: 32, flags: DIFlagProtected, elements: !734, templateParams: !18, identifier: "d8b6edd132e18e5a503f46aec8604bc2")
!734 = !{!735, !736}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !733, file: !2, baseType: !94, size: 8, align: 8, offset: 8, flags: DIFlagProtected)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !733, file: !2, baseType: !737, size: 32, align: 32, offset: 32, flags: DIFlagProtected)
!737 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "UnexpectedCharAfter", scope: !724, file: !2, baseType: !739, size: 64, align: 32, extraData: i128 3)
!739 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnexpectedCharAfter", scope: !722, file: !2, size: 64, align: 32, flags: DIFlagProtected, elements: !740, templateParams: !18, identifier: "d2ca3a28588aa645c27568018405c8a")
!740 = !{!741, !742}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !739, file: !2, baseType: !94, size: 8, align: 8, offset: 8, flags: DIFlagProtected)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !739, file: !2, baseType: !737, size: 32, align: 32, offset: 32, flags: DIFlagProtected)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedCommaFound", scope: !724, file: !2, baseType: !744, size: 64, align: 32, extraData: i128 4)
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExpectedCommaFound", scope: !722, file: !2, size: 64, align: 32, flags: DIFlagProtected, elements: !745, templateParams: !18, identifier: "b4ca57cee0e22553ddea6ac1ddcc5f13")
!745 = !{!746, !747}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !744, file: !2, baseType: !94, size: 8, align: 8, offset: 8, flags: DIFlagProtected)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !744, file: !2, baseType: !737, size: 32, align: 32, offset: 32, flags: DIFlagProtected)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "LeadingZero", scope: !724, file: !2, baseType: !749, size: 64, align: 32, extraData: i128 5)
!749 = !DICompositeType(tag: DW_TAG_structure_type, name: "LeadingZero", scope: !722, file: !2, size: 64, align: 32, flags: DIFlagProtected, elements: !750, templateParams: !18, identifier: "df80c5612505e764598a4c0e3558c02")
!750 = !{!751}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !749, file: !2, baseType: !94, size: 8, align: 8, offset: 8, flags: DIFlagProtected)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "Overflow", scope: !724, file: !2, baseType: !753, size: 64, align: 32, extraData: i128 6)
!753 = !DICompositeType(tag: DW_TAG_structure_type, name: "Overflow", scope: !722, file: !2, size: 64, align: 32, flags: DIFlagProtected, elements: !754, templateParams: !18, identifier: "d43b2d661583fe52fe66b4b09761273e")
!754 = !{!755}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !753, file: !2, baseType: !94, size: 8, align: 8, offset: 8, flags: DIFlagProtected)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "EmptySegment", scope: !724, file: !2, baseType: !757, size: 64, align: 32, extraData: i128 7)
!757 = !DICompositeType(tag: DW_TAG_structure_type, name: "EmptySegment", scope: !722, file: !2, size: 64, align: 32, flags: DIFlagProtected, elements: !758, templateParams: !18, identifier: "34646f04b772f9d55bbee066ab1e8d9d")
!758 = !{!759}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !757, file: !2, baseType: !94, size: 8, align: 8, offset: 8, flags: DIFlagProtected)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "IllegalCharacter", scope: !724, file: !2, baseType: !761, size: 64, align: 32, extraData: i128 8)
!761 = !DICompositeType(tag: DW_TAG_structure_type, name: "IllegalCharacter", scope: !722, file: !2, size: 64, align: 32, flags: DIFlagProtected, elements: !762, templateParams: !18, identifier: "977172a4b1c966741019aecaacb673d7")
!762 = !{!763}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !761, file: !2, baseType: !94, size: 8, align: 8, offset: 8, flags: DIFlagProtected)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "WildcardNotTheOnlyComparator", scope: !724, file: !2, baseType: !765, size: 64, align: 32, extraData: i128 9)
!765 = !DICompositeType(tag: DW_TAG_structure_type, name: "WildcardNotTheOnlyComparator", scope: !722, file: !2, size: 64, align: 32, flags: DIFlagProtected, elements: !766, templateParams: !18, identifier: "e8da3a291224a51ea810c0dc637deae9")
!766 = !{!767}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !765, file: !2, baseType: !737, size: 32, align: 32, offset: 32, flags: DIFlagProtected)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "UnexpectedAfterWildcard", scope: !724, file: !2, baseType: !769, size: 64, align: 32, extraData: i128 10)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnexpectedAfterWildcard", scope: !722, file: !2, size: 64, align: 32, flags: DIFlagProtected, elements: !18, identifier: "a229c21be2950410e402ba95d4f34f7f")
!770 = !DIDerivedType(tag: DW_TAG_member, name: "ExcessiveComparators", scope: !724, file: !2, baseType: !771, size: 64, align: 32, extraData: i128 11)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExcessiveComparators", scope: !722, file: !2, size: 64, align: 32, flags: DIFlagProtected, elements: !18, identifier: "c0d24b797ee6280ae9e152807d8f73cc")
!772 = !DIDerivedType(tag: DW_TAG_member, scope: !722, file: !2, baseType: !59, size: 8, align: 8, flags: DIFlagArtificial)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !681, file: !2, baseType: !774, size: 192, align: 64, extraData: i128 9223372036854775808)
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !679, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !775, templateParams: !715, identifier: "93bace3efc5ad4fbe6550f896a25de9")
!775 = !{!776}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !774, file: !2, baseType: !718, size: 64, align: 32, offset: 64, flags: DIFlagPublic)
!777 = !DIDerivedType(tag: DW_TAG_member, scope: !679, file: !2, baseType: !36, size: 64, align: 64, flags: DIFlagArtificial)
!778 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<core::convert::Infallible, semver::parse::Error>", scope: !676, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !779, templateParams: !18, identifier: "db2d3bca67058b47ad59be9ba0d105ac")
!779 = !{!780}
!780 = !DICompositeType(tag: DW_TAG_variant_part, scope: !778, file: !2, size: 64, align: 32, elements: !781, templateParams: !18, identifier: "ff96b39443c51df977f9bf2120631c15")
!781 = !{!782, !787}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !780, file: !2, baseType: !783, size: 64, align: 32)
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !778, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !784, templateParams: !786, identifier: "cf759a6bb350a64c987ad3d0ff2efec1")
!784 = !{!785}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !783, file: !2, baseType: !224, align: 8, flags: DIFlagPublic)
!786 = !{!598, !717}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !780, file: !2, baseType: !788, size: 64, align: 32)
!788 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !778, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !789, templateParams: !786, identifier: "8c9748e97799b494c7f1bd15b4959fc")
!789 = !{!790}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !788, file: !2, baseType: !718, size: 64, align: 32, flags: DIFlagPublic)
!791 = !{!792, !793}
!792 = !DILocalVariable(name: "residual", arg: 1, scope: !673, file: !674, line: 1962, type: !778)
!793 = !DILocalVariable(name: "e", scope: !794, file: !674, line: 1964, type: !718, align: 4)
!794 = distinct !DILexicalBlock(scope: !673, file: !674, line: 1964, column: 13)
!795 = !{!716, !717, !796}
!796 = !DITemplateTypeParameter(name: "F", type: !718)
!797 = !DILocation(line: 1962, column: 22, scope: !673)
!798 = !DILocation(line: 1964, column: 17, scope: !794)
!799 = !DILocation(line: 1964, column: 17, scope: !673)
!800 = !DILocation(line: 1964, column: 27, scope: !794)
!801 = !DILocalVariable(name: "t", arg: 1, scope: !802, file: !803, line: 768, type: !718)
!802 = distinct !DISubprogram(name: "from<semver::parse::Error>", linkageName: "_ZN50_$LT$T$u20$as$u20$core..convert..From$LT$T$GT$$GT$4from17h945a32bee9037391E", scope: !804, file: !803, line: 768, type: !805, scopeLine: 768, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !81, templateParams: !808, retainedNodes: !807)
!803 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/convert/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "c9b89024c4b3608225f6d01d745ad8ef")
!804 = !DINamespace(name: "{impl#4}", scope: !225)
!805 = !DISubroutineType(types: !806)
!806 = !{!718, !718}
!807 = !{!801}
!808 = !{!809}
!809 = !DITemplateTypeParameter(name: "T", type: !718)
!810 = !DILocation(line: 768, column: 13, scope: !802, inlinedAt: !811)
!811 = distinct !DILocation(line: 1964, column: 27, scope: !794)
!812 = !DILocation(line: 769, column: 9, scope: !802, inlinedAt: !811)
!813 = !DILocation(line: 770, column: 6, scope: !802, inlinedAt: !811)
!814 = !DILocation(line: 1964, column: 23, scope: !794)
!815 = !DILocation(line: 1966, column: 6, scope: !673)
!816 = distinct !DISubprogram(name: "from_residual<semver::Prerelease, semver::parse::Error, semver::parse::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h20a778e6e06f7e46E", scope: !675, file: !674, line: 1962, type: !817, scopeLine: 1962, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !81, templateParams: !838, retainedNodes: !834)
!817 = !DISubroutineType(types: !818)
!818 = !{!819, !778, !492}
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<semver::Prerelease, semver::parse::Error>", scope: !676, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !820, templateParams: !18, identifier: "e4a68431c87f8fae150eaf886f8e524b")
!820 = !{!821}
!821 = !DICompositeType(tag: DW_TAG_variant_part, scope: !819, file: !2, size: 128, align: 64, elements: !822, templateParams: !18, identifier: "57b2a1da71d66f16535fa4e3e79da065", discriminator: !833)
!822 = !{!823, !829}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !821, file: !2, baseType: !824, size: 128, align: 64, extraData: i128 0)
!824 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !819, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !825, templateParams: !827, identifier: "ee9421ef57df1c4fb05be9d2bb884b9c")
!825 = !{!826}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !824, file: !2, baseType: !45, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!827 = !{!828, !717}
!828 = !DITemplateTypeParameter(name: "T", type: !45)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !821, file: !2, baseType: !830, size: 128, align: 64, extraData: i128 1)
!830 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !819, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !831, templateParams: !827, identifier: "7c598ad9187fec37fa21adba53a5cfce")
!831 = !{!832}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !830, file: !2, baseType: !718, size: 64, align: 32, offset: 32, flags: DIFlagPublic)
!833 = !DIDerivedType(tag: DW_TAG_member, scope: !819, file: !2, baseType: !503, size: 32, align: 32, flags: DIFlagArtificial)
!834 = !{!835, !836}
!835 = !DILocalVariable(name: "residual", arg: 1, scope: !816, file: !674, line: 1962, type: !778)
!836 = !DILocalVariable(name: "e", scope: !837, file: !674, line: 1964, type: !718, align: 4)
!837 = distinct !DILexicalBlock(scope: !816, file: !674, line: 1964, column: 13)
!838 = !{!828, !717, !796}
!839 = !DILocation(line: 1962, column: 22, scope: !816)
!840 = !DILocation(line: 1964, column: 17, scope: !837)
!841 = !DILocation(line: 1964, column: 17, scope: !816)
!842 = !DILocation(line: 1964, column: 27, scope: !837)
!843 = !DILocation(line: 768, column: 13, scope: !802, inlinedAt: !844)
!844 = distinct !DILocation(line: 1964, column: 27, scope: !837)
!845 = !DILocation(line: 769, column: 9, scope: !802, inlinedAt: !844)
!846 = !DILocation(line: 770, column: 6, scope: !802, inlinedAt: !844)
!847 = !DILocation(line: 1964, column: 23, scope: !837)
!848 = !DILocation(line: 1966, column: 6, scope: !816)
!849 = distinct !DISubprogram(name: "from_residual<(semver::Prerelease, &str), semver::parse::Error, semver::parse::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h38fd6b891fe248a9E", scope: !675, file: !674, line: 1962, type: !850, scopeLine: 1962, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !81, templateParams: !875, retainedNodes: !871)
!850 = !DISubroutineType(types: !851)
!851 = !{!852, !778, !492}
!852 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(semver::Prerelease, &str), semver::parse::Error>", scope: !676, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !853, templateParams: !18, identifier: "49253859e505e2885a1dbede4f96aac9")
!853 = !{!854}
!854 = !DICompositeType(tag: DW_TAG_variant_part, scope: !852, file: !2, size: 192, align: 64, elements: !855, templateParams: !18, identifier: "24896ac904c6de1ee2a35b121bd06269", discriminator: !870)
!855 = !{!856, !866}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !854, file: !2, baseType: !857, size: 192, align: 64)
!857 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !852, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !858, templateParams: !864, identifier: "1c45de1f6b5e96dd1f2f75030af9d75a")
!858 = !{!859}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !857, file: !2, baseType: !860, size: 192, align: 64, flags: DIFlagPublic)
!860 = !DICompositeType(tag: DW_TAG_structure_type, name: "(semver::Prerelease, &str)", file: !2, size: 192, align: 64, elements: !861, templateParams: !18, identifier: "92f96c1463d5d02d5daed63805fcfcc1")
!861 = !{!862, !863}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !860, file: !2, baseType: !45, size: 64, align: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !860, file: !2, baseType: !498, size: 128, align: 64, offset: 64)
!864 = !{!865, !717}
!865 = !DITemplateTypeParameter(name: "T", type: !860)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !854, file: !2, baseType: !867, size: 192, align: 64, extraData: i128 0)
!867 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !852, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !868, templateParams: !864, identifier: "c4ed0d27ac0b1b82309888aca9ec75a")
!868 = !{!869}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !867, file: !2, baseType: !718, size: 64, align: 32, offset: 64, flags: DIFlagPublic)
!870 = !DIDerivedType(tag: DW_TAG_member, scope: !852, file: !2, baseType: !36, size: 64, align: 64, flags: DIFlagArtificial)
!871 = !{!872, !873}
!872 = !DILocalVariable(name: "residual", arg: 1, scope: !849, file: !674, line: 1962, type: !778)
!873 = !DILocalVariable(name: "e", scope: !874, file: !674, line: 1964, type: !718, align: 4)
!874 = distinct !DILexicalBlock(scope: !849, file: !674, line: 1964, column: 13)
!875 = !{!865, !717, !796}
!876 = !DILocation(line: 1962, column: 22, scope: !849)
!877 = !DILocation(line: 1964, column: 17, scope: !874)
!878 = !DILocation(line: 1964, column: 17, scope: !849)
!879 = !DILocation(line: 1964, column: 27, scope: !874)
!880 = !DILocation(line: 768, column: 13, scope: !802, inlinedAt: !881)
!881 = distinct !DILocation(line: 1964, column: 27, scope: !874)
!882 = !DILocation(line: 769, column: 9, scope: !802, inlinedAt: !881)
!883 = !DILocation(line: 770, column: 6, scope: !802, inlinedAt: !881)
!884 = !DILocation(line: 1964, column: 23, scope: !874)
!885 = !DILocation(line: 1966, column: 6, scope: !849)
!886 = distinct !DISubprogram(name: "from_residual<usize, semver::parse::Error, semver::parse::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h409a6b1c678c01a2E", scope: !675, file: !674, line: 1962, type: !887, scopeLine: 1962, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !81, templateParams: !908, retainedNodes: !904)
!887 = !DISubroutineType(types: !888)
!888 = !{!889, !778, !492}
!889 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<usize, semver::parse::Error>", scope: !676, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !890, templateParams: !18, identifier: "b7d0e70c2e7b938a308b4a02eaeae518")
!890 = !{!891}
!891 = !DICompositeType(tag: DW_TAG_variant_part, scope: !889, file: !2, size: 128, align: 64, elements: !892, templateParams: !18, identifier: "f1d3883bd884fa2332ea173e8f1d95f2", discriminator: !903)
!892 = !{!893, !899}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !891, file: !2, baseType: !894, size: 128, align: 64, extraData: i128 0)
!894 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !889, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !895, templateParams: !897, identifier: "e1fcaebcb7a760d772b159ba4e6a075")
!895 = !{!896}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !894, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!897 = !{!898, !717}
!898 = !DITemplateTypeParameter(name: "T", type: !9)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !891, file: !2, baseType: !900, size: 128, align: 64, extraData: i128 1)
!900 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !889, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !901, templateParams: !897, identifier: "770668b60fff09ed6e5e785dce44a4be")
!901 = !{!902}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !900, file: !2, baseType: !718, size: 64, align: 32, offset: 32, flags: DIFlagPublic)
!903 = !DIDerivedType(tag: DW_TAG_member, scope: !889, file: !2, baseType: !503, size: 32, align: 32, flags: DIFlagArtificial)
!904 = !{!905, !906}
!905 = !DILocalVariable(name: "residual", arg: 1, scope: !886, file: !674, line: 1962, type: !778)
!906 = !DILocalVariable(name: "e", scope: !907, file: !674, line: 1964, type: !718, align: 4)
!907 = distinct !DILexicalBlock(scope: !886, file: !674, line: 1964, column: 13)
!908 = !{!898, !717, !796}
!909 = !DILocation(line: 1962, column: 22, scope: !886)
!910 = !DILocation(line: 1964, column: 17, scope: !907)
!911 = !DILocation(line: 1964, column: 17, scope: !886)
!912 = !DILocation(line: 1964, column: 27, scope: !907)
!913 = !DILocation(line: 768, column: 13, scope: !802, inlinedAt: !914)
!914 = distinct !DILocation(line: 1964, column: 27, scope: !907)
!915 = !DILocation(line: 769, column: 9, scope: !802, inlinedAt: !914)
!916 = !DILocation(line: 770, column: 6, scope: !802, inlinedAt: !914)
!917 = !DILocation(line: 1964, column: 23, scope: !907)
!918 = !DILocation(line: 1966, column: 6, scope: !886)
!919 = distinct !DISubprogram(name: "from_residual<(semver::BuildMetadata, &str), semver::parse::Error, semver::parse::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h42874ce18665fb9eE", scope: !675, file: !674, line: 1962, type: !920, scopeLine: 1962, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !81, templateParams: !945, retainedNodes: !941)
!920 = !DISubroutineType(types: !921)
!921 = !{!922, !778, !492}
!922 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(semver::BuildMetadata, &str), semver::parse::Error>", scope: !676, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !923, templateParams: !18, identifier: "f6254fe25bcd9ee0c6e5f982c91d128")
!923 = !{!924}
!924 = !DICompositeType(tag: DW_TAG_variant_part, scope: !922, file: !2, size: 192, align: 64, elements: !925, templateParams: !18, identifier: "e4e51d789a186ee843b393aa30b14000", discriminator: !940)
!925 = !{!926, !936}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !924, file: !2, baseType: !927, size: 192, align: 64)
!927 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !922, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !928, templateParams: !934, identifier: "370c66b8fe5f732d82d1f7bdbb147a39")
!928 = !{!929}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !927, file: !2, baseType: !930, size: 192, align: 64, flags: DIFlagPublic)
!930 = !DICompositeType(tag: DW_TAG_structure_type, name: "(semver::BuildMetadata, &str)", file: !2, size: 192, align: 64, elements: !931, templateParams: !18, identifier: "b2da2c8250e615138930690857ffd365")
!931 = !{!932, !933}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !930, file: !2, baseType: !74, size: 64, align: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !930, file: !2, baseType: !498, size: 128, align: 64, offset: 64)
!934 = !{!935, !717}
!935 = !DITemplateTypeParameter(name: "T", type: !930)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !924, file: !2, baseType: !937, size: 192, align: 64, extraData: i128 0)
!937 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !922, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !938, templateParams: !934, identifier: "24fcd7332ab0b6aab4dcff2da46f258")
!938 = !{!939}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !937, file: !2, baseType: !718, size: 64, align: 32, offset: 64, flags: DIFlagPublic)
!940 = !DIDerivedType(tag: DW_TAG_member, scope: !922, file: !2, baseType: !36, size: 64, align: 64, flags: DIFlagArtificial)
!941 = !{!942, !943}
!942 = !DILocalVariable(name: "residual", arg: 1, scope: !919, file: !674, line: 1962, type: !778)
!943 = !DILocalVariable(name: "e", scope: !944, file: !674, line: 1964, type: !718, align: 4)
!944 = distinct !DILexicalBlock(scope: !919, file: !674, line: 1964, column: 13)
!945 = !{!935, !717, !796}
!946 = !DILocation(line: 1962, column: 22, scope: !919)
!947 = !DILocation(line: 1964, column: 17, scope: !944)
!948 = !DILocation(line: 1964, column: 17, scope: !919)
!949 = !DILocation(line: 1964, column: 27, scope: !944)
!950 = !DILocation(line: 768, column: 13, scope: !802, inlinedAt: !951)
!951 = distinct !DILocation(line: 1964, column: 27, scope: !944)
!952 = !DILocation(line: 769, column: 9, scope: !802, inlinedAt: !951)
!953 = !DILocation(line: 770, column: 6, scope: !802, inlinedAt: !951)
!954 = !DILocation(line: 1964, column: 23, scope: !944)
!955 = !DILocation(line: 1966, column: 6, scope: !919)
!956 = distinct !DISubprogram(name: "from_residual<(semver::Comparator, semver::error::Position, &str), semver::parse::Error, semver::parse::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h68380937ac565086E", scope: !675, file: !674, line: 1962, type: !957, scopeLine: 1962, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !81, templateParams: !983, retainedNodes: !979)
!957 = !DISubroutineType(types: !958)
!958 = !{!959, !778, !492}
!959 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(semver::Comparator, semver::error::Position, &str), semver::parse::Error>", scope: !676, file: !2, size: 640, align: 64, flags: DIFlagPublic, elements: !960, templateParams: !18, identifier: "ce574ea27b808f37913c2a94800e8ab0")
!960 = !{!961}
!961 = !DICompositeType(tag: DW_TAG_variant_part, scope: !959, file: !2, size: 640, align: 64, elements: !962, templateParams: !18, identifier: "77e0cb288fd559fee790941e7376d8ec", discriminator: !978)
!962 = !{!963, !974}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !961, file: !2, baseType: !964, size: 640, align: 64)
!964 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !959, file: !2, size: 640, align: 64, flags: DIFlagPublic, elements: !965, templateParams: !972, identifier: "8f0b1fd8ce15c8a05fc36e6eccb78691")
!965 = !{!966}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !964, file: !2, baseType: !967, size: 640, align: 64, flags: DIFlagPublic)
!967 = !DICompositeType(tag: DW_TAG_structure_type, name: "(semver::Comparator, semver::error::Position, &str)", file: !2, size: 640, align: 64, elements: !968, templateParams: !18, identifier: "62abf8fbdb0d4c5638b17376bf02d6b")
!968 = !{!969, !970, !971}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !967, file: !2, baseType: !537, size: 448, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !967, file: !2, baseType: !94, size: 8, align: 8, offset: 448)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "__2", scope: !967, file: !2, baseType: !498, size: 128, align: 64, offset: 512)
!972 = !{!973, !717}
!973 = !DITemplateTypeParameter(name: "T", type: !967)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !961, file: !2, baseType: !975, size: 640, align: 64, extraData: i128 2)
!975 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !959, file: !2, size: 640, align: 64, flags: DIFlagPublic, elements: !976, templateParams: !972, identifier: "5bfcff580cbb83c0ecbbd8de2b2daf75")
!976 = !{!977}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !975, file: !2, baseType: !718, size: 64, align: 32, offset: 64, flags: DIFlagPublic)
!978 = !DIDerivedType(tag: DW_TAG_member, scope: !959, file: !2, baseType: !36, size: 64, align: 64, flags: DIFlagArtificial)
!979 = !{!980, !981}
!980 = !DILocalVariable(name: "residual", arg: 1, scope: !956, file: !674, line: 1962, type: !778)
!981 = !DILocalVariable(name: "e", scope: !982, file: !674, line: 1964, type: !718, align: 4)
!982 = distinct !DILexicalBlock(scope: !956, file: !674, line: 1964, column: 13)
!983 = !{!973, !717, !796}
!984 = !DILocation(line: 1962, column: 22, scope: !956)
!985 = !DILocation(line: 1964, column: 17, scope: !982)
!986 = !DILocation(line: 1964, column: 17, scope: !956)
!987 = !DILocation(line: 1964, column: 27, scope: !982)
!988 = !DILocation(line: 768, column: 13, scope: !802, inlinedAt: !989)
!989 = distinct !DILocation(line: 1964, column: 27, scope: !982)
!990 = !DILocation(line: 769, column: 9, scope: !802, inlinedAt: !989)
!991 = !DILocation(line: 770, column: 6, scope: !802, inlinedAt: !989)
!992 = !DILocation(line: 1964, column: 23, scope: !982)
!993 = !DILocation(line: 1966, column: 6, scope: !956)
