; ModuleID = '3jzm83e5om7wxoli'
source_filename = "3jzm83e5om7wxoli"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128"
target triple = "arm64-apple-macosx11.0.0"

%"core::option::Option<&str>" = type { ptr, [1 x i64] }
%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, %"core::option::Option<&[core::fmt::rt::Placeholder]>" }
%"core::option::Option<&[core::fmt::rt::Placeholder]>" = type { ptr, [1 x i64] }
%"core::fmt::rt::Argument<'_>" = type { ptr, ptr }

@alloc_2a62ba4d4fa46537b277796d74f8c568 = private unnamed_addr constant <{}> zeroinitializer, align 8
@0 = private unnamed_addr constant <{ [8 x i8], [8 x i8] }> <{ [8 x i8] zeroinitializer, [8 x i8] undef }>, align 8
@alloc_91c7fa63c3cfeaa3c795652d5cf060e4 = private unnamed_addr constant <{ [12 x i8] }> <{ [12 x i8] c"invalid args" }>, align 1
@alloc_af99043bc04c419363a7f04d23183506 = private unnamed_addr constant <{ ptr, [8 x i8] }> <{ ptr @alloc_91c7fa63c3cfeaa3c795652d5cf060e4, [8 x i8] c"\0C\00\00\00\00\00\00\00" }>, align 8
@alloc_b471600b253f24fcc8f91ba747bf2f04 = private unnamed_addr constant <{ [75 x i8] }> <{ [75 x i8] c"/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/fmt/mod.rs" }>, align 1
@alloc_4ba2c5ddff77a51f3765b0dd5f2851cc = private unnamed_addr constant <{ ptr, [16 x i8] }> <{ ptr @alloc_b471600b253f24fcc8f91ba747bf2f04, [16 x i8] c"K\00\00\00\00\00\00\00U\01\00\00\0D\00\00\00" }>, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<usize as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<usize as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !9, templateParams: !12, identifier: "9e427bca19119b32a78dec258f75463b")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !{}
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(name: "<&core::ptr::alignment::Alignment as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !15, isLocal: true, isDefinition: true)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&core::ptr::alignment::Alignment as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !16, vtableHolder: !21, templateParams: !12, identifier: "e6b70adc966de59d7315ce937f769437")
!16 = !{!17, !18, !19, !20}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !15, file: !2, baseType: !6, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !15, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !15, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !15, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::ptr::alignment::Alignment", baseType: !22, size: 64, align: 64, dwarfAddressSpace: 0)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "Alignment", scope: !23, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !26, templateParams: !12, identifier: "cd4e14505960f0a037f01b07ff4485e4")
!23 = !DINamespace(name: "alignment", scope: !24)
!24 = !DINamespace(name: "ptr", scope: !25)
!25 = !DINamespace(name: "core", scope: null)
!26 = !{!27}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !22, file: !2, baseType: !28, size: 64, align: 64, flags: DIFlagPrivate)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AlignmentEnum", scope: !23, file: !2, baseType: !29, size: 64, align: 64, flags: DIFlagEnumClass, elements: !30)
!29 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!30 = !{!31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94}
!31 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!32 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!33 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!34 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!35 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!36 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!37 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!38 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!39 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!40 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!41 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!42 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!43 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!44 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!45 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!46 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!47 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!48 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!49 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!50 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!51 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!52 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!53 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!54 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!55 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!56 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!57 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!58 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!59 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!60 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!61 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!62 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!63 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!64 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!65 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!66 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!67 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!68 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!69 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!70 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!71 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!72 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!73 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!74 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!75 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!76 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!77 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!78 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!79 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!80 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!81 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!82 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!83 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!84 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!85 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!86 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!87 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!88 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!89 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!90 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!91 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!92 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!93 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!94 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "<&core::alloc::layout::Layout as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !97, isLocal: true, isDefinition: true)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&core::alloc::layout::Layout as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !98, vtableHolder: !103, templateParams: !12, identifier: "3a19b8b58e70481c7eb8736b5d05b0d7")
!98 = !{!99, !100, !101, !102}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !97, file: !2, baseType: !6, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !97, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !97, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !97, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::alloc::layout::Layout", baseType: !104, size: 64, align: 64, dwarfAddressSpace: 0)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "Layout", scope: !105, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !107, templateParams: !12, identifier: "1513b92980cbbf0c9c55763558fc9faf")
!105 = !DINamespace(name: "layout", scope: !106)
!106 = !DINamespace(name: "alloc", scope: !25)
!107 = !{!108, !109}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !104, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !104, file: !2, baseType: !22, size: 64, align: 64, flags: DIFlagPrivate)
!110 = !{i32 8, !"PIC Level", i32 2}
!111 = !{i32 2, !"Dwarf Version", i32 4}
!112 = !{i32 2, !"Debug Info Version", i32 3}
!113 = !{!"rustc version 1.78.0-nightly (46b180ec2 2024-03-08)"}
!114 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !115, producer: "clang LLVM (rustc version 1.78.0-nightly (46b180ec2 2024-03-08))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !116, globals: !126, splitDebugInlining: false, nameTableKind: None)
!115 = !DIFile(filename: "src/lib.rs/@/3jzm83e5om7wxoli", directory: "/private/var/folders/m6/nyw0tbd5239gngtm06pzykr00000gn/T/.tmpPXbnuW/smallvec")
!116 = !{!28, !117}
!117 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !118, file: !2, baseType: !120, size: 8, align: 8, flags: DIFlagEnumClass, elements: !121)
!118 = !DINamespace(name: "rt", scope: !119)
!119 = !DINamespace(name: "fmt", scope: !25)
!120 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!121 = !{!122, !123, !124, !125}
!122 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!123 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!124 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!125 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!126 = !{!0, !13, !95}
!127 = distinct !DISubprogram(name: "fmt<core::ptr::alignment::Alignment>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h33a086f8bead6f44E", scope: !129, file: !128, line: 2333, type: !130, scopeLine: 2333, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !114, templateParams: !189, retainedNodes: !186)
!128 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "fb126a293888f279de993e69d2771a11")
!129 = !DINamespace(name: "{impl#51}", scope: !119)
!130 = !DISubroutineType(types: !131)
!131 = !{!132, !150, !151}
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !133, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !134, templateParams: !12, identifier: "be175170a3647a571f2129780e96e9a")
!133 = !DINamespace(name: "result", scope: !25)
!134 = !{!135}
!135 = !DICompositeType(tag: DW_TAG_variant_part, scope: !132, file: !2, size: 8, align: 8, elements: !136, templateParams: !12, identifier: "d84fc986954f0a57cdd867f92114d31f", discriminator: !149)
!136 = !{!137, !145}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !135, file: !2, baseType: !138, size: 8, align: 8, extraData: i128 0)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !132, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !139, templateParams: !141, identifier: "8a3a859dd63bba0c896f6388bd70e8d3")
!139 = !{!140}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !138, file: !2, baseType: !7, align: 8, offset: 8, flags: DIFlagPublic)
!141 = !{!142, !143}
!142 = !DITemplateTypeParameter(name: "T", type: !7)
!143 = !DITemplateTypeParameter(name: "E", type: !144)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !119, file: !2, align: 8, flags: DIFlagPublic, elements: !12, identifier: "d17669f544649e4d3c30d94bedbae837")
!145 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !135, file: !2, baseType: !146, size: 8, align: 8, extraData: i128 1)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !132, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !147, templateParams: !141, identifier: "80756213d1517f212b3869fb72b85f03")
!147 = !{!148}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !146, file: !2, baseType: !144, align: 8, offset: 8, flags: DIFlagPublic)
!149 = !DIDerivedType(tag: DW_TAG_member, scope: !132, file: !2, baseType: !120, size: 8, align: 8, flags: DIFlagArtificial)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&core::ptr::alignment::Alignment", baseType: !21, size: 64, align: 64, dwarfAddressSpace: 0)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !152, size: 64, align: 64, dwarfAddressSpace: 0)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !119, file: !2, size: 512, align: 64, flags: DIFlagPublic, elements: !153, templateParams: !12, identifier: "220d4d9789115bc6b80d4c98d9cf69c5")
!153 = !{!154, !156, !158, !159, !174, !175}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !152, file: !2, baseType: !155, size: 32, align: 32, offset: 416, flags: DIFlagPrivate)
!155 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !152, file: !2, baseType: !157, size: 32, align: 32, offset: 384, flags: DIFlagPrivate)
!157 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !152, file: !2, baseType: !117, size: 8, align: 8, offset: 448, flags: DIFlagPrivate)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !152, file: !2, baseType: !160, size: 128, align: 64, flags: DIFlagPrivate)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !161, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !162, templateParams: !12, identifier: "95187db8a945f0b837c05a93dbca053d")
!161 = !DINamespace(name: "option", scope: !25)
!162 = !{!163}
!163 = !DICompositeType(tag: DW_TAG_variant_part, scope: !160, file: !2, size: 128, align: 64, elements: !164, templateParams: !12, identifier: "bf03ad1423ace5c017f1cefbab0a44f7", discriminator: !173)
!164 = !{!165, !169}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !163, file: !2, baseType: !166, size: 128, align: 64, extraData: i128 0)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !160, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !12, templateParams: !167, identifier: "28c1259e655b5c63dfdc8863b3b586eb")
!167 = !{!168}
!168 = !DITemplateTypeParameter(name: "T", type: !9)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !163, file: !2, baseType: !170, size: 128, align: 64, extraData: i128 1)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !160, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !171, templateParams: !167, identifier: "455fdfcabbfecd5a717255e285761794")
!171 = !{!172}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !170, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!173 = !DIDerivedType(tag: DW_TAG_member, scope: !160, file: !2, baseType: !29, size: 64, align: 64, flags: DIFlagArtificial)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !152, file: !2, baseType: !160, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !152, file: !2, baseType: !176, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !177, templateParams: !12, identifier: "94f817b1adbb3ab96b0635104fb3fde3")
!177 = !{!178, !181}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !176, file: !2, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64, dwarfAddressSpace: 0)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !12, identifier: "72805e6673b6ad52ecf81cbad56f4147")
!181 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !176, file: !2, baseType: !182, size: 64, align: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !183, size: 64, align: 64, dwarfAddressSpace: 0)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 3, lowerBound: 0)
!186 = !{!187, !188}
!187 = !DILocalVariable(name: "self", arg: 1, scope: !127, file: !128, line: 2333, type: !150)
!188 = !DILocalVariable(name: "f", arg: 2, scope: !127, file: !128, line: 2333, type: !151)
!189 = !{!190}
!190 = !DITemplateTypeParameter(name: "T", type: !22)
!191 = !DILocation(line: 2333, column: 20, scope: !127)
!192 = !DILocation(line: 2333, column: 27, scope: !127)
!193 = !DILocation(line: 2333, column: 71, scope: !127)
!194 = !{i64 8}
!195 = !DILocation(line: 2333, column: 62, scope: !127)
!196 = !DILocation(line: 2333, column: 84, scope: !127)
!197 = distinct !DISubprogram(name: "fmt<core::alloc::layout::Layout>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h4174bf044bff7e2fE", scope: !129, file: !128, line: 2333, type: !198, scopeLine: 2333, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !114, templateParams: !204, retainedNodes: !201)
!198 = !DISubroutineType(types: !199)
!199 = !{!132, !200, !151}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&core::alloc::layout::Layout", baseType: !103, size: 64, align: 64, dwarfAddressSpace: 0)
!201 = !{!202, !203}
!202 = !DILocalVariable(name: "self", arg: 1, scope: !197, file: !128, line: 2333, type: !200)
!203 = !DILocalVariable(name: "f", arg: 2, scope: !197, file: !128, line: 2333, type: !151)
!204 = !{!205}
!205 = !DITemplateTypeParameter(name: "T", type: !104)
!206 = !DILocation(line: 2333, column: 20, scope: !197)
!207 = !DILocation(line: 2333, column: 27, scope: !197)
!208 = !DILocation(line: 2333, column: 71, scope: !197)
!209 = !DILocation(line: 2333, column: 62, scope: !197)
!210 = !DILocation(line: 2333, column: 84, scope: !197)
!211 = distinct !DISubprogram(name: "fmt<smallvec::CollectionAllocErr>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17hc0810d6bee8db242E", scope: !129, file: !128, line: 2333, type: !212, scopeLine: 2333, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !114, templateParams: !231, retainedNodes: !228)
!212 = !DISubroutineType(types: !213)
!213 = !{!132, !214, !151}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&smallvec::CollectionAllocErr", baseType: !215, size: 64, align: 64, dwarfAddressSpace: 0)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&smallvec::CollectionAllocErr", baseType: !216, size: 64, align: 64, dwarfAddressSpace: 0)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "CollectionAllocErr", scope: !217, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !218, templateParams: !12, identifier: "92ba1a0285f694c720efbe637195e660")
!217 = !DINamespace(name: "smallvec", scope: null)
!218 = !{!219}
!219 = !DICompositeType(tag: DW_TAG_variant_part, scope: !216, file: !2, size: 128, align: 64, elements: !220, templateParams: !12, identifier: "c0654e8f34a851ea1a8fc400ca16e35", discriminator: !227)
!220 = !{!221, !223}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "CapacityOverflow", scope: !219, file: !2, baseType: !222, size: 128, align: 64, extraData: i128 0)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "CapacityOverflow", scope: !216, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !12, identifier: "ca2028cf3da0f91a5c762a6e08835e31")
!223 = !DIDerivedType(tag: DW_TAG_member, name: "AllocErr", scope: !219, file: !2, baseType: !224, size: 128, align: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "AllocErr", scope: !216, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !225, templateParams: !12, identifier: "bf4b0fdacdb245365bdd552cdf51f8c")
!225 = !{!226}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "layout", scope: !224, file: !2, baseType: !104, size: 128, align: 64, flags: DIFlagPublic)
!227 = !DIDerivedType(tag: DW_TAG_member, scope: !216, file: !2, baseType: !29, size: 64, align: 64, flags: DIFlagArtificial)
!228 = !{!229, !230}
!229 = !DILocalVariable(name: "self", arg: 1, scope: !211, file: !128, line: 2333, type: !214)
!230 = !DILocalVariable(name: "f", arg: 2, scope: !211, file: !128, line: 2333, type: !151)
!231 = !{!232}
!232 = !DITemplateTypeParameter(name: "T", type: !216)
!233 = !DILocation(line: 2333, column: 20, scope: !211)
!234 = !DILocation(line: 2333, column: 27, scope: !211)
!235 = !DILocation(line: 2333, column: 71, scope: !211)
!236 = !DILocation(line: 2333, column: 62, scope: !211)
!237 = !DILocation(line: 2333, column: 84, scope: !211)
!238 = distinct !DISubprogram(name: "is_val_statically_known<bool>", linkageName: "_ZN4core10intrinsics23is_val_statically_known17h6911c2a1b260d244E", scope: !240, file: !239, line: 2627, type: !241, scopeLine: 2627, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !114, templateParams: !246, retainedNodes: !244)
!239 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "8e44aa294dd7cc4c037d8b6ff42222a3")
!240 = !DINamespace(name: "intrinsics", scope: !25)
!241 = !DISubroutineType(types: !242)
!242 = !{!243, !243}
!243 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!244 = !{!245}
!245 = !DILocalVariable(name: "_arg", arg: 1, scope: !238, file: !239, line: 2627, type: !243)
!246 = !{!247}
!247 = !DITemplateTypeParameter(name: "T", type: !243)
!248 = !DILocation(line: 2627, column: 47, scope: !238)
!249 = !DILocation(line: 2629, column: 2, scope: !238)
!250 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num52_$LT$impl$u20$core..fmt..Debug$u20$for$u20$usize$GT$3fmt17hab31490aa3bf67e1E", scope: !252, file: !251, line: 189, type: !254, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !114, templateParams: !12, retainedNodes: !257)
!251 = !DIFile(filename: "/rustc/46b180ec2452d388c5d9c14009442e2e0beb01d7/library/core/src/fmt/num.rs", directory: "", checksumkind: CSK_MD5, checksum: "e54845ef989d12b8a79056a0477bb701")
!252 = !DINamespace(name: "{impl#89}", scope: !253)
!253 = !DINamespace(name: "num", scope: !119)
!254 = !DISubroutineType(types: !255)
!255 = !{!132, !256, !151}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!257 = !{!258, !259}
!258 = !DILocalVariable(name: "self", arg: 1, scope: !250, file: !251, line: 189, type: !256)
!259 = !DILocalVariable(name: "f", arg: 2, scope: !250, file: !251, line: 189, type: !151)
!260 = !DILocation(line: 189, column: 20, scope: !250)
!261 = !DILocation(line: 189, column: 27, scope: !250)
!262 = !DILocalVariable(name: "self", arg: 1, scope: !263, file: !128, line: 1886, type: !151)
!263 = distinct !DILexicalBlock(scope: !264, file: !128, line: 1886, column: 5)
!264 = distinct !DISubprogram(name: "debug_lower_hex", linkageName: "_ZN4core3fmt9Formatter15debug_lower_hex17hafb60cefe3c4c7d8E", scope: !152, file: !128, line: 1886, type: !265, scopeLine: 1886, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !114, templateParams: !12, declaration: !268, retainedNodes: !269)
!265 = !DISubroutineType(types: !266)
!266 = !{!243, !267}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::Formatter", baseType: !152, size: 64, align: 64, dwarfAddressSpace: 0)
!268 = !DISubprogram(name: "debug_lower_hex", linkageName: "_ZN4core3fmt9Formatter15debug_lower_hex17hafb60cefe3c4c7d8E", scope: !152, file: !128, line: 1886, type: !265, scopeLine: 1886, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !12)
!269 = !{!262}
!270 = !DILocation(line: 1886, column: 24, scope: !263, inlinedAt: !271)
!271 = !DILocation(line: 190, column: 22, scope: !250)
!272 = !DILocalVariable(name: "self", arg: 1, scope: !273, file: !128, line: 1890, type: !151)
!273 = distinct !DILexicalBlock(scope: !274, file: !128, line: 1890, column: 5)
!274 = distinct !DISubprogram(name: "debug_upper_hex", linkageName: "_ZN4core3fmt9Formatter15debug_upper_hex17h8eb5640731d788b3E", scope: !152, file: !128, line: 1890, type: !265, scopeLine: 1890, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !114, templateParams: !12, declaration: !275, retainedNodes: !276)
!275 = !DISubprogram(name: "debug_upper_hex", linkageName: "_ZN4core3fmt9Formatter15debug_upper_hex17h8eb5640731d788b3E", scope: !152, file: !128, line: 1890, type: !265, scopeLine: 1890, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !12)
!276 = !{!272}
!277 = !DILocation(line: 1890, column: 24, scope: !273, inlinedAt: !278)
!278 = !DILocation(line: 192, column: 29, scope: !250)
!279 = !DILocation(line: 1887, column: 9, scope: !263, inlinedAt: !271)
!280 = !DILocation(line: 190, column: 20, scope: !250)
!281 = !DILocation(line: 1891, column: 9, scope: !273, inlinedAt: !278)
!282 = !DILocation(line: 192, column: 27, scope: !250)
!283 = !DILocation(line: 191, column: 21, scope: !250)
!284 = !DILocation(line: 195, column: 21, scope: !250)
!285 = !DILocation(line: 193, column: 21, scope: !250)
!286 = !DILocation(line: 190, column: 17, scope: !250)
!287 = !DILocation(line: 197, column: 14, scope: !250)
!288 = !{i8 0, i8 2}
!289 = distinct !DISubprogram(name: "as_const_str", linkageName: "_ZN4core3fmt9Arguments12as_const_str17h6fccc7861ec9325aE", scope: !290, file: !128, line: 445, type: !361, scopeLine: 445, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !114, templateParams: !12, declaration: !377, retainedNodes: !378)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !119, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !291, templateParams: !12, identifier: "f5a94cea047ca3dea35120609d07d08d")
!291 = !{!292, !303, !345}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !290, file: !2, baseType: !293, size: 128, align: 64, flags: DIFlagPrivate)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !294, templateParams: !12, identifier: "d76b83877ddcb5cca61caf6bdca727ac")
!294 = !{!295, !302}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !293, file: !2, baseType: !296, size: 64, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64, dwarfAddressSpace: 0)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !298, templateParams: !12, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!298 = !{!299, !301}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !297, file: !2, baseType: !300, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64, dwarfAddressSpace: 0)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !297, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !293, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !290, file: !2, baseType: !304, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !161, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !305, templateParams: !12, identifier: "676f3d473eca9d85e7b8651af934444b")
!305 = !{!306}
!306 = !DICompositeType(tag: DW_TAG_variant_part, scope: !304, file: !2, size: 128, align: 64, elements: !307, templateParams: !12, identifier: "bfd14ac579232dd88fd2b0d1ad576493", discriminator: !344)
!307 = !{!308, !340}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !306, file: !2, baseType: !309, size: 128, align: 64, extraData: i128 0)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !304, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !12, templateParams: !310, identifier: "5cf1cdc1741ffabf116481b417e76678")
!310 = !{!311}
!311 = !DITemplateTypeParameter(name: "T", type: !312)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !2, size: 128, align: 64, elements: !313, templateParams: !12, identifier: "335f0a904b053f61c731d86311ceff8c")
!313 = !{!314, !339}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !312, file: !2, baseType: !315, size: 64, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64, dwarfAddressSpace: 0)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !118, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !317, templateParams: !12, identifier: "f4039c5a35e0fee7484a39b4635b170f")
!317 = !{!318, !319, !320, !321, !322, !338}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !316, file: !2, baseType: !9, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !316, file: !2, baseType: !157, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !316, file: !2, baseType: !117, size: 8, align: 8, offset: 384, flags: DIFlagPublic)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !316, file: !2, baseType: !155, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !316, file: !2, baseType: !323, size: 128, align: 64, flags: DIFlagPublic)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !118, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !324, templateParams: !12, identifier: "2ae93a82e88590f730796e48e70a07a7")
!324 = !{!325}
!325 = !DICompositeType(tag: DW_TAG_variant_part, scope: !323, file: !2, size: 128, align: 64, elements: !326, templateParams: !12, identifier: "c67f77b46946c26a4aac980956de48d6", discriminator: !337)
!326 = !{!327, !331, !335}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !325, file: !2, baseType: !328, size: 128, align: 64, extraData: i128 0)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !323, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !329, templateParams: !12, identifier: "383bd1cd71fc68e2ba1c3f7e48543eff")
!329 = !{!330}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !328, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !325, file: !2, baseType: !332, size: 128, align: 64, extraData: i128 1)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !323, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !333, templateParams: !12, identifier: "ec135ad2d61c9b7e82d9f77c7d2136ad")
!333 = !{!334}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !332, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !325, file: !2, baseType: !336, size: 128, align: 64, extraData: i128 2)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !323, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !12, identifier: "163729ef05b181fe4923856687999017")
!337 = !DIDerivedType(tag: DW_TAG_member, scope: !323, file: !2, baseType: !29, size: 64, align: 64, flags: DIFlagArtificial)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !316, file: !2, baseType: !323, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !312, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !306, file: !2, baseType: !341, size: 128, align: 64)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !304, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !342, templateParams: !310, identifier: "e3ff8c9215bd247d238f3585ea2dd2a4")
!342 = !{!343}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !341, file: !2, baseType: !312, size: 128, align: 64, flags: DIFlagPublic)
!344 = !DIDerivedType(tag: DW_TAG_member, scope: !304, file: !2, baseType: !29, size: 64, align: 64, flags: DIFlagArtificial)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !290, file: !2, baseType: !346, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !2, size: 128, align: 64, elements: !347, templateParams: !12, identifier: "f76267ba6692cc2d9e32e5839363f281")
!347 = !{!348, !360}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !346, file: !2, baseType: !349, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64, dwarfAddressSpace: 0)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !118, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !351, templateParams: !12, identifier: "6a921f2d5114932f602f7e7bc4389cf9")
!351 = !{!352, !356}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !350, file: !2, baseType: !353, size: 64, align: 64, flags: DIFlagPrivate)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::rt::{extern#0}::Opaque", baseType: !354, size: 64, align: 64, dwarfAddressSpace: 0)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !355, file: !2, align: 8, elements: !12, identifier: "4982ad5e14ab39475d76ca1d05f6c500")
!355 = !DINamespace(name: "{extern#0}", scope: !118)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !350, file: !2, baseType: !357, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::rt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !358, size: 64, align: 64, dwarfAddressSpace: 0)
!358 = !DISubroutineType(types: !359)
!359 = !{!132, !353, !151}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !346, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!363, !376}
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&str>", scope: !161, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !364, templateParams: !12, identifier: "936c8253b26fdbdbd371f86b598077f")
!364 = !{!365}
!365 = !DICompositeType(tag: DW_TAG_variant_part, scope: !363, file: !2, size: 128, align: 64, elements: !366, templateParams: !12, identifier: "c37659452c396c05c51c0ec9efbf4d2d", discriminator: !375)
!366 = !{!367, !371}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !365, file: !2, baseType: !368, size: 128, align: 64, extraData: i128 0)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !363, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !12, templateParams: !369, identifier: "c15c9e029a63bfba76e8c756530457d")
!369 = !{!370}
!370 = !DITemplateTypeParameter(name: "T", type: !297)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !365, file: !2, baseType: !372, size: 128, align: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !363, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !373, templateParams: !369, identifier: "d06e72ee534abde8342f269c82f1f638")
!373 = !{!374}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !372, file: !2, baseType: !297, size: 128, align: 64, flags: DIFlagPublic)
!375 = !DIDerivedType(tag: DW_TAG_member, scope: !363, file: !2, baseType: !29, size: 64, align: 64, flags: DIFlagArtificial)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::Arguments", baseType: !290, size: 64, align: 64, dwarfAddressSpace: 0)
!377 = !DISubprogram(name: "as_const_str", linkageName: "_ZN4core3fmt9Arguments12as_const_str17h6fccc7861ec9325aE", scope: !290, file: !128, line: 445, type: !361, scopeLine: 445, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !12)
!378 = !{!379, !380}
!379 = !DILocalVariable(name: "self", arg: 1, scope: !289, file: !128, line: 445, type: !376)
!380 = !DILocalVariable(name: "s", scope: !381, file: !128, line: 446, type: !363, align: 8)
!381 = distinct !DILexicalBlock(scope: !289, file: !128, line: 446, column: 9)
!382 = !DILocation(line: 445, column: 21, scope: !289)
!383 = !DILocalVariable(name: "self", arg: 1, scope: !384, file: !128, line: 434, type: !376)
!384 = distinct !DILexicalBlock(scope: !385, file: !128, line: 434, column: 5)
!385 = distinct !DISubprogram(name: "as_str", linkageName: "_ZN4core3fmt9Arguments6as_str17h064f37ec5c42ca20E", scope: !290, file: !128, line: 434, type: !361, scopeLine: 434, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !114, templateParams: !12, declaration: !386, retainedNodes: !387)
!386 = !DISubprogram(name: "as_str", linkageName: "_ZN4core3fmt9Arguments6as_str17h064f37ec5c42ca20E", scope: !290, file: !128, line: 434, type: !361, scopeLine: 434, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !12)
!387 = !{!383, !388}
!388 = !DILocalVariable(name: "s", scope: !389, file: !128, line: 437, type: !390, align: 8)
!389 = distinct !DILexicalBlock(scope: !384, file: !128, line: 437, column: 13)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&str", baseType: !297, size: 64, align: 64, dwarfAddressSpace: 0)
!391 = !DILocation(line: 434, column: 25, scope: !384, inlinedAt: !392)
!392 = !DILocation(line: 446, column: 22, scope: !289)
!393 = !DILocation(line: 446, column: 13, scope: !381)
!394 = !DILocation(line: 435, column: 16, scope: !384, inlinedAt: !392)
!395 = !DILocation(line: 435, column: 29, scope: !384, inlinedAt: !392)
!396 = !DILocation(line: 436, column: 14, scope: !384, inlinedAt: !392)
!397 = !DILocation(line: 436, column: 18, scope: !384, inlinedAt: !392)
!398 = !DILocation(line: 437, column: 14, scope: !384, inlinedAt: !392)
